Model: "model_92"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_47 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_552 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_47[0][0]'] 
                                                                                                  
 batch_normalization_552 (Batch  (None, 25, 48)      192         ['conv1d_552[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_552 (Activation)    (None, 25, 48)       0           ['batch_normalization_552[0][0]']
                                                                                                  
 spatial_dropout1d_276 (Spatial  (None, 25, 48)      0           ['activation_552[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_553 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_47[0][0]'] 
                                                                                                  
 max_pooling1d_276 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_276[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_553 (Batch  (None, 13, 48)      192         ['conv1d_553[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_276 (Add)                  (None, 13, 48)       0           ['max_pooling1d_276[0][0]',      
                                                                  'batch_normalization_553[0][0]']
                                                                                                  
 activation_553 (Activation)    (None, 13, 48)       0           ['add_276[0][0]']                
                                                                                                  
 conv1d_554 (Conv1D)            (None, 13, 96)       13920       ['activation_553[0][0]']         
                                                                                                  
 batch_normalization_554 (Batch  (None, 13, 96)      384         ['conv1d_554[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_554 (Activation)    (None, 13, 96)       0           ['batch_normalization_554[0][0]']
                                                                                                  
 spatial_dropout1d_277 (Spatial  (None, 13, 96)      0           ['activation_554[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_555 (Conv1D)            (None, 7, 96)        4704        ['activation_553[0][0]']         
                                                                                                  
 max_pooling1d_277 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_277[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_555 (Batch  (None, 7, 96)       384         ['conv1d_555[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_277 (Add)                  (None, 7, 96)        0           ['max_pooling1d_277[0][0]',      
                                                                  'batch_normalization_555[0][0]']
                                                                                                  
 activation_555 (Activation)    (None, 7, 96)        0           ['add_277[0][0]']                
                                                                                                  
 conv1d_556 (Conv1D)            (None, 7, 192)       55488       ['activation_555[0][0]']         
                                                                                                  
 batch_normalization_556 (Batch  (None, 7, 192)      768         ['conv1d_556[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_556 (Activation)    (None, 7, 192)       0           ['batch_normalization_556[0][0]']
                                                                                                  
 spatial_dropout1d_278 (Spatial  (None, 7, 192)      0           ['activation_556[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_557 (Conv1D)            (None, 4, 192)       18624       ['activation_555[0][0]']         
                                                                                                  
 max_pooling1d_278 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_278[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_557 (Batch  (None, 4, 192)      768         ['conv1d_557[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_278 (Add)                  (None, 4, 192)       0           ['max_pooling1d_278[0][0]',      
                                                                  'batch_normalization_557[0][0]']
                                                                                                  
 activation_557 (Activation)    (None, 4, 192)       0           ['add_278[0][0]']                
                                                                                                  
 global_average_pooling1d_92 (G  (None, 192)         0           ['activation_557[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_92 (Globa  (None, 192)         0           ['activation_557[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_92 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_92[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_92[0][0]']
                                                                                                  
 dropout_184 (Dropout)          (None, 384)          0           ['concatenate_92[0][0]']         
                                                                                                  
 dense_92 (Dense)               (None, 128)          49280       ['dropout_184[0][0]']            
                                                                                                  
 dropout_185 (Dropout)          (None, 128)          0           ['dense_92[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_185[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_185[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 156,899
Trainable params: 155,555
Non-trainable params: 1,344
__________________________________________________________________________________________________
