Model: "model_33"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_15 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_198 (Conv1D)            (None, 25, 48)       39792       ['enhanced_preprocessing_15[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_198 (Batch  (None, 25, 48)      192         ['conv1d_198[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_198 (Activation)    (None, 25, 48)       0           ['batch_normalization_198[0][0]']
                                                                                                  
 spatial_dropout1d_99 (SpatialD  (None, 25, 48)      0           ['activation_198[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_199 (Conv1D)            (None, 13, 48)       13296       ['enhanced_preprocessing_15[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_99 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_99[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_199 (Batch  (None, 13, 48)      192         ['conv1d_199[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_99 (Add)                   (None, 13, 48)       0           ['max_pooling1d_99[0][0]',       
                                                                  'batch_normalization_199[0][0]']
                                                                                                  
 activation_199 (Activation)    (None, 13, 48)       0           ['add_99[0][0]']                 
                                                                                                  
 conv1d_200 (Conv1D)            (None, 13, 96)       13920       ['activation_199[0][0]']         
                                                                                                  
 batch_normalization_200 (Batch  (None, 13, 96)      384         ['conv1d_200[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_200 (Activation)    (None, 13, 96)       0           ['batch_normalization_200[0][0]']
                                                                                                  
 spatial_dropout1d_100 (Spatial  (None, 13, 96)      0           ['activation_200[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_201 (Conv1D)            (None, 7, 96)        4704        ['activation_199[0][0]']         
                                                                                                  
 max_pooling1d_100 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_100[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_201 (Batch  (None, 7, 96)       384         ['conv1d_201[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_100 (Add)                  (None, 7, 96)        0           ['max_pooling1d_100[0][0]',      
                                                                  'batch_normalization_201[0][0]']
                                                                                                  
 activation_201 (Activation)    (None, 7, 96)        0           ['add_100[0][0]']                
                                                                                                  
 conv1d_202 (Conv1D)            (None, 7, 192)       55488       ['activation_201[0][0]']         
                                                                                                  
 batch_normalization_202 (Batch  (None, 7, 192)      768         ['conv1d_202[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_202 (Activation)    (None, 7, 192)       0           ['batch_normalization_202[0][0]']
                                                                                                  
 spatial_dropout1d_101 (Spatial  (None, 7, 192)      0           ['activation_202[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_203 (Conv1D)            (None, 4, 192)       18624       ['activation_201[0][0]']         
                                                                                                  
 max_pooling1d_101 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_101[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_203 (Batch  (None, 4, 192)      768         ['conv1d_203[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_101 (Add)                  (None, 4, 192)       0           ['max_pooling1d_101[0][0]',      
                                                                  'batch_normalization_203[0][0]']
                                                                                                  
 activation_203 (Activation)    (None, 4, 192)       0           ['add_101[0][0]']                
                                                                                                  
 global_average_pooling1d_33 (G  (None, 192)         0           ['activation_203[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_33 (Globa  (None, 192)         0           ['activation_203[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_33 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_33[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_33[0][0]']
                                                                                                  
 dropout_66 (Dropout)           (None, 384)          0           ['concatenate_33[0][0]']         
                                                                                                  
 dense_33 (Dense)               (None, 128)          49280       ['dropout_66[0][0]']             
                                                                                                  
 dropout_67 (Dropout)           (None, 128)          0           ['dense_33[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_67[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_67[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 198,179
Trainable params: 196,835
Non-trainable params: 1,344
__________________________________________________________________________________________________
