Model: "model_15"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_6 (Enha  (None, 25, 123)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_90 (Conv1D)             (None, 25, 16)       5920        ['enhanced_preprocessing_6[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_90 (BatchN  (None, 25, 16)      64          ['conv1d_90[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_90 (Activation)     (None, 25, 16)       0           ['batch_normalization_90[0][0]'] 
                                                                                                  
 spatial_dropout1d_45 (SpatialD  (None, 25, 16)      0           ['activation_90[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_91 (Conv1D)             (None, 13, 16)       1984        ['enhanced_preprocessing_6[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_45 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_45[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_91 (BatchN  (None, 13, 16)      64          ['conv1d_91[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_45 (Add)                   (None, 13, 16)       0           ['max_pooling1d_45[0][0]',       
                                                                  'batch_normalization_91[0][0]'] 
                                                                                                  
 activation_91 (Activation)     (None, 13, 16)       0           ['add_45[0][0]']                 
                                                                                                  
 conv1d_92 (Conv1D)             (None, 13, 32)       1568        ['activation_91[0][0]']          
                                                                                                  
 batch_normalization_92 (BatchN  (None, 13, 32)      128         ['conv1d_92[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_92 (Activation)     (None, 13, 32)       0           ['batch_normalization_92[0][0]'] 
                                                                                                  
 spatial_dropout1d_46 (SpatialD  (None, 13, 32)      0           ['activation_92[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_93 (Conv1D)             (None, 7, 32)        544         ['activation_91[0][0]']          
                                                                                                  
 max_pooling1d_46 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_46[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_93 (BatchN  (None, 7, 32)       128         ['conv1d_93[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_46 (Add)                   (None, 7, 32)        0           ['max_pooling1d_46[0][0]',       
                                                                  'batch_normalization_93[0][0]'] 
                                                                                                  
 activation_93 (Activation)     (None, 7, 32)        0           ['add_46[0][0]']                 
                                                                                                  
 conv1d_94 (Conv1D)             (None, 7, 64)        6208        ['activation_93[0][0]']          
                                                                                                  
 batch_normalization_94 (BatchN  (None, 7, 64)       256         ['conv1d_94[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_94 (Activation)     (None, 7, 64)        0           ['batch_normalization_94[0][0]'] 
                                                                                                  
 spatial_dropout1d_47 (SpatialD  (None, 7, 64)       0           ['activation_94[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_95 (Conv1D)             (None, 4, 64)        2112        ['activation_93[0][0]']          
                                                                                                  
 max_pooling1d_47 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_47[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_95 (BatchN  (None, 4, 64)       256         ['conv1d_95[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_47 (Add)                   (None, 4, 64)        0           ['max_pooling1d_47[0][0]',       
                                                                  'batch_normalization_95[0][0]'] 
                                                                                                  
 activation_95 (Activation)     (None, 4, 64)        0           ['add_47[0][0]']                 
                                                                                                  
 global_average_pooling1d_15 (G  (None, 64)          0           ['activation_95[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_15 (Globa  (None, 64)          0           ['activation_95[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_15 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_15[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_15[0][0]']
                                                                                                  
 dropout_30 (Dropout)           (None, 128)          0           ['concatenate_15[0][0]']         
                                                                                                  
 dense_15 (Dense)               (None, 128)          16512       ['dropout_30[0][0]']             
                                                                                                  
 dropout_31 (Dropout)           (None, 128)          0           ['dense_15[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_31[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_31[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 36,131
Trainable params: 35,683
Non-trainable params: 448
__________________________________________________________________________________________________
