Model: "model_106"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_52 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_636 (Conv1D)            (None, 25, 16)       13264       ['enhanced_preprocessing_52[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_636 (Batch  (None, 25, 16)      64          ['conv1d_636[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_636 (Activation)    (None, 25, 16)       0           ['batch_normalization_636[0][0]']
                                                                                                  
 spatial_dropout1d_318 (Spatial  (None, 25, 16)      0           ['activation_636[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_637 (Conv1D)            (None, 13, 16)       4432        ['enhanced_preprocessing_52[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_318 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_318[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_637 (Batch  (None, 13, 16)      64          ['conv1d_637[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_318 (Add)                  (None, 13, 16)       0           ['max_pooling1d_318[0][0]',      
                                                                  'batch_normalization_637[0][0]']
                                                                                                  
 activation_637 (Activation)    (None, 13, 16)       0           ['add_318[0][0]']                
                                                                                                  
 conv1d_638 (Conv1D)            (None, 13, 32)       1568        ['activation_637[0][0]']         
                                                                                                  
 batch_normalization_638 (Batch  (None, 13, 32)      128         ['conv1d_638[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_638 (Activation)    (None, 13, 32)       0           ['batch_normalization_638[0][0]']
                                                                                                  
 spatial_dropout1d_319 (Spatial  (None, 13, 32)      0           ['activation_638[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_639 (Conv1D)            (None, 7, 32)        544         ['activation_637[0][0]']         
                                                                                                  
 max_pooling1d_319 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_319[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_639 (Batch  (None, 7, 32)       128         ['conv1d_639[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_319 (Add)                  (None, 7, 32)        0           ['max_pooling1d_319[0][0]',      
                                                                  'batch_normalization_639[0][0]']
                                                                                                  
 activation_639 (Activation)    (None, 7, 32)        0           ['add_319[0][0]']                
                                                                                                  
 conv1d_640 (Conv1D)            (None, 7, 64)        6208        ['activation_639[0][0]']         
                                                                                                  
 batch_normalization_640 (Batch  (None, 7, 64)       256         ['conv1d_640[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_640 (Activation)    (None, 7, 64)        0           ['batch_normalization_640[0][0]']
                                                                                                  
 spatial_dropout1d_320 (Spatial  (None, 7, 64)       0           ['activation_640[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_641 (Conv1D)            (None, 4, 64)        2112        ['activation_639[0][0]']         
                                                                                                  
 max_pooling1d_320 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_320[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_641 (Batch  (None, 4, 64)       256         ['conv1d_641[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_320 (Add)                  (None, 4, 64)        0           ['max_pooling1d_320[0][0]',      
                                                                  'batch_normalization_641[0][0]']
                                                                                                  
 activation_641 (Activation)    (None, 4, 64)        0           ['add_320[0][0]']                
                                                                                                  
 global_average_pooling1d_106 (  (None, 64)          0           ['activation_641[0][0]']         
 GlobalAveragePooling1D)                                                                          
                                                                                                  
 global_max_pooling1d_106 (Glob  (None, 64)          0           ['activation_641[0][0]']         
 alMaxPooling1D)                                                                                  
                                                                                                  
 concatenate_106 (Concatenate)  (None, 128)          0           ['global_average_pooling1d_106[0]
                                                                 [0]',                            
                                                                  'global_max_pooling1d_106[0][0]'
                                                                 ]                                
                                                                                                  
 dropout_212 (Dropout)          (None, 128)          0           ['concatenate_106[0][0]']        
                                                                                                  
 dense_106 (Dense)              (None, 64)           8256        ['dropout_212[0][0]']            
                                                                                                  
 dropout_213 (Dropout)          (None, 64)           0           ['dense_106[0][0]']              
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_213[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_213[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 37,475
Trainable params: 37,027
Non-trainable params: 448
__________________________________________________________________________________________________
