Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing (BasicPrep  (None, 25, 41)      0           ['input[0][0]']                  
 rocessing)                                                                                       
                                                                                                  
 conv1d (Conv1D)                (None, 25, 16)       1984        ['basic_preprocessing[0][0]']    
                                                                                                  
 batch_normalization (BatchNorm  (None, 25, 16)      64          ['conv1d[0][0]']                 
 alization)                                                                                       
                                                                                                  
 activation (Activation)        (None, 25, 16)       0           ['batch_normalization[0][0]']    
                                                                                                  
 spatial_dropout1d (SpatialDrop  (None, 25, 16)      0           ['activation[0][0]']             
 out1D)                                                                                           
                                                                                                  
 conv1d_1 (Conv1D)              (None, 13, 16)       672         ['basic_preprocessing[0][0]']    
                                                                                                  
 max_pooling1d (MaxPooling1D)   (None, 13, 16)       0           ['spatial_dropout1d[0][0]']      
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 13, 16)      64          ['conv1d_1[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add (Add)                      (None, 13, 16)       0           ['max_pooling1d[0][0]',          
                                                                  'batch_normalization_1[0][0]']  
                                                                                                  
 activation_1 (Activation)      (None, 13, 16)       0           ['add[0][0]']                    
                                                                                                  
 conv1d_2 (Conv1D)              (None, 13, 32)       1568        ['activation_1[0][0]']           
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 13, 32)      128         ['conv1d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_2 (Activation)      (None, 13, 32)       0           ['batch_normalization_2[0][0]']  
                                                                                                  
 spatial_dropout1d_1 (SpatialDr  (None, 13, 32)      0           ['activation_2[0][0]']           
 opout1D)                                                                                         
                                                                                                  
 conv1d_3 (Conv1D)              (None, 7, 32)        544         ['activation_1[0][0]']           
                                                                                                  
 max_pooling1d_1 (MaxPooling1D)  (None, 7, 32)       0           ['spatial_dropout1d_1[0][0]']    
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 7, 32)       128         ['conv1d_3[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add_1 (Add)                    (None, 7, 32)        0           ['max_pooling1d_1[0][0]',        
                                                                  'batch_normalization_3[0][0]']  
                                                                                                  
 activation_3 (Activation)      (None, 7, 32)        0           ['add_1[0][0]']                  
                                                                                                  
 conv1d_4 (Conv1D)              (None, 7, 64)        6208        ['activation_3[0][0]']           
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 7, 64)       256         ['conv1d_4[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_4 (Activation)      (None, 7, 64)        0           ['batch_normalization_4[0][0]']  
                                                                                                  
 spatial_dropout1d_2 (SpatialDr  (None, 7, 64)       0           ['activation_4[0][0]']           
 opout1D)                                                                                         
                                                                                                  
 conv1d_5 (Conv1D)              (None, 4, 64)        2112        ['activation_3[0][0]']           
                                                                                                  
 max_pooling1d_2 (MaxPooling1D)  (None, 4, 64)       0           ['spatial_dropout1d_2[0][0]']    
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 4, 64)       256         ['conv1d_5[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add_2 (Add)                    (None, 4, 64)        0           ['max_pooling1d_2[0][0]',        
                                                                  'batch_normalization_5[0][0]']  
                                                                                                  
 activation_5 (Activation)      (None, 4, 64)        0           ['add_2[0][0]']                  
                                                                                                  
 global_average_pooling1d (Glob  (None, 64)          0           ['activation_5[0][0]']           
 alAveragePooling1D)                                                                              
                                                                                                  
 global_max_pooling1d (GlobalMa  (None, 64)          0           ['activation_5[0][0]']           
 xPooling1D)                                                                                      
                                                                                                  
 concatenate (Concatenate)      (None, 128)          0           ['global_average_pooling1d[0][0]'
                                                                 , 'global_max_pooling1d[0][0]']  
                                                                                                  
 dropout (Dropout)              (None, 128)          0           ['concatenate[0][0]']            
                                                                                                  
 dense (Dense)                  (None, 64)           8256        ['dropout[0][0]']                
                                                                                                  
 dropout_1 (Dropout)            (None, 64)           0           ['dense[0][0]']                  
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_1[0][0]']              
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_1[0][0]']              
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 22,435
Trainable params: 21,987
Non-trainable params: 448
__________________________________________________________________________________________________
