Model: "model_88"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_43 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_528 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_43[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_528 (Batch  (None, 25, 48)      192         ['conv1d_528[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_528 (Activation)    (None, 25, 48)       0           ['batch_normalization_528[0][0]']
                                                                                                  
 spatial_dropout1d_264 (Spatial  (None, 25, 48)      0           ['activation_528[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_529 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_43[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_264 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_264[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_529 (Batch  (None, 13, 48)      192         ['conv1d_529[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_264 (Add)                  (None, 13, 48)       0           ['max_pooling1d_264[0][0]',      
                                                                  'batch_normalization_529[0][0]']
                                                                                                  
 activation_529 (Activation)    (None, 13, 48)       0           ['add_264[0][0]']                
                                                                                                  
 conv1d_530 (Conv1D)            (None, 13, 96)       13920       ['activation_529[0][0]']         
                                                                                                  
 batch_normalization_530 (Batch  (None, 13, 96)      384         ['conv1d_530[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_530 (Activation)    (None, 13, 96)       0           ['batch_normalization_530[0][0]']
                                                                                                  
 spatial_dropout1d_265 (Spatial  (None, 13, 96)      0           ['activation_530[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_531 (Conv1D)            (None, 7, 96)        4704        ['activation_529[0][0]']         
                                                                                                  
 max_pooling1d_265 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_265[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_531 (Batch  (None, 7, 96)       384         ['conv1d_531[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_265 (Add)                  (None, 7, 96)        0           ['max_pooling1d_265[0][0]',      
                                                                  'batch_normalization_531[0][0]']
                                                                                                  
 activation_531 (Activation)    (None, 7, 96)        0           ['add_265[0][0]']                
                                                                                                  
 conv1d_532 (Conv1D)            (None, 7, 192)       55488       ['activation_531[0][0]']         
                                                                                                  
 batch_normalization_532 (Batch  (None, 7, 192)      768         ['conv1d_532[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_532 (Activation)    (None, 7, 192)       0           ['batch_normalization_532[0][0]']
                                                                                                  
 spatial_dropout1d_266 (Spatial  (None, 7, 192)      0           ['activation_532[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_533 (Conv1D)            (None, 4, 192)       18624       ['activation_531[0][0]']         
                                                                                                  
 max_pooling1d_266 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_266[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_533 (Batch  (None, 4, 192)      768         ['conv1d_533[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_266 (Add)                  (None, 4, 192)       0           ['max_pooling1d_266[0][0]',      
                                                                  'batch_normalization_533[0][0]']
                                                                                                  
 activation_533 (Activation)    (None, 4, 192)       0           ['add_266[0][0]']                
                                                                                                  
 global_average_pooling1d_88 (G  (None, 192)         0           ['activation_533[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_88 (Globa  (None, 192)         0           ['activation_533[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_88 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_88[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_88[0][0]']
                                                                                                  
 dropout_176 (Dropout)          (None, 384)          0           ['concatenate_88[0][0]']         
                                                                                                  
 dense_88 (Dense)               (None, 128)          49280       ['dropout_176[0][0]']            
                                                                                                  
 dropout_177 (Dropout)          (None, 128)          0           ['dense_88[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_177[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_177[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 180,323
Trainable params: 178,979
Non-trainable params: 1,344
__________________________________________________________________________________________________
