Model: "model_93"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_45 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_558 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_45[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_558 (Batch  (None, 25, 48)      192         ['conv1d_558[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_558 (Activation)    (None, 25, 48)       0           ['batch_normalization_558[0][0]']
                                                                                                  
 spatial_dropout1d_279 (Spatial  (None, 25, 48)      0           ['activation_558[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_559 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_45[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_279 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_279[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_559 (Batch  (None, 13, 48)      192         ['conv1d_559[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_279 (Add)                  (None, 13, 48)       0           ['max_pooling1d_279[0][0]',      
                                                                  'batch_normalization_559[0][0]']
                                                                                                  
 activation_559 (Activation)    (None, 13, 48)       0           ['add_279[0][0]']                
                                                                                                  
 conv1d_560 (Conv1D)            (None, 13, 96)       13920       ['activation_559[0][0]']         
                                                                                                  
 batch_normalization_560 (Batch  (None, 13, 96)      384         ['conv1d_560[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_560 (Activation)    (None, 13, 96)       0           ['batch_normalization_560[0][0]']
                                                                                                  
 spatial_dropout1d_280 (Spatial  (None, 13, 96)      0           ['activation_560[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_561 (Conv1D)            (None, 7, 96)        4704        ['activation_559[0][0]']         
                                                                                                  
 max_pooling1d_280 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_280[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_561 (Batch  (None, 7, 96)       384         ['conv1d_561[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_280 (Add)                  (None, 7, 96)        0           ['max_pooling1d_280[0][0]',      
                                                                  'batch_normalization_561[0][0]']
                                                                                                  
 activation_561 (Activation)    (None, 7, 96)        0           ['add_280[0][0]']                
                                                                                                  
 conv1d_562 (Conv1D)            (None, 7, 192)       55488       ['activation_561[0][0]']         
                                                                                                  
 batch_normalization_562 (Batch  (None, 7, 192)      768         ['conv1d_562[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_562 (Activation)    (None, 7, 192)       0           ['batch_normalization_562[0][0]']
                                                                                                  
 spatial_dropout1d_281 (Spatial  (None, 7, 192)      0           ['activation_562[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_563 (Conv1D)            (None, 4, 192)       18624       ['activation_561[0][0]']         
                                                                                                  
 max_pooling1d_281 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_281[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_563 (Batch  (None, 4, 192)      768         ['conv1d_563[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_281 (Add)                  (None, 4, 192)       0           ['max_pooling1d_281[0][0]',      
                                                                  'batch_normalization_563[0][0]']
                                                                                                  
 activation_563 (Activation)    (None, 4, 192)       0           ['add_281[0][0]']                
                                                                                                  
 global_average_pooling1d_93 (G  (None, 192)         0           ['activation_563[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_93 (Globa  (None, 192)         0           ['activation_563[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_93 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_93[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_93[0][0]']
                                                                                                  
 dropout_186 (Dropout)          (None, 384)          0           ['concatenate_93[0][0]']         
                                                                                                  
 dense_93 (Dense)               (None, 128)          49280       ['dropout_186[0][0]']            
                                                                                                  
 dropout_187 (Dropout)          (None, 128)          0           ['dense_93[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_187[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_187[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 180,323
Trainable params: 178,979
Non-trainable params: 1,344
__________________________________________________________________________________________________
