Model: "model_15"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_6 (Enha  (None, 25, 276)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_90 (Conv1D)             (None, 25, 48)       39792       ['enhanced_preprocessing_6[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_90 (BatchN  (None, 25, 48)      192         ['conv1d_90[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_90 (Activation)     (None, 25, 48)       0           ['batch_normalization_90[0][0]'] 
                                                                                                  
 spatial_dropout1d_45 (SpatialD  (None, 25, 48)      0           ['activation_90[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_91 (Conv1D)             (None, 13, 48)       13296       ['enhanced_preprocessing_6[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_45 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_45[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_91 (BatchN  (None, 13, 48)      192         ['conv1d_91[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_45 (Add)                   (None, 13, 48)       0           ['max_pooling1d_45[0][0]',       
                                                                  'batch_normalization_91[0][0]'] 
                                                                                                  
 activation_91 (Activation)     (None, 13, 48)       0           ['add_45[0][0]']                 
                                                                                                  
 conv1d_92 (Conv1D)             (None, 13, 96)       13920       ['activation_91[0][0]']          
                                                                                                  
 batch_normalization_92 (BatchN  (None, 13, 96)      384         ['conv1d_92[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_92 (Activation)     (None, 13, 96)       0           ['batch_normalization_92[0][0]'] 
                                                                                                  
 spatial_dropout1d_46 (SpatialD  (None, 13, 96)      0           ['activation_92[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_93 (Conv1D)             (None, 7, 96)        4704        ['activation_91[0][0]']          
                                                                                                  
 max_pooling1d_46 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_46[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_93 (BatchN  (None, 7, 96)       384         ['conv1d_93[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_46 (Add)                   (None, 7, 96)        0           ['max_pooling1d_46[0][0]',       
                                                                  'batch_normalization_93[0][0]'] 
                                                                                                  
 activation_93 (Activation)     (None, 7, 96)        0           ['add_46[0][0]']                 
                                                                                                  
 conv1d_94 (Conv1D)             (None, 7, 192)       55488       ['activation_93[0][0]']          
                                                                                                  
 batch_normalization_94 (BatchN  (None, 7, 192)      768         ['conv1d_94[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_94 (Activation)     (None, 7, 192)       0           ['batch_normalization_94[0][0]'] 
                                                                                                  
 spatial_dropout1d_47 (SpatialD  (None, 7, 192)      0           ['activation_94[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_95 (Conv1D)             (None, 4, 192)       18624       ['activation_93[0][0]']          
                                                                                                  
 max_pooling1d_47 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_47[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_95 (BatchN  (None, 4, 192)      768         ['conv1d_95[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_47 (Add)                   (None, 4, 192)       0           ['max_pooling1d_47[0][0]',       
                                                                  'batch_normalization_95[0][0]'] 
                                                                                                  
 activation_95 (Activation)     (None, 4, 192)       0           ['add_47[0][0]']                 
                                                                                                  
 global_average_pooling1d_15 (G  (None, 192)         0           ['activation_95[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_15 (Globa  (None, 192)         0           ['activation_95[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_15 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_15[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_15[0][0]']
                                                                                                  
 dropout_30 (Dropout)           (None, 384)          0           ['concatenate_15[0][0]']         
                                                                                                  
 dense_15 (Dense)               (None, 64)           24640       ['dropout_30[0][0]']             
                                                                                                  
 dropout_31 (Dropout)           (None, 64)           0           ['dense_15[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_31[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_31[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 173,347
Trainable params: 172,003
Non-trainable params: 1,344
__________________________________________________________________________________________________
