Model: "model_24"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_12 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_144 (Conv1D)            (None, 25, 48)       13296       ['basic_preprocessing_12[0][0]'] 
                                                                                                  
 batch_normalization_144 (Batch  (None, 25, 48)      192         ['conv1d_144[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_144 (Activation)    (None, 25, 48)       0           ['batch_normalization_144[0][0]']
                                                                                                  
 spatial_dropout1d_72 (SpatialD  (None, 25, 48)      0           ['activation_144[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_145 (Conv1D)            (None, 13, 48)       4464        ['basic_preprocessing_12[0][0]'] 
                                                                                                  
 max_pooling1d_72 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_72[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_145 (Batch  (None, 13, 48)      192         ['conv1d_145[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_72 (Add)                   (None, 13, 48)       0           ['max_pooling1d_72[0][0]',       
                                                                  'batch_normalization_145[0][0]']
                                                                                                  
 activation_145 (Activation)    (None, 13, 48)       0           ['add_72[0][0]']                 
                                                                                                  
 conv1d_146 (Conv1D)            (None, 13, 96)       13920       ['activation_145[0][0]']         
                                                                                                  
 batch_normalization_146 (Batch  (None, 13, 96)      384         ['conv1d_146[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_146 (Activation)    (None, 13, 96)       0           ['batch_normalization_146[0][0]']
                                                                                                  
 spatial_dropout1d_73 (SpatialD  (None, 13, 96)      0           ['activation_146[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_147 (Conv1D)            (None, 7, 96)        4704        ['activation_145[0][0]']         
                                                                                                  
 max_pooling1d_73 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_73[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_147 (Batch  (None, 7, 96)       384         ['conv1d_147[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_73 (Add)                   (None, 7, 96)        0           ['max_pooling1d_73[0][0]',       
                                                                  'batch_normalization_147[0][0]']
                                                                                                  
 activation_147 (Activation)    (None, 7, 96)        0           ['add_73[0][0]']                 
                                                                                                  
 conv1d_148 (Conv1D)            (None, 7, 192)       55488       ['activation_147[0][0]']         
                                                                                                  
 batch_normalization_148 (Batch  (None, 7, 192)      768         ['conv1d_148[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_148 (Activation)    (None, 7, 192)       0           ['batch_normalization_148[0][0]']
                                                                                                  
 spatial_dropout1d_74 (SpatialD  (None, 7, 192)      0           ['activation_148[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_149 (Conv1D)            (None, 4, 192)       18624       ['activation_147[0][0]']         
                                                                                                  
 max_pooling1d_74 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_74[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_149 (Batch  (None, 4, 192)      768         ['conv1d_149[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_74 (Add)                   (None, 4, 192)       0           ['max_pooling1d_74[0][0]',       
                                                                  'batch_normalization_149[0][0]']
                                                                                                  
 activation_149 (Activation)    (None, 4, 192)       0           ['add_74[0][0]']                 
                                                                                                  
 global_average_pooling1d_24 (G  (None, 192)         0           ['activation_149[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_24 (Globa  (None, 192)         0           ['activation_149[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_24 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_24[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_24[0][0]']
                                                                                                  
 dropout_48 (Dropout)           (None, 384)          0           ['concatenate_24[0][0]']         
                                                                                                  
 dense_24 (Dense)               (None, 128)          49280       ['dropout_48[0][0]']             
                                                                                                  
 dropout_49 (Dropout)           (None, 128)          0           ['dense_24[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_49[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_49[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 162,851
Trainable params: 161,507
Non-trainable params: 1,344
__________________________________________________________________________________________________
