Model: "model_75"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_36 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_450 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_36[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_450 (Batch  (None, 25, 48)      192         ['conv1d_450[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_450 (Activation)    (None, 25, 48)       0           ['batch_normalization_450[0][0]']
                                                                                                  
 spatial_dropout1d_225 (Spatial  (None, 25, 48)      0           ['activation_450[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_451 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_36[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_225 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_225[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_451 (Batch  (None, 13, 48)      192         ['conv1d_451[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_225 (Add)                  (None, 13, 48)       0           ['max_pooling1d_225[0][0]',      
                                                                  'batch_normalization_451[0][0]']
                                                                                                  
 activation_451 (Activation)    (None, 13, 48)       0           ['add_225[0][0]']                
                                                                                                  
 conv1d_452 (Conv1D)            (None, 13, 96)       13920       ['activation_451[0][0]']         
                                                                                                  
 batch_normalization_452 (Batch  (None, 13, 96)      384         ['conv1d_452[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_452 (Activation)    (None, 13, 96)       0           ['batch_normalization_452[0][0]']
                                                                                                  
 spatial_dropout1d_226 (Spatial  (None, 13, 96)      0           ['activation_452[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_453 (Conv1D)            (None, 7, 96)        4704        ['activation_451[0][0]']         
                                                                                                  
 max_pooling1d_226 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_226[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_453 (Batch  (None, 7, 96)       384         ['conv1d_453[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_226 (Add)                  (None, 7, 96)        0           ['max_pooling1d_226[0][0]',      
                                                                  'batch_normalization_453[0][0]']
                                                                                                  
 activation_453 (Activation)    (None, 7, 96)        0           ['add_226[0][0]']                
                                                                                                  
 conv1d_454 (Conv1D)            (None, 7, 192)       55488       ['activation_453[0][0]']         
                                                                                                  
 batch_normalization_454 (Batch  (None, 7, 192)      768         ['conv1d_454[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_454 (Activation)    (None, 7, 192)       0           ['batch_normalization_454[0][0]']
                                                                                                  
 spatial_dropout1d_227 (Spatial  (None, 7, 192)      0           ['activation_454[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_455 (Conv1D)            (None, 4, 192)       18624       ['activation_453[0][0]']         
                                                                                                  
 max_pooling1d_227 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_227[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_455 (Batch  (None, 4, 192)      768         ['conv1d_455[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_227 (Add)                  (None, 4, 192)       0           ['max_pooling1d_227[0][0]',      
                                                                  'batch_normalization_455[0][0]']
                                                                                                  
 activation_455 (Activation)    (None, 4, 192)       0           ['add_227[0][0]']                
                                                                                                  
 global_average_pooling1d_75 (G  (None, 192)         0           ['activation_455[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_75 (Globa  (None, 192)         0           ['activation_455[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_75 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_75[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_75[0][0]']
                                                                                                  
 dropout_150 (Dropout)          (None, 384)          0           ['concatenate_75[0][0]']         
                                                                                                  
 dense_75 (Dense)               (None, 64)           24640       ['dropout_150[0][0]']            
                                                                                                  
 dropout_151 (Dropout)          (None, 64)           0           ['dense_75[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_151[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_151[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 155,491
Trainable params: 154,147
Non-trainable params: 1,344
__________________________________________________________________________________________________
