Model: "model_6"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_3 (BasicPr  (None, 25, 41)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_36 (Conv1D)             (None, 25, 16)       1984        ['basic_preprocessing_3[0][0]']  
                                                                                                  
 batch_normalization_36 (BatchN  (None, 25, 16)      64          ['conv1d_36[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_36 (Activation)     (None, 25, 16)       0           ['batch_normalization_36[0][0]'] 
                                                                                                  
 spatial_dropout1d_18 (SpatialD  (None, 25, 16)      0           ['activation_36[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_37 (Conv1D)             (None, 13, 16)       672         ['basic_preprocessing_3[0][0]']  
                                                                                                  
 max_pooling1d_18 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_18[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_37 (BatchN  (None, 13, 16)      64          ['conv1d_37[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_18 (Add)                   (None, 13, 16)       0           ['max_pooling1d_18[0][0]',       
                                                                  'batch_normalization_37[0][0]'] 
                                                                                                  
 activation_37 (Activation)     (None, 13, 16)       0           ['add_18[0][0]']                 
                                                                                                  
 conv1d_38 (Conv1D)             (None, 13, 32)       1568        ['activation_37[0][0]']          
                                                                                                  
 batch_normalization_38 (BatchN  (None, 13, 32)      128         ['conv1d_38[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_38 (Activation)     (None, 13, 32)       0           ['batch_normalization_38[0][0]'] 
                                                                                                  
 spatial_dropout1d_19 (SpatialD  (None, 13, 32)      0           ['activation_38[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_39 (Conv1D)             (None, 7, 32)        544         ['activation_37[0][0]']          
                                                                                                  
 max_pooling1d_19 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_19[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_39 (BatchN  (None, 7, 32)       128         ['conv1d_39[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_19 (Add)                   (None, 7, 32)        0           ['max_pooling1d_19[0][0]',       
                                                                  'batch_normalization_39[0][0]'] 
                                                                                                  
 activation_39 (Activation)     (None, 7, 32)        0           ['add_19[0][0]']                 
                                                                                                  
 conv1d_40 (Conv1D)             (None, 7, 64)        6208        ['activation_39[0][0]']          
                                                                                                  
 batch_normalization_40 (BatchN  (None, 7, 64)       256         ['conv1d_40[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_40 (Activation)     (None, 7, 64)        0           ['batch_normalization_40[0][0]'] 
                                                                                                  
 spatial_dropout1d_20 (SpatialD  (None, 7, 64)       0           ['activation_40[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_41 (Conv1D)             (None, 4, 64)        2112        ['activation_39[0][0]']          
                                                                                                  
 max_pooling1d_20 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_20[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_41 (BatchN  (None, 4, 64)       256         ['conv1d_41[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_20 (Add)                   (None, 4, 64)        0           ['max_pooling1d_20[0][0]',       
                                                                  'batch_normalization_41[0][0]'] 
                                                                                                  
 activation_41 (Activation)     (None, 4, 64)        0           ['add_20[0][0]']                 
                                                                                                  
 global_average_pooling1d_6 (Gl  (None, 64)          0           ['activation_41[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_6 (Global  (None, 64)          0           ['activation_41[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_6 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_6[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_6[0][0]'] 
                                                                                                  
 dropout_12 (Dropout)           (None, 128)          0           ['concatenate_6[0][0]']          
                                                                                                  
 dense_6 (Dense)                (None, 64)           8256        ['dropout_12[0][0]']             
                                                                                                  
 dropout_13 (Dropout)           (None, 64)           0           ['dense_6[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_13[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_13[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 22,435
Trainable params: 21,987
Non-trainable params: 448
__________________________________________________________________________________________________
