Model: "model_79"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_40 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_474 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_40[0][0]'] 
                                                                                                  
 batch_normalization_474 (Batch  (None, 25, 48)      192         ['conv1d_474[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_474 (Activation)    (None, 25, 48)       0           ['batch_normalization_474[0][0]']
                                                                                                  
 spatial_dropout1d_237 (Spatial  (None, 25, 48)      0           ['activation_474[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_475 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_40[0][0]'] 
                                                                                                  
 max_pooling1d_237 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_237[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_475 (Batch  (None, 13, 48)      192         ['conv1d_475[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_237 (Add)                  (None, 13, 48)       0           ['max_pooling1d_237[0][0]',      
                                                                  'batch_normalization_475[0][0]']
                                                                                                  
 activation_475 (Activation)    (None, 13, 48)       0           ['add_237[0][0]']                
                                                                                                  
 conv1d_476 (Conv1D)            (None, 13, 96)       13920       ['activation_475[0][0]']         
                                                                                                  
 batch_normalization_476 (Batch  (None, 13, 96)      384         ['conv1d_476[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_476 (Activation)    (None, 13, 96)       0           ['batch_normalization_476[0][0]']
                                                                                                  
 spatial_dropout1d_238 (Spatial  (None, 13, 96)      0           ['activation_476[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_477 (Conv1D)            (None, 7, 96)        4704        ['activation_475[0][0]']         
                                                                                                  
 max_pooling1d_238 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_238[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_477 (Batch  (None, 7, 96)       384         ['conv1d_477[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_238 (Add)                  (None, 7, 96)        0           ['max_pooling1d_238[0][0]',      
                                                                  'batch_normalization_477[0][0]']
                                                                                                  
 activation_477 (Activation)    (None, 7, 96)        0           ['add_238[0][0]']                
                                                                                                  
 conv1d_478 (Conv1D)            (None, 7, 192)       55488       ['activation_477[0][0]']         
                                                                                                  
 batch_normalization_478 (Batch  (None, 7, 192)      768         ['conv1d_478[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_478 (Activation)    (None, 7, 192)       0           ['batch_normalization_478[0][0]']
                                                                                                  
 spatial_dropout1d_239 (Spatial  (None, 7, 192)      0           ['activation_478[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_479 (Conv1D)            (None, 4, 192)       18624       ['activation_477[0][0]']         
                                                                                                  
 max_pooling1d_239 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_239[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_479 (Batch  (None, 4, 192)      768         ['conv1d_479[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_239 (Add)                  (None, 4, 192)       0           ['max_pooling1d_239[0][0]',      
                                                                  'batch_normalization_479[0][0]']
                                                                                                  
 activation_479 (Activation)    (None, 4, 192)       0           ['add_239[0][0]']                
                                                                                                  
 global_average_pooling1d_79 (G  (None, 192)         0           ['activation_479[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_79 (Globa  (None, 192)         0           ['activation_479[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_79 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_79[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_79[0][0]']
                                                                                                  
 dropout_158 (Dropout)          (None, 384)          0           ['concatenate_79[0][0]']         
                                                                                                  
 dense_79 (Dense)               (None, 64)           24640       ['dropout_158[0][0]']            
                                                                                                  
 dropout_159 (Dropout)          (None, 64)           0           ['dense_79[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_159[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_159[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 132,067
Trainable params: 130,723
Non-trainable params: 1,344
__________________________________________________________________________________________________
