Model: "model_104"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_53 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_624 (Conv1D)            (None, 25, 16)       4432        ['basic_preprocessing_53[0][0]'] 
                                                                                                  
 batch_normalization_624 (Batch  (None, 25, 16)      64          ['conv1d_624[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_624 (Activation)    (None, 25, 16)       0           ['batch_normalization_624[0][0]']
                                                                                                  
 spatial_dropout1d_312 (Spatial  (None, 25, 16)      0           ['activation_624[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_625 (Conv1D)            (None, 13, 16)       1488        ['basic_preprocessing_53[0][0]'] 
                                                                                                  
 max_pooling1d_312 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_312[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_625 (Batch  (None, 13, 16)      64          ['conv1d_625[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_312 (Add)                  (None, 13, 16)       0           ['max_pooling1d_312[0][0]',      
                                                                  'batch_normalization_625[0][0]']
                                                                                                  
 activation_625 (Activation)    (None, 13, 16)       0           ['add_312[0][0]']                
                                                                                                  
 conv1d_626 (Conv1D)            (None, 13, 32)       1568        ['activation_625[0][0]']         
                                                                                                  
 batch_normalization_626 (Batch  (None, 13, 32)      128         ['conv1d_626[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_626 (Activation)    (None, 13, 32)       0           ['batch_normalization_626[0][0]']
                                                                                                  
 spatial_dropout1d_313 (Spatial  (None, 13, 32)      0           ['activation_626[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_627 (Conv1D)            (None, 7, 32)        544         ['activation_625[0][0]']         
                                                                                                  
 max_pooling1d_313 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_313[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_627 (Batch  (None, 7, 32)       128         ['conv1d_627[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_313 (Add)                  (None, 7, 32)        0           ['max_pooling1d_313[0][0]',      
                                                                  'batch_normalization_627[0][0]']
                                                                                                  
 activation_627 (Activation)    (None, 7, 32)        0           ['add_313[0][0]']                
                                                                                                  
 conv1d_628 (Conv1D)            (None, 7, 64)        6208        ['activation_627[0][0]']         
                                                                                                  
 batch_normalization_628 (Batch  (None, 7, 64)       256         ['conv1d_628[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_628 (Activation)    (None, 7, 64)        0           ['batch_normalization_628[0][0]']
                                                                                                  
 spatial_dropout1d_314 (Spatial  (None, 7, 64)       0           ['activation_628[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_629 (Conv1D)            (None, 4, 64)        2112        ['activation_627[0][0]']         
                                                                                                  
 max_pooling1d_314 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_314[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_629 (Batch  (None, 4, 64)       256         ['conv1d_629[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_314 (Add)                  (None, 4, 64)        0           ['max_pooling1d_314[0][0]',      
                                                                  'batch_normalization_629[0][0]']
                                                                                                  
 activation_629 (Activation)    (None, 4, 64)        0           ['add_314[0][0]']                
                                                                                                  
 global_average_pooling1d_104 (  (None, 64)          0           ['activation_629[0][0]']         
 GlobalAveragePooling1D)                                                                          
                                                                                                  
 global_max_pooling1d_104 (Glob  (None, 64)          0           ['activation_629[0][0]']         
 alMaxPooling1D)                                                                                  
                                                                                                  
 concatenate_104 (Concatenate)  (None, 128)          0           ['global_average_pooling1d_104[0]
                                                                 [0]',                            
                                                                  'global_max_pooling1d_104[0][0]'
                                                                 ]                                
                                                                                                  
 dropout_208 (Dropout)          (None, 128)          0           ['concatenate_104[0][0]']        
                                                                                                  
 dense_104 (Dense)              (None, 64)           8256        ['dropout_208[0][0]']            
                                                                                                  
 dropout_209 (Dropout)          (None, 64)           0           ['dense_104[0][0]']              
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_209[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_209[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 25,699
Trainable params: 25,251
Non-trainable params: 448
__________________________________________________________________________________________________
