Model: "model_84"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_42 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_504 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_42[0][0]'] 
                                                                                                  
 batch_normalization_504 (Batch  (None, 25, 48)      192         ['conv1d_504[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_504 (Activation)    (None, 25, 48)       0           ['batch_normalization_504[0][0]']
                                                                                                  
 spatial_dropout1d_252 (Spatial  (None, 25, 48)      0           ['activation_504[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_505 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_42[0][0]'] 
                                                                                                  
 max_pooling1d_252 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_252[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_505 (Batch  (None, 13, 48)      192         ['conv1d_505[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_252 (Add)                  (None, 13, 48)       0           ['max_pooling1d_252[0][0]',      
                                                                  'batch_normalization_505[0][0]']
                                                                                                  
 activation_505 (Activation)    (None, 13, 48)       0           ['add_252[0][0]']                
                                                                                                  
 conv1d_506 (Conv1D)            (None, 13, 96)       13920       ['activation_505[0][0]']         
                                                                                                  
 batch_normalization_506 (Batch  (None, 13, 96)      384         ['conv1d_506[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_506 (Activation)    (None, 13, 96)       0           ['batch_normalization_506[0][0]']
                                                                                                  
 spatial_dropout1d_253 (Spatial  (None, 13, 96)      0           ['activation_506[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_507 (Conv1D)            (None, 7, 96)        4704        ['activation_505[0][0]']         
                                                                                                  
 max_pooling1d_253 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_253[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_507 (Batch  (None, 7, 96)       384         ['conv1d_507[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_253 (Add)                  (None, 7, 96)        0           ['max_pooling1d_253[0][0]',      
                                                                  'batch_normalization_507[0][0]']
                                                                                                  
 activation_507 (Activation)    (None, 7, 96)        0           ['add_253[0][0]']                
                                                                                                  
 conv1d_508 (Conv1D)            (None, 7, 192)       55488       ['activation_507[0][0]']         
                                                                                                  
 batch_normalization_508 (Batch  (None, 7, 192)      768         ['conv1d_508[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_508 (Activation)    (None, 7, 192)       0           ['batch_normalization_508[0][0]']
                                                                                                  
 spatial_dropout1d_254 (Spatial  (None, 7, 192)      0           ['activation_508[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_509 (Conv1D)            (None, 4, 192)       18624       ['activation_507[0][0]']         
                                                                                                  
 max_pooling1d_254 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_254[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_509 (Batch  (None, 4, 192)      768         ['conv1d_509[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_254 (Add)                  (None, 4, 192)       0           ['max_pooling1d_254[0][0]',      
                                                                  'batch_normalization_509[0][0]']
                                                                                                  
 activation_509 (Activation)    (None, 4, 192)       0           ['add_254[0][0]']                
                                                                                                  
 global_average_pooling1d_84 (G  (None, 192)         0           ['activation_509[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_84 (Globa  (None, 192)         0           ['activation_509[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_84 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_84[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_84[0][0]']
                                                                                                  
 dropout_168 (Dropout)          (None, 384)          0           ['concatenate_84[0][0]']         
                                                                                                  
 dense_84 (Dense)               (None, 128)          49280       ['dropout_168[0][0]']            
                                                                                                  
 dropout_169 (Dropout)          (None, 128)          0           ['dense_84[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_169[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_169[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 156,899
Trainable params: 155,555
Non-trainable params: 1,344
__________________________________________________________________________________________________
