Model: "model_13"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_7 (BasicPr  (None, 25, 41)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_78 (Conv1D)             (None, 25, 16)       1984        ['basic_preprocessing_7[0][0]']  
                                                                                                  
 batch_normalization_78 (BatchN  (None, 25, 16)      64          ['conv1d_78[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_78 (Activation)     (None, 25, 16)       0           ['batch_normalization_78[0][0]'] 
                                                                                                  
 spatial_dropout1d_39 (SpatialD  (None, 25, 16)      0           ['activation_78[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_79 (Conv1D)             (None, 13, 16)       672         ['basic_preprocessing_7[0][0]']  
                                                                                                  
 max_pooling1d_39 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_39[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_79 (BatchN  (None, 13, 16)      64          ['conv1d_79[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_39 (Add)                   (None, 13, 16)       0           ['max_pooling1d_39[0][0]',       
                                                                  'batch_normalization_79[0][0]'] 
                                                                                                  
 activation_79 (Activation)     (None, 13, 16)       0           ['add_39[0][0]']                 
                                                                                                  
 conv1d_80 (Conv1D)             (None, 13, 32)       1568        ['activation_79[0][0]']          
                                                                                                  
 batch_normalization_80 (BatchN  (None, 13, 32)      128         ['conv1d_80[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_80 (Activation)     (None, 13, 32)       0           ['batch_normalization_80[0][0]'] 
                                                                                                  
 spatial_dropout1d_40 (SpatialD  (None, 13, 32)      0           ['activation_80[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_81 (Conv1D)             (None, 7, 32)        544         ['activation_79[0][0]']          
                                                                                                  
 max_pooling1d_40 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_40[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_81 (BatchN  (None, 7, 32)       128         ['conv1d_81[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_40 (Add)                   (None, 7, 32)        0           ['max_pooling1d_40[0][0]',       
                                                                  'batch_normalization_81[0][0]'] 
                                                                                                  
 activation_81 (Activation)     (None, 7, 32)        0           ['add_40[0][0]']                 
                                                                                                  
 conv1d_82 (Conv1D)             (None, 7, 64)        6208        ['activation_81[0][0]']          
                                                                                                  
 batch_normalization_82 (BatchN  (None, 7, 64)       256         ['conv1d_82[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_82 (Activation)     (None, 7, 64)        0           ['batch_normalization_82[0][0]'] 
                                                                                                  
 spatial_dropout1d_41 (SpatialD  (None, 7, 64)       0           ['activation_82[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_83 (Conv1D)             (None, 4, 64)        2112        ['activation_81[0][0]']          
                                                                                                  
 max_pooling1d_41 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_41[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_83 (BatchN  (None, 4, 64)       256         ['conv1d_83[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_41 (Add)                   (None, 4, 64)        0           ['max_pooling1d_41[0][0]',       
                                                                  'batch_normalization_83[0][0]'] 
                                                                                                  
 activation_83 (Activation)     (None, 4, 64)        0           ['add_41[0][0]']                 
                                                                                                  
 global_average_pooling1d_13 (G  (None, 64)          0           ['activation_83[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_13 (Globa  (None, 64)          0           ['activation_83[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_13 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_13[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_13[0][0]']
                                                                                                  
 dropout_26 (Dropout)           (None, 128)          0           ['concatenate_13[0][0]']         
                                                                                                  
 dense_13 (Dense)               (None, 128)          16512       ['dropout_26[0][0]']             
                                                                                                  
 dropout_27 (Dropout)           (None, 128)          0           ['dense_13[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_27[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_27[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 30,883
Trainable params: 30,435
Non-trainable params: 448
__________________________________________________________________________________________________
