Model: "model_71"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_35 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_426 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_35[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_426 (Batch  (None, 25, 16)      64          ['conv1d_426[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_426 (Activation)    (None, 25, 16)       0           ['batch_normalization_426[0][0]']
                                                                                                  
 spatial_dropout1d_213 (Spatial  (None, 25, 16)      0           ['activation_426[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_427 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_35[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_213 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_213[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_427 (Batch  (None, 13, 16)      64          ['conv1d_427[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_213 (Add)                  (None, 13, 16)       0           ['max_pooling1d_213[0][0]',      
                                                                  'batch_normalization_427[0][0]']
                                                                                                  
 activation_427 (Activation)    (None, 13, 16)       0           ['add_213[0][0]']                
                                                                                                  
 conv1d_428 (Conv1D)            (None, 13, 32)       1568        ['activation_427[0][0]']         
                                                                                                  
 batch_normalization_428 (Batch  (None, 13, 32)      128         ['conv1d_428[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_428 (Activation)    (None, 13, 32)       0           ['batch_normalization_428[0][0]']
                                                                                                  
 spatial_dropout1d_214 (Spatial  (None, 13, 32)      0           ['activation_428[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_429 (Conv1D)            (None, 7, 32)        544         ['activation_427[0][0]']         
                                                                                                  
 max_pooling1d_214 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_214[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_429 (Batch  (None, 7, 32)       128         ['conv1d_429[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_214 (Add)                  (None, 7, 32)        0           ['max_pooling1d_214[0][0]',      
                                                                  'batch_normalization_429[0][0]']
                                                                                                  
 activation_429 (Activation)    (None, 7, 32)        0           ['add_214[0][0]']                
                                                                                                  
 conv1d_430 (Conv1D)            (None, 7, 64)        6208        ['activation_429[0][0]']         
                                                                                                  
 batch_normalization_430 (Batch  (None, 7, 64)       256         ['conv1d_430[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_430 (Activation)    (None, 7, 64)        0           ['batch_normalization_430[0][0]']
                                                                                                  
 spatial_dropout1d_215 (Spatial  (None, 7, 64)       0           ['activation_430[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_431 (Conv1D)            (None, 4, 64)        2112        ['activation_429[0][0]']         
                                                                                                  
 max_pooling1d_215 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_215[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_431 (Batch  (None, 4, 64)       256         ['conv1d_431[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_215 (Add)                  (None, 4, 64)        0           ['max_pooling1d_215[0][0]',      
                                                                  'batch_normalization_431[0][0]']
                                                                                                  
 activation_431 (Activation)    (None, 4, 64)        0           ['add_215[0][0]']                
                                                                                                  
 global_average_pooling1d_71 (G  (None, 64)          0           ['activation_431[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_71 (Globa  (None, 64)          0           ['activation_431[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_71 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_71[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_71[0][0]']
                                                                                                  
 dropout_142 (Dropout)          (None, 128)          0           ['concatenate_71[0][0]']         
                                                                                                  
 dense_71 (Dense)               (None, 128)          16512       ['dropout_142[0][0]']            
                                                                                                  
 dropout_143 (Dropout)          (None, 128)          0           ['dense_71[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_143[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_143[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 39,971
Trainable params: 39,523
Non-trainable params: 448
__________________________________________________________________________________________________
