Model: "model_27"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_12 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_162 (Conv1D)            (None, 25, 48)       39792       ['enhanced_preprocessing_12[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_162 (Batch  (None, 25, 48)      192         ['conv1d_162[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_162 (Activation)    (None, 25, 48)       0           ['batch_normalization_162[0][0]']
                                                                                                  
 spatial_dropout1d_81 (SpatialD  (None, 25, 48)      0           ['activation_162[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_163 (Conv1D)            (None, 13, 48)       13296       ['enhanced_preprocessing_12[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_81 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_81[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_163 (Batch  (None, 13, 48)      192         ['conv1d_163[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_81 (Add)                   (None, 13, 48)       0           ['max_pooling1d_81[0][0]',       
                                                                  'batch_normalization_163[0][0]']
                                                                                                  
 activation_163 (Activation)    (None, 13, 48)       0           ['add_81[0][0]']                 
                                                                                                  
 conv1d_164 (Conv1D)            (None, 13, 96)       13920       ['activation_163[0][0]']         
                                                                                                  
 batch_normalization_164 (Batch  (None, 13, 96)      384         ['conv1d_164[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_164 (Activation)    (None, 13, 96)       0           ['batch_normalization_164[0][0]']
                                                                                                  
 spatial_dropout1d_82 (SpatialD  (None, 13, 96)      0           ['activation_164[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_165 (Conv1D)            (None, 7, 96)        4704        ['activation_163[0][0]']         
                                                                                                  
 max_pooling1d_82 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_82[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_165 (Batch  (None, 7, 96)       384         ['conv1d_165[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_82 (Add)                   (None, 7, 96)        0           ['max_pooling1d_82[0][0]',       
                                                                  'batch_normalization_165[0][0]']
                                                                                                  
 activation_165 (Activation)    (None, 7, 96)        0           ['add_82[0][0]']                 
                                                                                                  
 conv1d_166 (Conv1D)            (None, 7, 192)       55488       ['activation_165[0][0]']         
                                                                                                  
 batch_normalization_166 (Batch  (None, 7, 192)      768         ['conv1d_166[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_166 (Activation)    (None, 7, 192)       0           ['batch_normalization_166[0][0]']
                                                                                                  
 spatial_dropout1d_83 (SpatialD  (None, 7, 192)      0           ['activation_166[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_167 (Conv1D)            (None, 4, 192)       18624       ['activation_165[0][0]']         
                                                                                                  
 max_pooling1d_83 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_83[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_167 (Batch  (None, 4, 192)      768         ['conv1d_167[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_83 (Add)                   (None, 4, 192)       0           ['max_pooling1d_83[0][0]',       
                                                                  'batch_normalization_167[0][0]']
                                                                                                  
 activation_167 (Activation)    (None, 4, 192)       0           ['add_83[0][0]']                 
                                                                                                  
 global_average_pooling1d_27 (G  (None, 192)         0           ['activation_167[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_27 (Globa  (None, 192)         0           ['activation_167[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_27 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_27[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_27[0][0]']
                                                                                                  
 dropout_54 (Dropout)           (None, 384)          0           ['concatenate_27[0][0]']         
                                                                                                  
 dense_27 (Dense)               (None, 128)          49280       ['dropout_54[0][0]']             
                                                                                                  
 dropout_55 (Dropout)           (None, 128)          0           ['dense_27[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_55[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_55[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 198,179
Trainable params: 196,835
Non-trainable params: 1,344
__________________________________________________________________________________________________
