Model: "model_39"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_18 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_234 (Conv1D)            (None, 25, 48)       17760       ['enhanced_preprocessing_18[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_234 (Batch  (None, 25, 48)      192         ['conv1d_234[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_234 (Activation)    (None, 25, 48)       0           ['batch_normalization_234[0][0]']
                                                                                                  
 spatial_dropout1d_117 (Spatial  (None, 25, 48)      0           ['activation_234[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_235 (Conv1D)            (None, 13, 48)       5952        ['enhanced_preprocessing_18[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_117 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_117[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_235 (Batch  (None, 13, 48)      192         ['conv1d_235[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_117 (Add)                  (None, 13, 48)       0           ['max_pooling1d_117[0][0]',      
                                                                  'batch_normalization_235[0][0]']
                                                                                                  
 activation_235 (Activation)    (None, 13, 48)       0           ['add_117[0][0]']                
                                                                                                  
 conv1d_236 (Conv1D)            (None, 13, 96)       13920       ['activation_235[0][0]']         
                                                                                                  
 batch_normalization_236 (Batch  (None, 13, 96)      384         ['conv1d_236[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_236 (Activation)    (None, 13, 96)       0           ['batch_normalization_236[0][0]']
                                                                                                  
 spatial_dropout1d_118 (Spatial  (None, 13, 96)      0           ['activation_236[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_237 (Conv1D)            (None, 7, 96)        4704        ['activation_235[0][0]']         
                                                                                                  
 max_pooling1d_118 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_118[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_237 (Batch  (None, 7, 96)       384         ['conv1d_237[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_118 (Add)                  (None, 7, 96)        0           ['max_pooling1d_118[0][0]',      
                                                                  'batch_normalization_237[0][0]']
                                                                                                  
 activation_237 (Activation)    (None, 7, 96)        0           ['add_118[0][0]']                
                                                                                                  
 conv1d_238 (Conv1D)            (None, 7, 192)       55488       ['activation_237[0][0]']         
                                                                                                  
 batch_normalization_238 (Batch  (None, 7, 192)      768         ['conv1d_238[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_238 (Activation)    (None, 7, 192)       0           ['batch_normalization_238[0][0]']
                                                                                                  
 spatial_dropout1d_119 (Spatial  (None, 7, 192)      0           ['activation_238[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_239 (Conv1D)            (None, 4, 192)       18624       ['activation_237[0][0]']         
                                                                                                  
 max_pooling1d_119 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_119[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_239 (Batch  (None, 4, 192)      768         ['conv1d_239[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_119 (Add)                  (None, 4, 192)       0           ['max_pooling1d_119[0][0]',      
                                                                  'batch_normalization_239[0][0]']
                                                                                                  
 activation_239 (Activation)    (None, 4, 192)       0           ['add_119[0][0]']                
                                                                                                  
 global_average_pooling1d_39 (G  (None, 192)         0           ['activation_239[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_39 (Globa  (None, 192)         0           ['activation_239[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_39 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_39[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_39[0][0]']
                                                                                                  
 dropout_78 (Dropout)           (None, 384)          0           ['concatenate_39[0][0]']         
                                                                                                  
 dense_39 (Dense)               (None, 128)          49280       ['dropout_78[0][0]']             
                                                                                                  
 dropout_79 (Dropout)           (None, 128)          0           ['dense_39[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_79[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_79[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 168,803
Trainable params: 167,459
Non-trainable params: 1,344
__________________________________________________________________________________________________
