Model: "model_22"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_10 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_132 (Conv1D)            (None, 25, 16)       5920        ['enhanced_preprocessing_10[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_132 (Batch  (None, 25, 16)      64          ['conv1d_132[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_132 (Activation)    (None, 25, 16)       0           ['batch_normalization_132[0][0]']
                                                                                                  
 spatial_dropout1d_66 (SpatialD  (None, 25, 16)      0           ['activation_132[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_133 (Conv1D)            (None, 13, 16)       1984        ['enhanced_preprocessing_10[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_66 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_66[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_133 (Batch  (None, 13, 16)      64          ['conv1d_133[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_66 (Add)                   (None, 13, 16)       0           ['max_pooling1d_66[0][0]',       
                                                                  'batch_normalization_133[0][0]']
                                                                                                  
 activation_133 (Activation)    (None, 13, 16)       0           ['add_66[0][0]']                 
                                                                                                  
 conv1d_134 (Conv1D)            (None, 13, 32)       1568        ['activation_133[0][0]']         
                                                                                                  
 batch_normalization_134 (Batch  (None, 13, 32)      128         ['conv1d_134[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_134 (Activation)    (None, 13, 32)       0           ['batch_normalization_134[0][0]']
                                                                                                  
 spatial_dropout1d_67 (SpatialD  (None, 13, 32)      0           ['activation_134[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_135 (Conv1D)            (None, 7, 32)        544         ['activation_133[0][0]']         
                                                                                                  
 max_pooling1d_67 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_67[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_135 (Batch  (None, 7, 32)       128         ['conv1d_135[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_67 (Add)                   (None, 7, 32)        0           ['max_pooling1d_67[0][0]',       
                                                                  'batch_normalization_135[0][0]']
                                                                                                  
 activation_135 (Activation)    (None, 7, 32)        0           ['add_67[0][0]']                 
                                                                                                  
 conv1d_136 (Conv1D)            (None, 7, 64)        6208        ['activation_135[0][0]']         
                                                                                                  
 batch_normalization_136 (Batch  (None, 7, 64)       256         ['conv1d_136[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_136 (Activation)    (None, 7, 64)        0           ['batch_normalization_136[0][0]']
                                                                                                  
 spatial_dropout1d_68 (SpatialD  (None, 7, 64)       0           ['activation_136[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_137 (Conv1D)            (None, 4, 64)        2112        ['activation_135[0][0]']         
                                                                                                  
 max_pooling1d_68 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_68[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_137 (Batch  (None, 4, 64)       256         ['conv1d_137[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_68 (Add)                   (None, 4, 64)        0           ['max_pooling1d_68[0][0]',       
                                                                  'batch_normalization_137[0][0]']
                                                                                                  
 activation_137 (Activation)    (None, 4, 64)        0           ['add_68[0][0]']                 
                                                                                                  
 global_average_pooling1d_22 (G  (None, 64)          0           ['activation_137[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_22 (Globa  (None, 64)          0           ['activation_137[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_22 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_22[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_22[0][0]']
                                                                                                  
 dropout_44 (Dropout)           (None, 128)          0           ['concatenate_22[0][0]']         
                                                                                                  
 dense_22 (Dense)               (None, 128)          16512       ['dropout_44[0][0]']             
                                                                                                  
 dropout_45 (Dropout)           (None, 128)          0           ['dense_22[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_45[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_45[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 36,131
Trainable params: 35,683
Non-trainable params: 448
__________________________________________________________________________________________________
