Model: "model_57"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_27 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_342 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_27[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_342 (Batch  (None, 25, 16)      64          ['conv1d_342[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_342 (Activation)    (None, 25, 16)       0           ['batch_normalization_342[0][0]']
                                                                                                  
 spatial_dropout1d_171 (Spatial  (None, 25, 16)      0           ['activation_342[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_343 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_27[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_171 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_171[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_343 (Batch  (None, 13, 16)      64          ['conv1d_343[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_171 (Add)                  (None, 13, 16)       0           ['max_pooling1d_171[0][0]',      
                                                                  'batch_normalization_343[0][0]']
                                                                                                  
 activation_343 (Activation)    (None, 13, 16)       0           ['add_171[0][0]']                
                                                                                                  
 conv1d_344 (Conv1D)            (None, 13, 32)       1568        ['activation_343[0][0]']         
                                                                                                  
 batch_normalization_344 (Batch  (None, 13, 32)      128         ['conv1d_344[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_344 (Activation)    (None, 13, 32)       0           ['batch_normalization_344[0][0]']
                                                                                                  
 spatial_dropout1d_172 (Spatial  (None, 13, 32)      0           ['activation_344[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_345 (Conv1D)            (None, 7, 32)        544         ['activation_343[0][0]']         
                                                                                                  
 max_pooling1d_172 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_172[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_345 (Batch  (None, 7, 32)       128         ['conv1d_345[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_172 (Add)                  (None, 7, 32)        0           ['max_pooling1d_172[0][0]',      
                                                                  'batch_normalization_345[0][0]']
                                                                                                  
 activation_345 (Activation)    (None, 7, 32)        0           ['add_172[0][0]']                
                                                                                                  
 conv1d_346 (Conv1D)            (None, 7, 64)        6208        ['activation_345[0][0]']         
                                                                                                  
 batch_normalization_346 (Batch  (None, 7, 64)       256         ['conv1d_346[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_346 (Activation)    (None, 7, 64)        0           ['batch_normalization_346[0][0]']
                                                                                                  
 spatial_dropout1d_173 (Spatial  (None, 7, 64)       0           ['activation_346[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_347 (Conv1D)            (None, 4, 64)        2112        ['activation_345[0][0]']         
                                                                                                  
 max_pooling1d_173 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_173[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_347 (Batch  (None, 4, 64)       256         ['conv1d_347[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_173 (Add)                  (None, 4, 64)        0           ['max_pooling1d_173[0][0]',      
                                                                  'batch_normalization_347[0][0]']
                                                                                                  
 activation_347 (Activation)    (None, 4, 64)        0           ['add_173[0][0]']                
                                                                                                  
 global_average_pooling1d_57 (G  (None, 64)          0           ['activation_347[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_57 (Globa  (None, 64)          0           ['activation_347[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_57 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_57[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_57[0][0]']
                                                                                                  
 dropout_114 (Dropout)          (None, 128)          0           ['concatenate_57[0][0]']         
                                                                                                  
 dense_57 (Dense)               (None, 64)           8256        ['dropout_114[0][0]']            
                                                                                                  
 dropout_115 (Dropout)          (None, 64)           0           ['dense_57[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_115[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_115[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 31,523
Trainable params: 31,075
Non-trainable params: 448
__________________________________________________________________________________________________
