Model: "model_85"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_43 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_510 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_43[0][0]'] 
                                                                                                  
 batch_normalization_510 (Batch  (None, 25, 48)      192         ['conv1d_510[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_510 (Activation)    (None, 25, 48)       0           ['batch_normalization_510[0][0]']
                                                                                                  
 spatial_dropout1d_255 (Spatial  (None, 25, 48)      0           ['activation_510[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_511 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_43[0][0]'] 
                                                                                                  
 max_pooling1d_255 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_255[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_511 (Batch  (None, 13, 48)      192         ['conv1d_511[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_255 (Add)                  (None, 13, 48)       0           ['max_pooling1d_255[0][0]',      
                                                                  'batch_normalization_511[0][0]']
                                                                                                  
 activation_511 (Activation)    (None, 13, 48)       0           ['add_255[0][0]']                
                                                                                                  
 conv1d_512 (Conv1D)            (None, 13, 96)       13920       ['activation_511[0][0]']         
                                                                                                  
 batch_normalization_512 (Batch  (None, 13, 96)      384         ['conv1d_512[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_512 (Activation)    (None, 13, 96)       0           ['batch_normalization_512[0][0]']
                                                                                                  
 spatial_dropout1d_256 (Spatial  (None, 13, 96)      0           ['activation_512[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_513 (Conv1D)            (None, 7, 96)        4704        ['activation_511[0][0]']         
                                                                                                  
 max_pooling1d_256 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_256[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_513 (Batch  (None, 7, 96)       384         ['conv1d_513[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_256 (Add)                  (None, 7, 96)        0           ['max_pooling1d_256[0][0]',      
                                                                  'batch_normalization_513[0][0]']
                                                                                                  
 activation_513 (Activation)    (None, 7, 96)        0           ['add_256[0][0]']                
                                                                                                  
 conv1d_514 (Conv1D)            (None, 7, 192)       55488       ['activation_513[0][0]']         
                                                                                                  
 batch_normalization_514 (Batch  (None, 7, 192)      768         ['conv1d_514[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_514 (Activation)    (None, 7, 192)       0           ['batch_normalization_514[0][0]']
                                                                                                  
 spatial_dropout1d_257 (Spatial  (None, 7, 192)      0           ['activation_514[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_515 (Conv1D)            (None, 4, 192)       18624       ['activation_513[0][0]']         
                                                                                                  
 max_pooling1d_257 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_257[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_515 (Batch  (None, 4, 192)      768         ['conv1d_515[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_257 (Add)                  (None, 4, 192)       0           ['max_pooling1d_257[0][0]',      
                                                                  'batch_normalization_515[0][0]']
                                                                                                  
 activation_515 (Activation)    (None, 4, 192)       0           ['add_257[0][0]']                
                                                                                                  
 global_average_pooling1d_85 (G  (None, 192)         0           ['activation_515[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_85 (Globa  (None, 192)         0           ['activation_515[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_85 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_85[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_85[0][0]']
                                                                                                  
 dropout_170 (Dropout)          (None, 384)          0           ['concatenate_85[0][0]']         
                                                                                                  
 dense_85 (Dense)               (None, 128)          49280       ['dropout_170[0][0]']            
                                                                                                  
 dropout_171 (Dropout)          (None, 128)          0           ['dense_85[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_171[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_171[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 156,899
Trainable params: 155,555
Non-trainable params: 1,344
__________________________________________________________________________________________________
