Model: "model_89"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_44 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_534 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_44[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_534 (Batch  (None, 25, 48)      192         ['conv1d_534[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_534 (Activation)    (None, 25, 48)       0           ['batch_normalization_534[0][0]']
                                                                                                  
 spatial_dropout1d_267 (Spatial  (None, 25, 48)      0           ['activation_534[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_535 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_44[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_267 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_267[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_535 (Batch  (None, 13, 48)      192         ['conv1d_535[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_267 (Add)                  (None, 13, 48)       0           ['max_pooling1d_267[0][0]',      
                                                                  'batch_normalization_535[0][0]']
                                                                                                  
 activation_535 (Activation)    (None, 13, 48)       0           ['add_267[0][0]']                
                                                                                                  
 conv1d_536 (Conv1D)            (None, 13, 96)       13920       ['activation_535[0][0]']         
                                                                                                  
 batch_normalization_536 (Batch  (None, 13, 96)      384         ['conv1d_536[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_536 (Activation)    (None, 13, 96)       0           ['batch_normalization_536[0][0]']
                                                                                                  
 spatial_dropout1d_268 (Spatial  (None, 13, 96)      0           ['activation_536[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_537 (Conv1D)            (None, 7, 96)        4704        ['activation_535[0][0]']         
                                                                                                  
 max_pooling1d_268 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_268[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_537 (Batch  (None, 7, 96)       384         ['conv1d_537[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_268 (Add)                  (None, 7, 96)        0           ['max_pooling1d_268[0][0]',      
                                                                  'batch_normalization_537[0][0]']
                                                                                                  
 activation_537 (Activation)    (None, 7, 96)        0           ['add_268[0][0]']                
                                                                                                  
 conv1d_538 (Conv1D)            (None, 7, 192)       55488       ['activation_537[0][0]']         
                                                                                                  
 batch_normalization_538 (Batch  (None, 7, 192)      768         ['conv1d_538[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_538 (Activation)    (None, 7, 192)       0           ['batch_normalization_538[0][0]']
                                                                                                  
 spatial_dropout1d_269 (Spatial  (None, 7, 192)      0           ['activation_538[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_539 (Conv1D)            (None, 4, 192)       18624       ['activation_537[0][0]']         
                                                                                                  
 max_pooling1d_269 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_269[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_539 (Batch  (None, 4, 192)      768         ['conv1d_539[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_269 (Add)                  (None, 4, 192)       0           ['max_pooling1d_269[0][0]',      
                                                                  'batch_normalization_539[0][0]']
                                                                                                  
 activation_539 (Activation)    (None, 4, 192)       0           ['add_269[0][0]']                
                                                                                                  
 global_average_pooling1d_89 (G  (None, 192)         0           ['activation_539[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_89 (Globa  (None, 192)         0           ['activation_539[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_89 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_89[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_89[0][0]']
                                                                                                  
 dropout_178 (Dropout)          (None, 384)          0           ['concatenate_89[0][0]']         
                                                                                                  
 dense_89 (Dense)               (None, 128)          49280       ['dropout_178[0][0]']            
                                                                                                  
 dropout_179 (Dropout)          (None, 128)          0           ['dense_89[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_179[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_179[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 180,323
Trainable params: 178,979
Non-trainable params: 1,344
__________________________________________________________________________________________________
