Model: "model_82"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_40 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_492 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_40[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_492 (Batch  (None, 25, 48)      192         ['conv1d_492[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_492 (Activation)    (None, 25, 48)       0           ['batch_normalization_492[0][0]']
                                                                                                  
 spatial_dropout1d_246 (Spatial  (None, 25, 48)      0           ['activation_492[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_493 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_40[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_246 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_246[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_493 (Batch  (None, 13, 48)      192         ['conv1d_493[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_246 (Add)                  (None, 13, 48)       0           ['max_pooling1d_246[0][0]',      
                                                                  'batch_normalization_493[0][0]']
                                                                                                  
 activation_493 (Activation)    (None, 13, 48)       0           ['add_246[0][0]']                
                                                                                                  
 conv1d_494 (Conv1D)            (None, 13, 96)       13920       ['activation_493[0][0]']         
                                                                                                  
 batch_normalization_494 (Batch  (None, 13, 96)      384         ['conv1d_494[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_494 (Activation)    (None, 13, 96)       0           ['batch_normalization_494[0][0]']
                                                                                                  
 spatial_dropout1d_247 (Spatial  (None, 13, 96)      0           ['activation_494[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_495 (Conv1D)            (None, 7, 96)        4704        ['activation_493[0][0]']         
                                                                                                  
 max_pooling1d_247 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_247[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_495 (Batch  (None, 7, 96)       384         ['conv1d_495[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_247 (Add)                  (None, 7, 96)        0           ['max_pooling1d_247[0][0]',      
                                                                  'batch_normalization_495[0][0]']
                                                                                                  
 activation_495 (Activation)    (None, 7, 96)        0           ['add_247[0][0]']                
                                                                                                  
 conv1d_496 (Conv1D)            (None, 7, 192)       55488       ['activation_495[0][0]']         
                                                                                                  
 batch_normalization_496 (Batch  (None, 7, 192)      768         ['conv1d_496[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_496 (Activation)    (None, 7, 192)       0           ['batch_normalization_496[0][0]']
                                                                                                  
 spatial_dropout1d_248 (Spatial  (None, 7, 192)      0           ['activation_496[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_497 (Conv1D)            (None, 4, 192)       18624       ['activation_495[0][0]']         
                                                                                                  
 max_pooling1d_248 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_248[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_497 (Batch  (None, 4, 192)      768         ['conv1d_497[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_248 (Add)                  (None, 4, 192)       0           ['max_pooling1d_248[0][0]',      
                                                                  'batch_normalization_497[0][0]']
                                                                                                  
 activation_497 (Activation)    (None, 4, 192)       0           ['add_248[0][0]']                
                                                                                                  
 global_average_pooling1d_82 (G  (None, 192)         0           ['activation_497[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_82 (Globa  (None, 192)         0           ['activation_497[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_82 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_82[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_82[0][0]']
                                                                                                  
 dropout_164 (Dropout)          (None, 384)          0           ['concatenate_82[0][0]']         
                                                                                                  
 dense_82 (Dense)               (None, 64)           24640       ['dropout_164[0][0]']            
                                                                                                  
 dropout_165 (Dropout)          (None, 64)           0           ['dense_82[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_165[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_165[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 155,491
Trainable params: 154,147
Non-trainable params: 1,344
__________________________________________________________________________________________________
