Model: "model_87"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_42 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_522 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_42[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_522 (Batch  (None, 25, 48)      192         ['conv1d_522[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_522 (Activation)    (None, 25, 48)       0           ['batch_normalization_522[0][0]']
                                                                                                  
 spatial_dropout1d_261 (Spatial  (None, 25, 48)      0           ['activation_522[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_523 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_42[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_261 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_261[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_523 (Batch  (None, 13, 48)      192         ['conv1d_523[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_261 (Add)                  (None, 13, 48)       0           ['max_pooling1d_261[0][0]',      
                                                                  'batch_normalization_523[0][0]']
                                                                                                  
 activation_523 (Activation)    (None, 13, 48)       0           ['add_261[0][0]']                
                                                                                                  
 conv1d_524 (Conv1D)            (None, 13, 96)       13920       ['activation_523[0][0]']         
                                                                                                  
 batch_normalization_524 (Batch  (None, 13, 96)      384         ['conv1d_524[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_524 (Activation)    (None, 13, 96)       0           ['batch_normalization_524[0][0]']
                                                                                                  
 spatial_dropout1d_262 (Spatial  (None, 13, 96)      0           ['activation_524[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_525 (Conv1D)            (None, 7, 96)        4704        ['activation_523[0][0]']         
                                                                                                  
 max_pooling1d_262 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_262[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_525 (Batch  (None, 7, 96)       384         ['conv1d_525[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_262 (Add)                  (None, 7, 96)        0           ['max_pooling1d_262[0][0]',      
                                                                  'batch_normalization_525[0][0]']
                                                                                                  
 activation_525 (Activation)    (None, 7, 96)        0           ['add_262[0][0]']                
                                                                                                  
 conv1d_526 (Conv1D)            (None, 7, 192)       55488       ['activation_525[0][0]']         
                                                                                                  
 batch_normalization_526 (Batch  (None, 7, 192)      768         ['conv1d_526[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_526 (Activation)    (None, 7, 192)       0           ['batch_normalization_526[0][0]']
                                                                                                  
 spatial_dropout1d_263 (Spatial  (None, 7, 192)      0           ['activation_526[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_527 (Conv1D)            (None, 4, 192)       18624       ['activation_525[0][0]']         
                                                                                                  
 max_pooling1d_263 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_263[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_527 (Batch  (None, 4, 192)      768         ['conv1d_527[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_263 (Add)                  (None, 4, 192)       0           ['max_pooling1d_263[0][0]',      
                                                                  'batch_normalization_527[0][0]']
                                                                                                  
 activation_527 (Activation)    (None, 4, 192)       0           ['add_263[0][0]']                
                                                                                                  
 global_average_pooling1d_87 (G  (None, 192)         0           ['activation_527[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_87 (Globa  (None, 192)         0           ['activation_527[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_87 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_87[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_87[0][0]']
                                                                                                  
 dropout_174 (Dropout)          (None, 384)          0           ['concatenate_87[0][0]']         
                                                                                                  
 dense_87 (Dense)               (None, 128)          49280       ['dropout_174[0][0]']            
                                                                                                  
 dropout_175 (Dropout)          (None, 128)          0           ['dense_87[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_175[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_175[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 180,323
Trainable params: 178,979
Non-trainable params: 1,344
__________________________________________________________________________________________________
