Model: "model_21"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_9 (Enha  (None, 25, 123)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_126 (Conv1D)            (None, 25, 16)       5920        ['enhanced_preprocessing_9[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_126 (Batch  (None, 25, 16)      64          ['conv1d_126[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_126 (Activation)    (None, 25, 16)       0           ['batch_normalization_126[0][0]']
                                                                                                  
 spatial_dropout1d_63 (SpatialD  (None, 25, 16)      0           ['activation_126[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_127 (Conv1D)            (None, 13, 16)       1984        ['enhanced_preprocessing_9[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_63 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_63[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_127 (Batch  (None, 13, 16)      64          ['conv1d_127[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_63 (Add)                   (None, 13, 16)       0           ['max_pooling1d_63[0][0]',       
                                                                  'batch_normalization_127[0][0]']
                                                                                                  
 activation_127 (Activation)    (None, 13, 16)       0           ['add_63[0][0]']                 
                                                                                                  
 conv1d_128 (Conv1D)            (None, 13, 32)       1568        ['activation_127[0][0]']         
                                                                                                  
 batch_normalization_128 (Batch  (None, 13, 32)      128         ['conv1d_128[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_128 (Activation)    (None, 13, 32)       0           ['batch_normalization_128[0][0]']
                                                                                                  
 spatial_dropout1d_64 (SpatialD  (None, 13, 32)      0           ['activation_128[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_129 (Conv1D)            (None, 7, 32)        544         ['activation_127[0][0]']         
                                                                                                  
 max_pooling1d_64 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_64[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_129 (Batch  (None, 7, 32)       128         ['conv1d_129[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_64 (Add)                   (None, 7, 32)        0           ['max_pooling1d_64[0][0]',       
                                                                  'batch_normalization_129[0][0]']
                                                                                                  
 activation_129 (Activation)    (None, 7, 32)        0           ['add_64[0][0]']                 
                                                                                                  
 conv1d_130 (Conv1D)            (None, 7, 64)        6208        ['activation_129[0][0]']         
                                                                                                  
 batch_normalization_130 (Batch  (None, 7, 64)       256         ['conv1d_130[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_130 (Activation)    (None, 7, 64)        0           ['batch_normalization_130[0][0]']
                                                                                                  
 spatial_dropout1d_65 (SpatialD  (None, 7, 64)       0           ['activation_130[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_131 (Conv1D)            (None, 4, 64)        2112        ['activation_129[0][0]']         
                                                                                                  
 max_pooling1d_65 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_65[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_131 (Batch  (None, 4, 64)       256         ['conv1d_131[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_65 (Add)                   (None, 4, 64)        0           ['max_pooling1d_65[0][0]',       
                                                                  'batch_normalization_131[0][0]']
                                                                                                  
 activation_131 (Activation)    (None, 4, 64)        0           ['add_65[0][0]']                 
                                                                                                  
 global_average_pooling1d_21 (G  (None, 64)          0           ['activation_131[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_21 (Globa  (None, 64)          0           ['activation_131[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_21 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_21[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_21[0][0]']
                                                                                                  
 dropout_42 (Dropout)           (None, 128)          0           ['concatenate_21[0][0]']         
                                                                                                  
 dense_21 (Dense)               (None, 128)          16512       ['dropout_42[0][0]']             
                                                                                                  
 dropout_43 (Dropout)           (None, 128)          0           ['dense_21[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_43[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_43[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 36,131
Trainable params: 35,683
Non-trainable params: 448
__________________________________________________________________________________________________
