Model: "model_81"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_39 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_486 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_39[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_486 (Batch  (None, 25, 48)      192         ['conv1d_486[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_486 (Activation)    (None, 25, 48)       0           ['batch_normalization_486[0][0]']
                                                                                                  
 spatial_dropout1d_243 (Spatial  (None, 25, 48)      0           ['activation_486[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_487 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_39[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_243 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_243[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_487 (Batch  (None, 13, 48)      192         ['conv1d_487[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_243 (Add)                  (None, 13, 48)       0           ['max_pooling1d_243[0][0]',      
                                                                  'batch_normalization_487[0][0]']
                                                                                                  
 activation_487 (Activation)    (None, 13, 48)       0           ['add_243[0][0]']                
                                                                                                  
 conv1d_488 (Conv1D)            (None, 13, 96)       13920       ['activation_487[0][0]']         
                                                                                                  
 batch_normalization_488 (Batch  (None, 13, 96)      384         ['conv1d_488[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_488 (Activation)    (None, 13, 96)       0           ['batch_normalization_488[0][0]']
                                                                                                  
 spatial_dropout1d_244 (Spatial  (None, 13, 96)      0           ['activation_488[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_489 (Conv1D)            (None, 7, 96)        4704        ['activation_487[0][0]']         
                                                                                                  
 max_pooling1d_244 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_244[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_489 (Batch  (None, 7, 96)       384         ['conv1d_489[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_244 (Add)                  (None, 7, 96)        0           ['max_pooling1d_244[0][0]',      
                                                                  'batch_normalization_489[0][0]']
                                                                                                  
 activation_489 (Activation)    (None, 7, 96)        0           ['add_244[0][0]']                
                                                                                                  
 conv1d_490 (Conv1D)            (None, 7, 192)       55488       ['activation_489[0][0]']         
                                                                                                  
 batch_normalization_490 (Batch  (None, 7, 192)      768         ['conv1d_490[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_490 (Activation)    (None, 7, 192)       0           ['batch_normalization_490[0][0]']
                                                                                                  
 spatial_dropout1d_245 (Spatial  (None, 7, 192)      0           ['activation_490[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_491 (Conv1D)            (None, 4, 192)       18624       ['activation_489[0][0]']         
                                                                                                  
 max_pooling1d_245 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_245[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_491 (Batch  (None, 4, 192)      768         ['conv1d_491[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_245 (Add)                  (None, 4, 192)       0           ['max_pooling1d_245[0][0]',      
                                                                  'batch_normalization_491[0][0]']
                                                                                                  
 activation_491 (Activation)    (None, 4, 192)       0           ['add_245[0][0]']                
                                                                                                  
 global_average_pooling1d_81 (G  (None, 192)         0           ['activation_491[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_81 (Globa  (None, 192)         0           ['activation_491[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_81 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_81[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_81[0][0]']
                                                                                                  
 dropout_162 (Dropout)          (None, 384)          0           ['concatenate_81[0][0]']         
                                                                                                  
 dense_81 (Dense)               (None, 64)           24640       ['dropout_162[0][0]']            
                                                                                                  
 dropout_163 (Dropout)          (None, 64)           0           ['dense_81[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_163[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_163[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 155,491
Trainable params: 154,147
Non-trainable params: 1,344
__________________________________________________________________________________________________
