Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_1 (BasicPr  (None, 25, 41)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_6 (Conv1D)              (None, 25, 16)       1984        ['basic_preprocessing_1[0][0]']  
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 25, 16)      64          ['conv1d_6[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_6 (Activation)      (None, 25, 16)       0           ['batch_normalization_6[0][0]']  
                                                                                                  
 spatial_dropout1d_3 (SpatialDr  (None, 25, 16)      0           ['activation_6[0][0]']           
 opout1D)                                                                                         
                                                                                                  
 conv1d_7 (Conv1D)              (None, 13, 16)       672         ['basic_preprocessing_1[0][0]']  
                                                                                                  
 max_pooling1d_3 (MaxPooling1D)  (None, 13, 16)      0           ['spatial_dropout1d_3[0][0]']    
                                                                                                  
 batch_normalization_7 (BatchNo  (None, 13, 16)      64          ['conv1d_7[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add_3 (Add)                    (None, 13, 16)       0           ['max_pooling1d_3[0][0]',        
                                                                  'batch_normalization_7[0][0]']  
                                                                                                  
 activation_7 (Activation)      (None, 13, 16)       0           ['add_3[0][0]']                  
                                                                                                  
 conv1d_8 (Conv1D)              (None, 13, 32)       1568        ['activation_7[0][0]']           
                                                                                                  
 batch_normalization_8 (BatchNo  (None, 13, 32)      128         ['conv1d_8[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 activation_8 (Activation)      (None, 13, 32)       0           ['batch_normalization_8[0][0]']  
                                                                                                  
 spatial_dropout1d_4 (SpatialDr  (None, 13, 32)      0           ['activation_8[0][0]']           
 opout1D)                                                                                         
                                                                                                  
 conv1d_9 (Conv1D)              (None, 7, 32)        544         ['activation_7[0][0]']           
                                                                                                  
 max_pooling1d_4 (MaxPooling1D)  (None, 7, 32)       0           ['spatial_dropout1d_4[0][0]']    
                                                                                                  
 batch_normalization_9 (BatchNo  (None, 7, 32)       128         ['conv1d_9[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 add_4 (Add)                    (None, 7, 32)        0           ['max_pooling1d_4[0][0]',        
                                                                  'batch_normalization_9[0][0]']  
                                                                                                  
 activation_9 (Activation)      (None, 7, 32)        0           ['add_4[0][0]']                  
                                                                                                  
 conv1d_10 (Conv1D)             (None, 7, 64)        6208        ['activation_9[0][0]']           
                                                                                                  
 batch_normalization_10 (BatchN  (None, 7, 64)       256         ['conv1d_10[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_10 (Activation)     (None, 7, 64)        0           ['batch_normalization_10[0][0]'] 
                                                                                                  
 spatial_dropout1d_5 (SpatialDr  (None, 7, 64)       0           ['activation_10[0][0]']          
 opout1D)                                                                                         
                                                                                                  
 conv1d_11 (Conv1D)             (None, 4, 64)        2112        ['activation_9[0][0]']           
                                                                                                  
 max_pooling1d_5 (MaxPooling1D)  (None, 4, 64)       0           ['spatial_dropout1d_5[0][0]']    
                                                                                                  
 batch_normalization_11 (BatchN  (None, 4, 64)       256         ['conv1d_11[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_5 (Add)                    (None, 4, 64)        0           ['max_pooling1d_5[0][0]',        
                                                                  'batch_normalization_11[0][0]'] 
                                                                                                  
 activation_11 (Activation)     (None, 4, 64)        0           ['add_5[0][0]']                  
                                                                                                  
 global_average_pooling1d_1 (Gl  (None, 64)          0           ['activation_11[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_1 (Global  (None, 64)          0           ['activation_11[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_1 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_1[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_1[0][0]'] 
                                                                                                  
 dropout_2 (Dropout)            (None, 128)          0           ['concatenate_1[0][0]']          
                                                                                                  
 dense_1 (Dense)                (None, 64)           8256        ['dropout_2[0][0]']              
                                                                                                  
 dropout_3 (Dropout)            (None, 64)           0           ['dense_1[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_3[0][0]']              
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_3[0][0]']              
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 22,435
Trainable params: 21,987
Non-trainable params: 448
__________________________________________________________________________________________________
