Model: "model_56"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_29 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_336 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_29[0][0]'] 
                                                                                                  
 batch_normalization_336 (Batch  (None, 25, 16)      64          ['conv1d_336[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_336 (Activation)    (None, 25, 16)       0           ['batch_normalization_336[0][0]']
                                                                                                  
 spatial_dropout1d_168 (Spatial  (None, 25, 16)      0           ['activation_336[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_337 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_29[0][0]'] 
                                                                                                  
 max_pooling1d_168 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_168[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_337 (Batch  (None, 13, 16)      64          ['conv1d_337[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_168 (Add)                  (None, 13, 16)       0           ['max_pooling1d_168[0][0]',      
                                                                  'batch_normalization_337[0][0]']
                                                                                                  
 activation_337 (Activation)    (None, 13, 16)       0           ['add_168[0][0]']                
                                                                                                  
 conv1d_338 (Conv1D)            (None, 13, 32)       1568        ['activation_337[0][0]']         
                                                                                                  
 batch_normalization_338 (Batch  (None, 13, 32)      128         ['conv1d_338[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_338 (Activation)    (None, 13, 32)       0           ['batch_normalization_338[0][0]']
                                                                                                  
 spatial_dropout1d_169 (Spatial  (None, 13, 32)      0           ['activation_338[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_339 (Conv1D)            (None, 7, 32)        544         ['activation_337[0][0]']         
                                                                                                  
 max_pooling1d_169 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_169[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_339 (Batch  (None, 7, 32)       128         ['conv1d_339[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_169 (Add)                  (None, 7, 32)        0           ['max_pooling1d_169[0][0]',      
                                                                  'batch_normalization_339[0][0]']
                                                                                                  
 activation_339 (Activation)    (None, 7, 32)        0           ['add_169[0][0]']                
                                                                                                  
 conv1d_340 (Conv1D)            (None, 7, 64)        6208        ['activation_339[0][0]']         
                                                                                                  
 batch_normalization_340 (Batch  (None, 7, 64)       256         ['conv1d_340[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_340 (Activation)    (None, 7, 64)        0           ['batch_normalization_340[0][0]']
                                                                                                  
 spatial_dropout1d_170 (Spatial  (None, 7, 64)       0           ['activation_340[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_341 (Conv1D)            (None, 4, 64)        2112        ['activation_339[0][0]']         
                                                                                                  
 max_pooling1d_170 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_170[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_341 (Batch  (None, 4, 64)       256         ['conv1d_341[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_170 (Add)                  (None, 4, 64)        0           ['max_pooling1d_170[0][0]',      
                                                                  'batch_normalization_341[0][0]']
                                                                                                  
 activation_341 (Activation)    (None, 4, 64)        0           ['add_170[0][0]']                
                                                                                                  
 global_average_pooling1d_56 (G  (None, 64)          0           ['activation_341[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_56 (Globa  (None, 64)          0           ['activation_341[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_56 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_56[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_56[0][0]']
                                                                                                  
 dropout_112 (Dropout)          (None, 128)          0           ['concatenate_56[0][0]']         
                                                                                                  
 dense_56 (Dense)               (None, 64)           8256        ['dropout_112[0][0]']            
                                                                                                  
 dropout_113 (Dropout)          (None, 64)           0           ['dense_56[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_113[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_113[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 23,715
Trainable params: 23,267
Non-trainable params: 448
__________________________________________________________________________________________________
