Model: "model_3"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing (Enhanc  (None, 25, 276)     0           ['input[0][0]']                  
 edPreprocessing)                                                                                 
                                                                                                  
 conv1d_18 (Conv1D)             (None, 25, 16)       13264       ['enhanced_preprocessing[0][0]'] 
                                                                                                  
 batch_normalization_18 (BatchN  (None, 25, 16)      64          ['conv1d_18[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_18 (Activation)     (None, 25, 16)       0           ['batch_normalization_18[0][0]'] 
                                                                                                  
 spatial_dropout1d_9 (SpatialDr  (None, 25, 16)      0           ['activation_18[0][0]']          
 opout1D)                                                                                         
                                                                                                  
 conv1d_19 (Conv1D)             (None, 13, 16)       4432        ['enhanced_preprocessing[0][0]'] 
                                                                                                  
 max_pooling1d_9 (MaxPooling1D)  (None, 13, 16)      0           ['spatial_dropout1d_9[0][0]']    
                                                                                                  
 batch_normalization_19 (BatchN  (None, 13, 16)      64          ['conv1d_19[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_9 (Add)                    (None, 13, 16)       0           ['max_pooling1d_9[0][0]',        
                                                                  'batch_normalization_19[0][0]'] 
                                                                                                  
 activation_19 (Activation)     (None, 13, 16)       0           ['add_9[0][0]']                  
                                                                                                  
 conv1d_20 (Conv1D)             (None, 13, 32)       1568        ['activation_19[0][0]']          
                                                                                                  
 batch_normalization_20 (BatchN  (None, 13, 32)      128         ['conv1d_20[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_20 (Activation)     (None, 13, 32)       0           ['batch_normalization_20[0][0]'] 
                                                                                                  
 spatial_dropout1d_10 (SpatialD  (None, 13, 32)      0           ['activation_20[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_21 (Conv1D)             (None, 7, 32)        544         ['activation_19[0][0]']          
                                                                                                  
 max_pooling1d_10 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_10[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_21 (BatchN  (None, 7, 32)       128         ['conv1d_21[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_10 (Add)                   (None, 7, 32)        0           ['max_pooling1d_10[0][0]',       
                                                                  'batch_normalization_21[0][0]'] 
                                                                                                  
 activation_21 (Activation)     (None, 7, 32)        0           ['add_10[0][0]']                 
                                                                                                  
 conv1d_22 (Conv1D)             (None, 7, 64)        6208        ['activation_21[0][0]']          
                                                                                                  
 batch_normalization_22 (BatchN  (None, 7, 64)       256         ['conv1d_22[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_22 (Activation)     (None, 7, 64)        0           ['batch_normalization_22[0][0]'] 
                                                                                                  
 spatial_dropout1d_11 (SpatialD  (None, 7, 64)       0           ['activation_22[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_23 (Conv1D)             (None, 4, 64)        2112        ['activation_21[0][0]']          
                                                                                                  
 max_pooling1d_11 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_11[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_23 (BatchN  (None, 4, 64)       256         ['conv1d_23[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_11 (Add)                   (None, 4, 64)        0           ['max_pooling1d_11[0][0]',       
                                                                  'batch_normalization_23[0][0]'] 
                                                                                                  
 activation_23 (Activation)     (None, 4, 64)        0           ['add_11[0][0]']                 
                                                                                                  
 global_average_pooling1d_3 (Gl  (None, 64)          0           ['activation_23[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_3 (Global  (None, 64)          0           ['activation_23[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_3 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_3[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_3[0][0]'] 
                                                                                                  
 dropout_6 (Dropout)            (None, 128)          0           ['concatenate_3[0][0]']          
                                                                                                  
 dense_3 (Dense)                (None, 128)          16512       ['dropout_6[0][0]']              
                                                                                                  
 dropout_7 (Dropout)            (None, 128)          0           ['dense_3[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_7[0][0]']              
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_7[0][0]']              
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 45,923
Trainable params: 45,475
Non-trainable params: 448
__________________________________________________________________________________________________
