Model: "model_18"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_9 (BasicPr  (None, 25, 92)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_108 (Conv1D)            (None, 25, 48)       13296       ['basic_preprocessing_9[0][0]']  
                                                                                                  
 batch_normalization_108 (Batch  (None, 25, 48)      192         ['conv1d_108[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_108 (Activation)    (None, 25, 48)       0           ['batch_normalization_108[0][0]']
                                                                                                  
 spatial_dropout1d_54 (SpatialD  (None, 25, 48)      0           ['activation_108[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_109 (Conv1D)            (None, 13, 48)       4464        ['basic_preprocessing_9[0][0]']  
                                                                                                  
 max_pooling1d_54 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_54[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_109 (Batch  (None, 13, 48)      192         ['conv1d_109[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_54 (Add)                   (None, 13, 48)       0           ['max_pooling1d_54[0][0]',       
                                                                  'batch_normalization_109[0][0]']
                                                                                                  
 activation_109 (Activation)    (None, 13, 48)       0           ['add_54[0][0]']                 
                                                                                                  
 conv1d_110 (Conv1D)            (None, 13, 96)       13920       ['activation_109[0][0]']         
                                                                                                  
 batch_normalization_110 (Batch  (None, 13, 96)      384         ['conv1d_110[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_110 (Activation)    (None, 13, 96)       0           ['batch_normalization_110[0][0]']
                                                                                                  
 spatial_dropout1d_55 (SpatialD  (None, 13, 96)      0           ['activation_110[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_111 (Conv1D)            (None, 7, 96)        4704        ['activation_109[0][0]']         
                                                                                                  
 max_pooling1d_55 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_55[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_111 (Batch  (None, 7, 96)       384         ['conv1d_111[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_55 (Add)                   (None, 7, 96)        0           ['max_pooling1d_55[0][0]',       
                                                                  'batch_normalization_111[0][0]']
                                                                                                  
 activation_111 (Activation)    (None, 7, 96)        0           ['add_55[0][0]']                 
                                                                                                  
 conv1d_112 (Conv1D)            (None, 7, 192)       55488       ['activation_111[0][0]']         
                                                                                                  
 batch_normalization_112 (Batch  (None, 7, 192)      768         ['conv1d_112[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_112 (Activation)    (None, 7, 192)       0           ['batch_normalization_112[0][0]']
                                                                                                  
 spatial_dropout1d_56 (SpatialD  (None, 7, 192)      0           ['activation_112[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_113 (Conv1D)            (None, 4, 192)       18624       ['activation_111[0][0]']         
                                                                                                  
 max_pooling1d_56 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_56[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_113 (Batch  (None, 4, 192)      768         ['conv1d_113[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_56 (Add)                   (None, 4, 192)       0           ['max_pooling1d_56[0][0]',       
                                                                  'batch_normalization_113[0][0]']
                                                                                                  
 activation_113 (Activation)    (None, 4, 192)       0           ['add_56[0][0]']                 
                                                                                                  
 global_average_pooling1d_18 (G  (None, 192)         0           ['activation_113[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_18 (Globa  (None, 192)         0           ['activation_113[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_18 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_18[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_18[0][0]']
                                                                                                  
 dropout_36 (Dropout)           (None, 384)          0           ['concatenate_18[0][0]']         
                                                                                                  
 dense_18 (Dense)               (None, 64)           24640       ['dropout_36[0][0]']             
                                                                                                  
 dropout_37 (Dropout)           (None, 64)           0           ['dense_18[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_37[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_37[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 138,019
Trainable params: 136,675
Non-trainable params: 1,344
__________________________________________________________________________________________________
