Model: "model_86"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_44 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_516 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_44[0][0]'] 
                                                                                                  
 batch_normalization_516 (Batch  (None, 25, 48)      192         ['conv1d_516[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_516 (Activation)    (None, 25, 48)       0           ['batch_normalization_516[0][0]']
                                                                                                  
 spatial_dropout1d_258 (Spatial  (None, 25, 48)      0           ['activation_516[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_517 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_44[0][0]'] 
                                                                                                  
 max_pooling1d_258 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_258[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_517 (Batch  (None, 13, 48)      192         ['conv1d_517[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_258 (Add)                  (None, 13, 48)       0           ['max_pooling1d_258[0][0]',      
                                                                  'batch_normalization_517[0][0]']
                                                                                                  
 activation_517 (Activation)    (None, 13, 48)       0           ['add_258[0][0]']                
                                                                                                  
 conv1d_518 (Conv1D)            (None, 13, 96)       13920       ['activation_517[0][0]']         
                                                                                                  
 batch_normalization_518 (Batch  (None, 13, 96)      384         ['conv1d_518[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_518 (Activation)    (None, 13, 96)       0           ['batch_normalization_518[0][0]']
                                                                                                  
 spatial_dropout1d_259 (Spatial  (None, 13, 96)      0           ['activation_518[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_519 (Conv1D)            (None, 7, 96)        4704        ['activation_517[0][0]']         
                                                                                                  
 max_pooling1d_259 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_259[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_519 (Batch  (None, 7, 96)       384         ['conv1d_519[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_259 (Add)                  (None, 7, 96)        0           ['max_pooling1d_259[0][0]',      
                                                                  'batch_normalization_519[0][0]']
                                                                                                  
 activation_519 (Activation)    (None, 7, 96)        0           ['add_259[0][0]']                
                                                                                                  
 conv1d_520 (Conv1D)            (None, 7, 192)       55488       ['activation_519[0][0]']         
                                                                                                  
 batch_normalization_520 (Batch  (None, 7, 192)      768         ['conv1d_520[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_520 (Activation)    (None, 7, 192)       0           ['batch_normalization_520[0][0]']
                                                                                                  
 spatial_dropout1d_260 (Spatial  (None, 7, 192)      0           ['activation_520[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_521 (Conv1D)            (None, 4, 192)       18624       ['activation_519[0][0]']         
                                                                                                  
 max_pooling1d_260 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_260[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_521 (Batch  (None, 4, 192)      768         ['conv1d_521[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_260 (Add)                  (None, 4, 192)       0           ['max_pooling1d_260[0][0]',      
                                                                  'batch_normalization_521[0][0]']
                                                                                                  
 activation_521 (Activation)    (None, 4, 192)       0           ['add_260[0][0]']                
                                                                                                  
 global_average_pooling1d_86 (G  (None, 192)         0           ['activation_521[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_86 (Globa  (None, 192)         0           ['activation_521[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_86 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_86[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_86[0][0]']
                                                                                                  
 dropout_172 (Dropout)          (None, 384)          0           ['concatenate_86[0][0]']         
                                                                                                  
 dense_86 (Dense)               (None, 128)          49280       ['dropout_172[0][0]']            
                                                                                                  
 dropout_173 (Dropout)          (None, 128)          0           ['dense_86[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_173[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_173[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 156,899
Trainable params: 155,555
Non-trainable params: 1,344
__________________________________________________________________________________________________
