Model: "model_36"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_18 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_216 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_18[0][0]'] 
                                                                                                  
 batch_normalization_216 (Batch  (None, 25, 48)      192         ['conv1d_216[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_216 (Activation)    (None, 25, 48)       0           ['batch_normalization_216[0][0]']
                                                                                                  
 spatial_dropout1d_108 (Spatial  (None, 25, 48)      0           ['activation_216[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_217 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_18[0][0]'] 
                                                                                                  
 max_pooling1d_108 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_108[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_217 (Batch  (None, 13, 48)      192         ['conv1d_217[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_108 (Add)                  (None, 13, 48)       0           ['max_pooling1d_108[0][0]',      
                                                                  'batch_normalization_217[0][0]']
                                                                                                  
 activation_217 (Activation)    (None, 13, 48)       0           ['add_108[0][0]']                
                                                                                                  
 conv1d_218 (Conv1D)            (None, 13, 96)       13920       ['activation_217[0][0]']         
                                                                                                  
 batch_normalization_218 (Batch  (None, 13, 96)      384         ['conv1d_218[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_218 (Activation)    (None, 13, 96)       0           ['batch_normalization_218[0][0]']
                                                                                                  
 spatial_dropout1d_109 (Spatial  (None, 13, 96)      0           ['activation_218[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_219 (Conv1D)            (None, 7, 96)        4704        ['activation_217[0][0]']         
                                                                                                  
 max_pooling1d_109 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_109[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_219 (Batch  (None, 7, 96)       384         ['conv1d_219[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_109 (Add)                  (None, 7, 96)        0           ['max_pooling1d_109[0][0]',      
                                                                  'batch_normalization_219[0][0]']
                                                                                                  
 activation_219 (Activation)    (None, 7, 96)        0           ['add_109[0][0]']                
                                                                                                  
 conv1d_220 (Conv1D)            (None, 7, 192)       55488       ['activation_219[0][0]']         
                                                                                                  
 batch_normalization_220 (Batch  (None, 7, 192)      768         ['conv1d_220[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_220 (Activation)    (None, 7, 192)       0           ['batch_normalization_220[0][0]']
                                                                                                  
 spatial_dropout1d_110 (Spatial  (None, 7, 192)      0           ['activation_220[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_221 (Conv1D)            (None, 4, 192)       18624       ['activation_219[0][0]']         
                                                                                                  
 max_pooling1d_110 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_110[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_221 (Batch  (None, 4, 192)      768         ['conv1d_221[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_110 (Add)                  (None, 4, 192)       0           ['max_pooling1d_110[0][0]',      
                                                                  'batch_normalization_221[0][0]']
                                                                                                  
 activation_221 (Activation)    (None, 4, 192)       0           ['add_110[0][0]']                
                                                                                                  
 global_average_pooling1d_36 (G  (None, 192)         0           ['activation_221[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_36 (Globa  (None, 192)         0           ['activation_221[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_36 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_36[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_36[0][0]']
                                                                                                  
 dropout_72 (Dropout)           (None, 384)          0           ['concatenate_36[0][0]']         
                                                                                                  
 dense_36 (Dense)               (None, 128)          49280       ['dropout_72[0][0]']             
                                                                                                  
 dropout_73 (Dropout)           (None, 128)          0           ['dense_36[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_73[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_73[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 153,059
Trainable params: 151,715
Non-trainable params: 1,344
__________________________________________________________________________________________________
