Model: "model_14"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_8 (BasicPr  (None, 25, 41)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_84 (Conv1D)             (None, 25, 16)       1984        ['basic_preprocessing_8[0][0]']  
                                                                                                  
 batch_normalization_84 (BatchN  (None, 25, 16)      64          ['conv1d_84[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_84 (Activation)     (None, 25, 16)       0           ['batch_normalization_84[0][0]'] 
                                                                                                  
 spatial_dropout1d_42 (SpatialD  (None, 25, 16)      0           ['activation_84[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_85 (Conv1D)             (None, 13, 16)       672         ['basic_preprocessing_8[0][0]']  
                                                                                                  
 max_pooling1d_42 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_42[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_85 (BatchN  (None, 13, 16)      64          ['conv1d_85[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_42 (Add)                   (None, 13, 16)       0           ['max_pooling1d_42[0][0]',       
                                                                  'batch_normalization_85[0][0]'] 
                                                                                                  
 activation_85 (Activation)     (None, 13, 16)       0           ['add_42[0][0]']                 
                                                                                                  
 conv1d_86 (Conv1D)             (None, 13, 32)       1568        ['activation_85[0][0]']          
                                                                                                  
 batch_normalization_86 (BatchN  (None, 13, 32)      128         ['conv1d_86[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_86 (Activation)     (None, 13, 32)       0           ['batch_normalization_86[0][0]'] 
                                                                                                  
 spatial_dropout1d_43 (SpatialD  (None, 13, 32)      0           ['activation_86[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_87 (Conv1D)             (None, 7, 32)        544         ['activation_85[0][0]']          
                                                                                                  
 max_pooling1d_43 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_43[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_87 (BatchN  (None, 7, 32)       128         ['conv1d_87[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_43 (Add)                   (None, 7, 32)        0           ['max_pooling1d_43[0][0]',       
                                                                  'batch_normalization_87[0][0]'] 
                                                                                                  
 activation_87 (Activation)     (None, 7, 32)        0           ['add_43[0][0]']                 
                                                                                                  
 conv1d_88 (Conv1D)             (None, 7, 64)        6208        ['activation_87[0][0]']          
                                                                                                  
 batch_normalization_88 (BatchN  (None, 7, 64)       256         ['conv1d_88[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_88 (Activation)     (None, 7, 64)        0           ['batch_normalization_88[0][0]'] 
                                                                                                  
 spatial_dropout1d_44 (SpatialD  (None, 7, 64)       0           ['activation_88[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_89 (Conv1D)             (None, 4, 64)        2112        ['activation_87[0][0]']          
                                                                                                  
 max_pooling1d_44 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_44[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_89 (BatchN  (None, 4, 64)       256         ['conv1d_89[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_44 (Add)                   (None, 4, 64)        0           ['max_pooling1d_44[0][0]',       
                                                                  'batch_normalization_89[0][0]'] 
                                                                                                  
 activation_89 (Activation)     (None, 4, 64)        0           ['add_44[0][0]']                 
                                                                                                  
 global_average_pooling1d_14 (G  (None, 64)          0           ['activation_89[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_14 (Globa  (None, 64)          0           ['activation_89[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_14 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_14[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_14[0][0]']
                                                                                                  
 dropout_28 (Dropout)           (None, 128)          0           ['concatenate_14[0][0]']         
                                                                                                  
 dense_14 (Dense)               (None, 128)          16512       ['dropout_28[0][0]']             
                                                                                                  
 dropout_29 (Dropout)           (None, 128)          0           ['dense_14[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_29[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_29[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 30,883
Trainable params: 30,435
Non-trainable params: 448
__________________________________________________________________________________________________
