Model: "model_72"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_36 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_432 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_36[0][0]'] 
                                                                                                  
 batch_normalization_432 (Batch  (None, 25, 48)      192         ['conv1d_432[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_432 (Activation)    (None, 25, 48)       0           ['batch_normalization_432[0][0]']
                                                                                                  
 spatial_dropout1d_216 (Spatial  (None, 25, 48)      0           ['activation_432[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_433 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_36[0][0]'] 
                                                                                                  
 max_pooling1d_216 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_216[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_433 (Batch  (None, 13, 48)      192         ['conv1d_433[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_216 (Add)                  (None, 13, 48)       0           ['max_pooling1d_216[0][0]',      
                                                                  'batch_normalization_433[0][0]']
                                                                                                  
 activation_433 (Activation)    (None, 13, 48)       0           ['add_216[0][0]']                
                                                                                                  
 conv1d_434 (Conv1D)            (None, 13, 96)       13920       ['activation_433[0][0]']         
                                                                                                  
 batch_normalization_434 (Batch  (None, 13, 96)      384         ['conv1d_434[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_434 (Activation)    (None, 13, 96)       0           ['batch_normalization_434[0][0]']
                                                                                                  
 spatial_dropout1d_217 (Spatial  (None, 13, 96)      0           ['activation_434[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_435 (Conv1D)            (None, 7, 96)        4704        ['activation_433[0][0]']         
                                                                                                  
 max_pooling1d_217 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_217[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_435 (Batch  (None, 7, 96)       384         ['conv1d_435[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_217 (Add)                  (None, 7, 96)        0           ['max_pooling1d_217[0][0]',      
                                                                  'batch_normalization_435[0][0]']
                                                                                                  
 activation_435 (Activation)    (None, 7, 96)        0           ['add_217[0][0]']                
                                                                                                  
 conv1d_436 (Conv1D)            (None, 7, 192)       55488       ['activation_435[0][0]']         
                                                                                                  
 batch_normalization_436 (Batch  (None, 7, 192)      768         ['conv1d_436[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_436 (Activation)    (None, 7, 192)       0           ['batch_normalization_436[0][0]']
                                                                                                  
 spatial_dropout1d_218 (Spatial  (None, 7, 192)      0           ['activation_436[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_437 (Conv1D)            (None, 4, 192)       18624       ['activation_435[0][0]']         
                                                                                                  
 max_pooling1d_218 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_218[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_437 (Batch  (None, 4, 192)      768         ['conv1d_437[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_218 (Add)                  (None, 4, 192)       0           ['max_pooling1d_218[0][0]',      
                                                                  'batch_normalization_437[0][0]']
                                                                                                  
 activation_437 (Activation)    (None, 4, 192)       0           ['add_218[0][0]']                
                                                                                                  
 global_average_pooling1d_72 (G  (None, 192)         0           ['activation_437[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_72 (Globa  (None, 192)         0           ['activation_437[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_72 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_72[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_72[0][0]']
                                                                                                  
 dropout_144 (Dropout)          (None, 384)          0           ['concatenate_72[0][0]']         
                                                                                                  
 dense_72 (Dense)               (None, 64)           24640       ['dropout_144[0][0]']            
                                                                                                  
 dropout_145 (Dropout)          (None, 64)           0           ['dense_72[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_145[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_145[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 132,067
Trainable params: 130,723
Non-trainable params: 1,344
__________________________________________________________________________________________________
