Model: "model_105"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_51 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_630 (Conv1D)            (None, 25, 16)       13264       ['enhanced_preprocessing_51[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_630 (Batch  (None, 25, 16)      64          ['conv1d_630[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_630 (Activation)    (None, 25, 16)       0           ['batch_normalization_630[0][0]']
                                                                                                  
 spatial_dropout1d_315 (Spatial  (None, 25, 16)      0           ['activation_630[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_631 (Conv1D)            (None, 13, 16)       4432        ['enhanced_preprocessing_51[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_315 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_315[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_631 (Batch  (None, 13, 16)      64          ['conv1d_631[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_315 (Add)                  (None, 13, 16)       0           ['max_pooling1d_315[0][0]',      
                                                                  'batch_normalization_631[0][0]']
                                                                                                  
 activation_631 (Activation)    (None, 13, 16)       0           ['add_315[0][0]']                
                                                                                                  
 conv1d_632 (Conv1D)            (None, 13, 32)       1568        ['activation_631[0][0]']         
                                                                                                  
 batch_normalization_632 (Batch  (None, 13, 32)      128         ['conv1d_632[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_632 (Activation)    (None, 13, 32)       0           ['batch_normalization_632[0][0]']
                                                                                                  
 spatial_dropout1d_316 (Spatial  (None, 13, 32)      0           ['activation_632[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_633 (Conv1D)            (None, 7, 32)        544         ['activation_631[0][0]']         
                                                                                                  
 max_pooling1d_316 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_316[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_633 (Batch  (None, 7, 32)       128         ['conv1d_633[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_316 (Add)                  (None, 7, 32)        0           ['max_pooling1d_316[0][0]',      
                                                                  'batch_normalization_633[0][0]']
                                                                                                  
 activation_633 (Activation)    (None, 7, 32)        0           ['add_316[0][0]']                
                                                                                                  
 conv1d_634 (Conv1D)            (None, 7, 64)        6208        ['activation_633[0][0]']         
                                                                                                  
 batch_normalization_634 (Batch  (None, 7, 64)       256         ['conv1d_634[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_634 (Activation)    (None, 7, 64)        0           ['batch_normalization_634[0][0]']
                                                                                                  
 spatial_dropout1d_317 (Spatial  (None, 7, 64)       0           ['activation_634[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_635 (Conv1D)            (None, 4, 64)        2112        ['activation_633[0][0]']         
                                                                                                  
 max_pooling1d_317 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_317[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_635 (Batch  (None, 4, 64)       256         ['conv1d_635[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_317 (Add)                  (None, 4, 64)        0           ['max_pooling1d_317[0][0]',      
                                                                  'batch_normalization_635[0][0]']
                                                                                                  
 activation_635 (Activation)    (None, 4, 64)        0           ['add_317[0][0]']                
                                                                                                  
 global_average_pooling1d_105 (  (None, 64)          0           ['activation_635[0][0]']         
 GlobalAveragePooling1D)                                                                          
                                                                                                  
 global_max_pooling1d_105 (Glob  (None, 64)          0           ['activation_635[0][0]']         
 alMaxPooling1D)                                                                                  
                                                                                                  
 concatenate_105 (Concatenate)  (None, 128)          0           ['global_average_pooling1d_105[0]
                                                                 [0]',                            
                                                                  'global_max_pooling1d_105[0][0]'
                                                                 ]                                
                                                                                                  
 dropout_210 (Dropout)          (None, 128)          0           ['concatenate_105[0][0]']        
                                                                                                  
 dense_105 (Dense)              (None, 64)           8256        ['dropout_210[0][0]']            
                                                                                                  
 dropout_211 (Dropout)          (None, 64)           0           ['dense_105[0][0]']              
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_211[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_211[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 37,475
Trainable params: 37,027
Non-trainable params: 448
__________________________________________________________________________________________________
