Model: "model_98"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_50 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_588 (Conv1D)            (None, 25, 16)       4432        ['basic_preprocessing_50[0][0]'] 
                                                                                                  
 batch_normalization_588 (Batch  (None, 25, 16)      64          ['conv1d_588[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_588 (Activation)    (None, 25, 16)       0           ['batch_normalization_588[0][0]']
                                                                                                  
 spatial_dropout1d_294 (Spatial  (None, 25, 16)      0           ['activation_588[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_589 (Conv1D)            (None, 13, 16)       1488        ['basic_preprocessing_50[0][0]'] 
                                                                                                  
 max_pooling1d_294 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_294[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_589 (Batch  (None, 13, 16)      64          ['conv1d_589[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_294 (Add)                  (None, 13, 16)       0           ['max_pooling1d_294[0][0]',      
                                                                  'batch_normalization_589[0][0]']
                                                                                                  
 activation_589 (Activation)    (None, 13, 16)       0           ['add_294[0][0]']                
                                                                                                  
 conv1d_590 (Conv1D)            (None, 13, 32)       1568        ['activation_589[0][0]']         
                                                                                                  
 batch_normalization_590 (Batch  (None, 13, 32)      128         ['conv1d_590[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_590 (Activation)    (None, 13, 32)       0           ['batch_normalization_590[0][0]']
                                                                                                  
 spatial_dropout1d_295 (Spatial  (None, 13, 32)      0           ['activation_590[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_591 (Conv1D)            (None, 7, 32)        544         ['activation_589[0][0]']         
                                                                                                  
 max_pooling1d_295 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_295[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_591 (Batch  (None, 7, 32)       128         ['conv1d_591[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_295 (Add)                  (None, 7, 32)        0           ['max_pooling1d_295[0][0]',      
                                                                  'batch_normalization_591[0][0]']
                                                                                                  
 activation_591 (Activation)    (None, 7, 32)        0           ['add_295[0][0]']                
                                                                                                  
 conv1d_592 (Conv1D)            (None, 7, 64)        6208        ['activation_591[0][0]']         
                                                                                                  
 batch_normalization_592 (Batch  (None, 7, 64)       256         ['conv1d_592[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_592 (Activation)    (None, 7, 64)        0           ['batch_normalization_592[0][0]']
                                                                                                  
 spatial_dropout1d_296 (Spatial  (None, 7, 64)       0           ['activation_592[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_593 (Conv1D)            (None, 4, 64)        2112        ['activation_591[0][0]']         
                                                                                                  
 max_pooling1d_296 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_296[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_593 (Batch  (None, 4, 64)       256         ['conv1d_593[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_296 (Add)                  (None, 4, 64)        0           ['max_pooling1d_296[0][0]',      
                                                                  'batch_normalization_593[0][0]']
                                                                                                  
 activation_593 (Activation)    (None, 4, 64)        0           ['add_296[0][0]']                
                                                                                                  
 global_average_pooling1d_98 (G  (None, 64)          0           ['activation_593[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_98 (Globa  (None, 64)          0           ['activation_593[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_98 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_98[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_98[0][0]']
                                                                                                  
 dropout_196 (Dropout)          (None, 128)          0           ['concatenate_98[0][0]']         
                                                                                                  
 dense_98 (Dense)               (None, 64)           8256        ['dropout_196[0][0]']            
                                                                                                  
 dropout_197 (Dropout)          (None, 64)           0           ['dense_98[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_197[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_197[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 25,699
Trainable params: 25,251
Non-trainable params: 448
__________________________________________________________________________________________________
