Model: "model_103"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_52 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_618 (Conv1D)            (None, 25, 16)       4432        ['basic_preprocessing_52[0][0]'] 
                                                                                                  
 batch_normalization_618 (Batch  (None, 25, 16)      64          ['conv1d_618[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_618 (Activation)    (None, 25, 16)       0           ['batch_normalization_618[0][0]']
                                                                                                  
 spatial_dropout1d_309 (Spatial  (None, 25, 16)      0           ['activation_618[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_619 (Conv1D)            (None, 13, 16)       1488        ['basic_preprocessing_52[0][0]'] 
                                                                                                  
 max_pooling1d_309 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_309[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_619 (Batch  (None, 13, 16)      64          ['conv1d_619[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_309 (Add)                  (None, 13, 16)       0           ['max_pooling1d_309[0][0]',      
                                                                  'batch_normalization_619[0][0]']
                                                                                                  
 activation_619 (Activation)    (None, 13, 16)       0           ['add_309[0][0]']                
                                                                                                  
 conv1d_620 (Conv1D)            (None, 13, 32)       1568        ['activation_619[0][0]']         
                                                                                                  
 batch_normalization_620 (Batch  (None, 13, 32)      128         ['conv1d_620[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_620 (Activation)    (None, 13, 32)       0           ['batch_normalization_620[0][0]']
                                                                                                  
 spatial_dropout1d_310 (Spatial  (None, 13, 32)      0           ['activation_620[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_621 (Conv1D)            (None, 7, 32)        544         ['activation_619[0][0]']         
                                                                                                  
 max_pooling1d_310 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_310[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_621 (Batch  (None, 7, 32)       128         ['conv1d_621[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_310 (Add)                  (None, 7, 32)        0           ['max_pooling1d_310[0][0]',      
                                                                  'batch_normalization_621[0][0]']
                                                                                                  
 activation_621 (Activation)    (None, 7, 32)        0           ['add_310[0][0]']                
                                                                                                  
 conv1d_622 (Conv1D)            (None, 7, 64)        6208        ['activation_621[0][0]']         
                                                                                                  
 batch_normalization_622 (Batch  (None, 7, 64)       256         ['conv1d_622[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_622 (Activation)    (None, 7, 64)        0           ['batch_normalization_622[0][0]']
                                                                                                  
 spatial_dropout1d_311 (Spatial  (None, 7, 64)       0           ['activation_622[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_623 (Conv1D)            (None, 4, 64)        2112        ['activation_621[0][0]']         
                                                                                                  
 max_pooling1d_311 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_311[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_623 (Batch  (None, 4, 64)       256         ['conv1d_623[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_311 (Add)                  (None, 4, 64)        0           ['max_pooling1d_311[0][0]',      
                                                                  'batch_normalization_623[0][0]']
                                                                                                  
 activation_623 (Activation)    (None, 4, 64)        0           ['add_311[0][0]']                
                                                                                                  
 global_average_pooling1d_103 (  (None, 64)          0           ['activation_623[0][0]']         
 GlobalAveragePooling1D)                                                                          
                                                                                                  
 global_max_pooling1d_103 (Glob  (None, 64)          0           ['activation_623[0][0]']         
 alMaxPooling1D)                                                                                  
                                                                                                  
 concatenate_103 (Concatenate)  (None, 128)          0           ['global_average_pooling1d_103[0]
                                                                 [0]',                            
                                                                  'global_max_pooling1d_103[0][0]'
                                                                 ]                                
                                                                                                  
 dropout_206 (Dropout)          (None, 128)          0           ['concatenate_103[0][0]']        
                                                                                                  
 dense_103 (Dense)              (None, 64)           8256        ['dropout_206[0][0]']            
                                                                                                  
 dropout_207 (Dropout)          (None, 64)           0           ['dense_103[0][0]']              
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_207[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_207[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 25,699
Trainable params: 25,251
Non-trainable params: 448
__________________________________________________________________________________________________
