Model: "model_78"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_39 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_468 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_39[0][0]'] 
                                                                                                  
 batch_normalization_468 (Batch  (None, 25, 48)      192         ['conv1d_468[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_468 (Activation)    (None, 25, 48)       0           ['batch_normalization_468[0][0]']
                                                                                                  
 spatial_dropout1d_234 (Spatial  (None, 25, 48)      0           ['activation_468[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_469 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_39[0][0]'] 
                                                                                                  
 max_pooling1d_234 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_234[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_469 (Batch  (None, 13, 48)      192         ['conv1d_469[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_234 (Add)                  (None, 13, 48)       0           ['max_pooling1d_234[0][0]',      
                                                                  'batch_normalization_469[0][0]']
                                                                                                  
 activation_469 (Activation)    (None, 13, 48)       0           ['add_234[0][0]']                
                                                                                                  
 conv1d_470 (Conv1D)            (None, 13, 96)       13920       ['activation_469[0][0]']         
                                                                                                  
 batch_normalization_470 (Batch  (None, 13, 96)      384         ['conv1d_470[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_470 (Activation)    (None, 13, 96)       0           ['batch_normalization_470[0][0]']
                                                                                                  
 spatial_dropout1d_235 (Spatial  (None, 13, 96)      0           ['activation_470[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_471 (Conv1D)            (None, 7, 96)        4704        ['activation_469[0][0]']         
                                                                                                  
 max_pooling1d_235 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_235[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_471 (Batch  (None, 7, 96)       384         ['conv1d_471[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_235 (Add)                  (None, 7, 96)        0           ['max_pooling1d_235[0][0]',      
                                                                  'batch_normalization_471[0][0]']
                                                                                                  
 activation_471 (Activation)    (None, 7, 96)        0           ['add_235[0][0]']                
                                                                                                  
 conv1d_472 (Conv1D)            (None, 7, 192)       55488       ['activation_471[0][0]']         
                                                                                                  
 batch_normalization_472 (Batch  (None, 7, 192)      768         ['conv1d_472[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_472 (Activation)    (None, 7, 192)       0           ['batch_normalization_472[0][0]']
                                                                                                  
 spatial_dropout1d_236 (Spatial  (None, 7, 192)      0           ['activation_472[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_473 (Conv1D)            (None, 4, 192)       18624       ['activation_471[0][0]']         
                                                                                                  
 max_pooling1d_236 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_236[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_473 (Batch  (None, 4, 192)      768         ['conv1d_473[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_236 (Add)                  (None, 4, 192)       0           ['max_pooling1d_236[0][0]',      
                                                                  'batch_normalization_473[0][0]']
                                                                                                  
 activation_473 (Activation)    (None, 4, 192)       0           ['add_236[0][0]']                
                                                                                                  
 global_average_pooling1d_78 (G  (None, 192)         0           ['activation_473[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_78 (Globa  (None, 192)         0           ['activation_473[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_78 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_78[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_78[0][0]']
                                                                                                  
 dropout_156 (Dropout)          (None, 384)          0           ['concatenate_78[0][0]']         
                                                                                                  
 dense_78 (Dense)               (None, 64)           24640       ['dropout_156[0][0]']            
                                                                                                  
 dropout_157 (Dropout)          (None, 64)           0           ['dense_78[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_157[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_157[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 132,067
Trainable params: 130,723
Non-trainable params: 1,344
__________________________________________________________________________________________________
