Model: "model_69"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_33 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_414 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_33[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_414 (Batch  (None, 25, 16)      64          ['conv1d_414[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_414 (Activation)    (None, 25, 16)       0           ['batch_normalization_414[0][0]']
                                                                                                  
 spatial_dropout1d_207 (Spatial  (None, 25, 16)      0           ['activation_414[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_415 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_33[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_207 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_207[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_415 (Batch  (None, 13, 16)      64          ['conv1d_415[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_207 (Add)                  (None, 13, 16)       0           ['max_pooling1d_207[0][0]',      
                                                                  'batch_normalization_415[0][0]']
                                                                                                  
 activation_415 (Activation)    (None, 13, 16)       0           ['add_207[0][0]']                
                                                                                                  
 conv1d_416 (Conv1D)            (None, 13, 32)       1568        ['activation_415[0][0]']         
                                                                                                  
 batch_normalization_416 (Batch  (None, 13, 32)      128         ['conv1d_416[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_416 (Activation)    (None, 13, 32)       0           ['batch_normalization_416[0][0]']
                                                                                                  
 spatial_dropout1d_208 (Spatial  (None, 13, 32)      0           ['activation_416[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_417 (Conv1D)            (None, 7, 32)        544         ['activation_415[0][0]']         
                                                                                                  
 max_pooling1d_208 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_208[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_417 (Batch  (None, 7, 32)       128         ['conv1d_417[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_208 (Add)                  (None, 7, 32)        0           ['max_pooling1d_208[0][0]',      
                                                                  'batch_normalization_417[0][0]']
                                                                                                  
 activation_417 (Activation)    (None, 7, 32)        0           ['add_208[0][0]']                
                                                                                                  
 conv1d_418 (Conv1D)            (None, 7, 64)        6208        ['activation_417[0][0]']         
                                                                                                  
 batch_normalization_418 (Batch  (None, 7, 64)       256         ['conv1d_418[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_418 (Activation)    (None, 7, 64)        0           ['batch_normalization_418[0][0]']
                                                                                                  
 spatial_dropout1d_209 (Spatial  (None, 7, 64)       0           ['activation_418[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_419 (Conv1D)            (None, 4, 64)        2112        ['activation_417[0][0]']         
                                                                                                  
 max_pooling1d_209 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_209[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_419 (Batch  (None, 4, 64)       256         ['conv1d_419[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_209 (Add)                  (None, 4, 64)        0           ['max_pooling1d_209[0][0]',      
                                                                  'batch_normalization_419[0][0]']
                                                                                                  
 activation_419 (Activation)    (None, 4, 64)        0           ['add_209[0][0]']                
                                                                                                  
 global_average_pooling1d_69 (G  (None, 64)          0           ['activation_419[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_69 (Globa  (None, 64)          0           ['activation_419[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_69 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_69[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_69[0][0]']
                                                                                                  
 dropout_138 (Dropout)          (None, 128)          0           ['concatenate_69[0][0]']         
                                                                                                  
 dense_69 (Dense)               (None, 128)          16512       ['dropout_138[0][0]']            
                                                                                                  
 dropout_139 (Dropout)          (None, 128)          0           ['dense_69[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_139[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_139[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 39,971
Trainable params: 39,523
Non-trainable params: 448
__________________________________________________________________________________________________
