Model: "model_12"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_6 (BasicPr  (None, 25, 92)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_72 (Conv1D)             (None, 25, 48)       13296       ['basic_preprocessing_6[0][0]']  
                                                                                                  
 batch_normalization_72 (BatchN  (None, 25, 48)      192         ['conv1d_72[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_72 (Activation)     (None, 25, 48)       0           ['batch_normalization_72[0][0]'] 
                                                                                                  
 spatial_dropout1d_36 (SpatialD  (None, 25, 48)      0           ['activation_72[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_73 (Conv1D)             (None, 13, 48)       4464        ['basic_preprocessing_6[0][0]']  
                                                                                                  
 max_pooling1d_36 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_36[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_73 (BatchN  (None, 13, 48)      192         ['conv1d_73[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_36 (Add)                   (None, 13, 48)       0           ['max_pooling1d_36[0][0]',       
                                                                  'batch_normalization_73[0][0]'] 
                                                                                                  
 activation_73 (Activation)     (None, 13, 48)       0           ['add_36[0][0]']                 
                                                                                                  
 conv1d_74 (Conv1D)             (None, 13, 96)       13920       ['activation_73[0][0]']          
                                                                                                  
 batch_normalization_74 (BatchN  (None, 13, 96)      384         ['conv1d_74[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_74 (Activation)     (None, 13, 96)       0           ['batch_normalization_74[0][0]'] 
                                                                                                  
 spatial_dropout1d_37 (SpatialD  (None, 13, 96)      0           ['activation_74[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_75 (Conv1D)             (None, 7, 96)        4704        ['activation_73[0][0]']          
                                                                                                  
 max_pooling1d_37 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_37[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_75 (BatchN  (None, 7, 96)       384         ['conv1d_75[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_37 (Add)                   (None, 7, 96)        0           ['max_pooling1d_37[0][0]',       
                                                                  'batch_normalization_75[0][0]'] 
                                                                                                  
 activation_75 (Activation)     (None, 7, 96)        0           ['add_37[0][0]']                 
                                                                                                  
 conv1d_76 (Conv1D)             (None, 7, 192)       55488       ['activation_75[0][0]']          
                                                                                                  
 batch_normalization_76 (BatchN  (None, 7, 192)      768         ['conv1d_76[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_76 (Activation)     (None, 7, 192)       0           ['batch_normalization_76[0][0]'] 
                                                                                                  
 spatial_dropout1d_38 (SpatialD  (None, 7, 192)      0           ['activation_76[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_77 (Conv1D)             (None, 4, 192)       18624       ['activation_75[0][0]']          
                                                                                                  
 max_pooling1d_38 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_38[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_77 (BatchN  (None, 4, 192)      768         ['conv1d_77[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_38 (Add)                   (None, 4, 192)       0           ['max_pooling1d_38[0][0]',       
                                                                  'batch_normalization_77[0][0]'] 
                                                                                                  
 activation_77 (Activation)     (None, 4, 192)       0           ['add_38[0][0]']                 
                                                                                                  
 global_average_pooling1d_12 (G  (None, 192)         0           ['activation_77[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_12 (Globa  (None, 192)         0           ['activation_77[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_12 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_12[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_12[0][0]']
                                                                                                  
 dropout_24 (Dropout)           (None, 384)          0           ['concatenate_12[0][0]']         
                                                                                                  
 dense_12 (Dense)               (None, 64)           24640       ['dropout_24[0][0]']             
                                                                                                  
 dropout_25 (Dropout)           (None, 64)           0           ['dense_12[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_25[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_25[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 138,019
Trainable params: 136,675
Non-trainable params: 1,344
__________________________________________________________________________________________________
