Model: "model_83"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_41 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_498 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_41[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_498 (Batch  (None, 25, 48)      192         ['conv1d_498[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_498 (Activation)    (None, 25, 48)       0           ['batch_normalization_498[0][0]']
                                                                                                  
 spatial_dropout1d_249 (Spatial  (None, 25, 48)      0           ['activation_498[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_499 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_41[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_249 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_249[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_499 (Batch  (None, 13, 48)      192         ['conv1d_499[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_249 (Add)                  (None, 13, 48)       0           ['max_pooling1d_249[0][0]',      
                                                                  'batch_normalization_499[0][0]']
                                                                                                  
 activation_499 (Activation)    (None, 13, 48)       0           ['add_249[0][0]']                
                                                                                                  
 conv1d_500 (Conv1D)            (None, 13, 96)       13920       ['activation_499[0][0]']         
                                                                                                  
 batch_normalization_500 (Batch  (None, 13, 96)      384         ['conv1d_500[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_500 (Activation)    (None, 13, 96)       0           ['batch_normalization_500[0][0]']
                                                                                                  
 spatial_dropout1d_250 (Spatial  (None, 13, 96)      0           ['activation_500[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_501 (Conv1D)            (None, 7, 96)        4704        ['activation_499[0][0]']         
                                                                                                  
 max_pooling1d_250 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_250[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_501 (Batch  (None, 7, 96)       384         ['conv1d_501[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_250 (Add)                  (None, 7, 96)        0           ['max_pooling1d_250[0][0]',      
                                                                  'batch_normalization_501[0][0]']
                                                                                                  
 activation_501 (Activation)    (None, 7, 96)        0           ['add_250[0][0]']                
                                                                                                  
 conv1d_502 (Conv1D)            (None, 7, 192)       55488       ['activation_501[0][0]']         
                                                                                                  
 batch_normalization_502 (Batch  (None, 7, 192)      768         ['conv1d_502[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_502 (Activation)    (None, 7, 192)       0           ['batch_normalization_502[0][0]']
                                                                                                  
 spatial_dropout1d_251 (Spatial  (None, 7, 192)      0           ['activation_502[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_503 (Conv1D)            (None, 4, 192)       18624       ['activation_501[0][0]']         
                                                                                                  
 max_pooling1d_251 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_251[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_503 (Batch  (None, 4, 192)      768         ['conv1d_503[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_251 (Add)                  (None, 4, 192)       0           ['max_pooling1d_251[0][0]',      
                                                                  'batch_normalization_503[0][0]']
                                                                                                  
 activation_503 (Activation)    (None, 4, 192)       0           ['add_251[0][0]']                
                                                                                                  
 global_average_pooling1d_83 (G  (None, 192)         0           ['activation_503[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_83 (Globa  (None, 192)         0           ['activation_503[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_83 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_83[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_83[0][0]']
                                                                                                  
 dropout_166 (Dropout)          (None, 384)          0           ['concatenate_83[0][0]']         
                                                                                                  
 dense_83 (Dense)               (None, 64)           24640       ['dropout_166[0][0]']            
                                                                                                  
 dropout_167 (Dropout)          (None, 64)           0           ['dense_83[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_167[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_167[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 155,491
Trainable params: 154,147
Non-trainable params: 1,344
__________________________________________________________________________________________________
