Model: "model_9"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_3 (Enha  (None, 25, 276)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_54 (Conv1D)             (None, 25, 16)       13264       ['enhanced_preprocessing_3[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_54 (BatchN  (None, 25, 16)      64          ['conv1d_54[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_54 (Activation)     (None, 25, 16)       0           ['batch_normalization_54[0][0]'] 
                                                                                                  
 spatial_dropout1d_27 (SpatialD  (None, 25, 16)      0           ['activation_54[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_55 (Conv1D)             (None, 13, 16)       4432        ['enhanced_preprocessing_3[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_27 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_27[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_55 (BatchN  (None, 13, 16)      64          ['conv1d_55[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_27 (Add)                   (None, 13, 16)       0           ['max_pooling1d_27[0][0]',       
                                                                  'batch_normalization_55[0][0]'] 
                                                                                                  
 activation_55 (Activation)     (None, 13, 16)       0           ['add_27[0][0]']                 
                                                                                                  
 conv1d_56 (Conv1D)             (None, 13, 32)       1568        ['activation_55[0][0]']          
                                                                                                  
 batch_normalization_56 (BatchN  (None, 13, 32)      128         ['conv1d_56[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_56 (Activation)     (None, 13, 32)       0           ['batch_normalization_56[0][0]'] 
                                                                                                  
 spatial_dropout1d_28 (SpatialD  (None, 13, 32)      0           ['activation_56[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_57 (Conv1D)             (None, 7, 32)        544         ['activation_55[0][0]']          
                                                                                                  
 max_pooling1d_28 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_28[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_57 (BatchN  (None, 7, 32)       128         ['conv1d_57[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_28 (Add)                   (None, 7, 32)        0           ['max_pooling1d_28[0][0]',       
                                                                  'batch_normalization_57[0][0]'] 
                                                                                                  
 activation_57 (Activation)     (None, 7, 32)        0           ['add_28[0][0]']                 
                                                                                                  
 conv1d_58 (Conv1D)             (None, 7, 64)        6208        ['activation_57[0][0]']          
                                                                                                  
 batch_normalization_58 (BatchN  (None, 7, 64)       256         ['conv1d_58[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_58 (Activation)     (None, 7, 64)        0           ['batch_normalization_58[0][0]'] 
                                                                                                  
 spatial_dropout1d_29 (SpatialD  (None, 7, 64)       0           ['activation_58[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_59 (Conv1D)             (None, 4, 64)        2112        ['activation_57[0][0]']          
                                                                                                  
 max_pooling1d_29 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_29[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_59 (BatchN  (None, 4, 64)       256         ['conv1d_59[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_29 (Add)                   (None, 4, 64)        0           ['max_pooling1d_29[0][0]',       
                                                                  'batch_normalization_59[0][0]'] 
                                                                                                  
 activation_59 (Activation)     (None, 4, 64)        0           ['add_29[0][0]']                 
                                                                                                  
 global_average_pooling1d_9 (Gl  (None, 64)          0           ['activation_59[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_9 (Global  (None, 64)          0           ['activation_59[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_9 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_9[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_9[0][0]'] 
                                                                                                  
 dropout_18 (Dropout)           (None, 128)          0           ['concatenate_9[0][0]']          
                                                                                                  
 dense_9 (Dense)                (None, 128)          16512       ['dropout_18[0][0]']             
                                                                                                  
 dropout_19 (Dropout)           (None, 128)          0           ['dense_9[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_19[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_19[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 45,923
Trainable params: 45,475
Non-trainable params: 448
__________________________________________________________________________________________________
