Model: "model_32"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_17 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_192 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_17[0][0]'] 
                                                                                                  
 batch_normalization_192 (Batch  (None, 25, 48)      192         ['conv1d_192[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_192 (Activation)    (None, 25, 48)       0           ['batch_normalization_192[0][0]']
                                                                                                  
 spatial_dropout1d_96 (SpatialD  (None, 25, 48)      0           ['activation_192[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_193 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_17[0][0]'] 
                                                                                                  
 max_pooling1d_96 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_96[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_193 (Batch  (None, 13, 48)      192         ['conv1d_193[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_96 (Add)                   (None, 13, 48)       0           ['max_pooling1d_96[0][0]',       
                                                                  'batch_normalization_193[0][0]']
                                                                                                  
 activation_193 (Activation)    (None, 13, 48)       0           ['add_96[0][0]']                 
                                                                                                  
 conv1d_194 (Conv1D)            (None, 13, 96)       13920       ['activation_193[0][0]']         
                                                                                                  
 batch_normalization_194 (Batch  (None, 13, 96)      384         ['conv1d_194[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_194 (Activation)    (None, 13, 96)       0           ['batch_normalization_194[0][0]']
                                                                                                  
 spatial_dropout1d_97 (SpatialD  (None, 13, 96)      0           ['activation_194[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_195 (Conv1D)            (None, 7, 96)        4704        ['activation_193[0][0]']         
                                                                                                  
 max_pooling1d_97 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_97[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_195 (Batch  (None, 7, 96)       384         ['conv1d_195[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_97 (Add)                   (None, 7, 96)        0           ['max_pooling1d_97[0][0]',       
                                                                  'batch_normalization_195[0][0]']
                                                                                                  
 activation_195 (Activation)    (None, 7, 96)        0           ['add_97[0][0]']                 
                                                                                                  
 conv1d_196 (Conv1D)            (None, 7, 192)       55488       ['activation_195[0][0]']         
                                                                                                  
 batch_normalization_196 (Batch  (None, 7, 192)      768         ['conv1d_196[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_196 (Activation)    (None, 7, 192)       0           ['batch_normalization_196[0][0]']
                                                                                                  
 spatial_dropout1d_98 (SpatialD  (None, 7, 192)      0           ['activation_196[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_197 (Conv1D)            (None, 4, 192)       18624       ['activation_195[0][0]']         
                                                                                                  
 max_pooling1d_98 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_98[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_197 (Batch  (None, 4, 192)      768         ['conv1d_197[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_98 (Add)                   (None, 4, 192)       0           ['max_pooling1d_98[0][0]',       
                                                                  'batch_normalization_197[0][0]']
                                                                                                  
 activation_197 (Activation)    (None, 4, 192)       0           ['add_98[0][0]']                 
                                                                                                  
 global_average_pooling1d_32 (G  (None, 192)         0           ['activation_197[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_32 (Globa  (None, 192)         0           ['activation_197[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_32 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_32[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_32[0][0]']
                                                                                                  
 dropout_64 (Dropout)           (None, 384)          0           ['concatenate_32[0][0]']         
                                                                                                  
 dense_32 (Dense)               (None, 64)           24640       ['dropout_64[0][0]']             
                                                                                                  
 dropout_65 (Dropout)           (None, 64)           0           ['dense_32[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_65[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_65[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 128,227
Trainable params: 126,883
Non-trainable params: 1,344
__________________________________________________________________________________________________
