Model: "model_34"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_16 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_204 (Conv1D)            (None, 25, 48)       17760       ['enhanced_preprocessing_16[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_204 (Batch  (None, 25, 48)      192         ['conv1d_204[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_204 (Activation)    (None, 25, 48)       0           ['batch_normalization_204[0][0]']
                                                                                                  
 spatial_dropout1d_102 (Spatial  (None, 25, 48)      0           ['activation_204[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_205 (Conv1D)            (None, 13, 48)       5952        ['enhanced_preprocessing_16[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_102 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_102[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_205 (Batch  (None, 13, 48)      192         ['conv1d_205[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_102 (Add)                  (None, 13, 48)       0           ['max_pooling1d_102[0][0]',      
                                                                  'batch_normalization_205[0][0]']
                                                                                                  
 activation_205 (Activation)    (None, 13, 48)       0           ['add_102[0][0]']                
                                                                                                  
 conv1d_206 (Conv1D)            (None, 13, 96)       13920       ['activation_205[0][0]']         
                                                                                                  
 batch_normalization_206 (Batch  (None, 13, 96)      384         ['conv1d_206[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_206 (Activation)    (None, 13, 96)       0           ['batch_normalization_206[0][0]']
                                                                                                  
 spatial_dropout1d_103 (Spatial  (None, 13, 96)      0           ['activation_206[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_207 (Conv1D)            (None, 7, 96)        4704        ['activation_205[0][0]']         
                                                                                                  
 max_pooling1d_103 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_103[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_207 (Batch  (None, 7, 96)       384         ['conv1d_207[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_103 (Add)                  (None, 7, 96)        0           ['max_pooling1d_103[0][0]',      
                                                                  'batch_normalization_207[0][0]']
                                                                                                  
 activation_207 (Activation)    (None, 7, 96)        0           ['add_103[0][0]']                
                                                                                                  
 conv1d_208 (Conv1D)            (None, 7, 192)       55488       ['activation_207[0][0]']         
                                                                                                  
 batch_normalization_208 (Batch  (None, 7, 192)      768         ['conv1d_208[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_208 (Activation)    (None, 7, 192)       0           ['batch_normalization_208[0][0]']
                                                                                                  
 spatial_dropout1d_104 (Spatial  (None, 7, 192)      0           ['activation_208[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_209 (Conv1D)            (None, 4, 192)       18624       ['activation_207[0][0]']         
                                                                                                  
 max_pooling1d_104 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_104[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_209 (Batch  (None, 4, 192)      768         ['conv1d_209[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_104 (Add)                  (None, 4, 192)       0           ['max_pooling1d_104[0][0]',      
                                                                  'batch_normalization_209[0][0]']
                                                                                                  
 activation_209 (Activation)    (None, 4, 192)       0           ['add_104[0][0]']                
                                                                                                  
 global_average_pooling1d_34 (G  (None, 192)         0           ['activation_209[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_34 (Globa  (None, 192)         0           ['activation_209[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_34 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_34[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_34[0][0]']
                                                                                                  
 dropout_68 (Dropout)           (None, 384)          0           ['concatenate_34[0][0]']         
                                                                                                  
 dense_34 (Dense)               (None, 64)           24640       ['dropout_68[0][0]']             
                                                                                                  
 dropout_69 (Dropout)           (None, 64)           0           ['dense_34[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_69[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_69[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 143,971
Trainable params: 142,627
Non-trainable params: 1,344
__________________________________________________________________________________________________
