Model: "model_51"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_24 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_306 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_24[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_306 (Batch  (None, 25, 16)      64          ['conv1d_306[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_306 (Activation)    (None, 25, 16)       0           ['batch_normalization_306[0][0]']
                                                                                                  
 spatial_dropout1d_153 (Spatial  (None, 25, 16)      0           ['activation_306[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_307 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_24[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_153 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_153[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_307 (Batch  (None, 13, 16)      64          ['conv1d_307[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_153 (Add)                  (None, 13, 16)       0           ['max_pooling1d_153[0][0]',      
                                                                  'batch_normalization_307[0][0]']
                                                                                                  
 activation_307 (Activation)    (None, 13, 16)       0           ['add_153[0][0]']                
                                                                                                  
 conv1d_308 (Conv1D)            (None, 13, 32)       1568        ['activation_307[0][0]']         
                                                                                                  
 batch_normalization_308 (Batch  (None, 13, 32)      128         ['conv1d_308[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_308 (Activation)    (None, 13, 32)       0           ['batch_normalization_308[0][0]']
                                                                                                  
 spatial_dropout1d_154 (Spatial  (None, 13, 32)      0           ['activation_308[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_309 (Conv1D)            (None, 7, 32)        544         ['activation_307[0][0]']         
                                                                                                  
 max_pooling1d_154 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_154[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_309 (Batch  (None, 7, 32)       128         ['conv1d_309[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_154 (Add)                  (None, 7, 32)        0           ['max_pooling1d_154[0][0]',      
                                                                  'batch_normalization_309[0][0]']
                                                                                                  
 activation_309 (Activation)    (None, 7, 32)        0           ['add_154[0][0]']                
                                                                                                  
 conv1d_310 (Conv1D)            (None, 7, 64)        6208        ['activation_309[0][0]']         
                                                                                                  
 batch_normalization_310 (Batch  (None, 7, 64)       256         ['conv1d_310[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_310 (Activation)    (None, 7, 64)        0           ['batch_normalization_310[0][0]']
                                                                                                  
 spatial_dropout1d_155 (Spatial  (None, 7, 64)       0           ['activation_310[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_311 (Conv1D)            (None, 4, 64)        2112        ['activation_309[0][0]']         
                                                                                                  
 max_pooling1d_155 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_155[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_311 (Batch  (None, 4, 64)       256         ['conv1d_311[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_155 (Add)                  (None, 4, 64)        0           ['max_pooling1d_155[0][0]',      
                                                                  'batch_normalization_311[0][0]']
                                                                                                  
 activation_311 (Activation)    (None, 4, 64)        0           ['add_155[0][0]']                
                                                                                                  
 global_average_pooling1d_51 (G  (None, 64)          0           ['activation_311[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_51 (Globa  (None, 64)          0           ['activation_311[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_51 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_51[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_51[0][0]']
                                                                                                  
 dropout_102 (Dropout)          (None, 128)          0           ['concatenate_51[0][0]']         
                                                                                                  
 dense_51 (Dense)               (None, 64)           8256        ['dropout_102[0][0]']            
                                                                                                  
 dropout_103 (Dropout)          (None, 64)           0           ['dense_51[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_103[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_103[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 31,523
Trainable params: 31,075
Non-trainable params: 448
__________________________________________________________________________________________________
