Model: "model_70"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_34 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_420 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_34[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_420 (Batch  (None, 25, 16)      64          ['conv1d_420[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_420 (Activation)    (None, 25, 16)       0           ['batch_normalization_420[0][0]']
                                                                                                  
 spatial_dropout1d_210 (Spatial  (None, 25, 16)      0           ['activation_420[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_421 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_34[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_210 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_210[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_421 (Batch  (None, 13, 16)      64          ['conv1d_421[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_210 (Add)                  (None, 13, 16)       0           ['max_pooling1d_210[0][0]',      
                                                                  'batch_normalization_421[0][0]']
                                                                                                  
 activation_421 (Activation)    (None, 13, 16)       0           ['add_210[0][0]']                
                                                                                                  
 conv1d_422 (Conv1D)            (None, 13, 32)       1568        ['activation_421[0][0]']         
                                                                                                  
 batch_normalization_422 (Batch  (None, 13, 32)      128         ['conv1d_422[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_422 (Activation)    (None, 13, 32)       0           ['batch_normalization_422[0][0]']
                                                                                                  
 spatial_dropout1d_211 (Spatial  (None, 13, 32)      0           ['activation_422[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_423 (Conv1D)            (None, 7, 32)        544         ['activation_421[0][0]']         
                                                                                                  
 max_pooling1d_211 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_211[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_423 (Batch  (None, 7, 32)       128         ['conv1d_423[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_211 (Add)                  (None, 7, 32)        0           ['max_pooling1d_211[0][0]',      
                                                                  'batch_normalization_423[0][0]']
                                                                                                  
 activation_423 (Activation)    (None, 7, 32)        0           ['add_211[0][0]']                
                                                                                                  
 conv1d_424 (Conv1D)            (None, 7, 64)        6208        ['activation_423[0][0]']         
                                                                                                  
 batch_normalization_424 (Batch  (None, 7, 64)       256         ['conv1d_424[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_424 (Activation)    (None, 7, 64)        0           ['batch_normalization_424[0][0]']
                                                                                                  
 spatial_dropout1d_212 (Spatial  (None, 7, 64)       0           ['activation_424[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_425 (Conv1D)            (None, 4, 64)        2112        ['activation_423[0][0]']         
                                                                                                  
 max_pooling1d_212 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_212[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_425 (Batch  (None, 4, 64)       256         ['conv1d_425[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_212 (Add)                  (None, 4, 64)        0           ['max_pooling1d_212[0][0]',      
                                                                  'batch_normalization_425[0][0]']
                                                                                                  
 activation_425 (Activation)    (None, 4, 64)        0           ['add_212[0][0]']                
                                                                                                  
 global_average_pooling1d_70 (G  (None, 64)          0           ['activation_425[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_70 (Globa  (None, 64)          0           ['activation_425[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_70 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_70[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_70[0][0]']
                                                                                                  
 dropout_140 (Dropout)          (None, 128)          0           ['concatenate_70[0][0]']         
                                                                                                  
 dense_70 (Dense)               (None, 128)          16512       ['dropout_140[0][0]']            
                                                                                                  
 dropout_141 (Dropout)          (None, 128)          0           ['dense_70[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_141[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_141[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 39,971
Trainable params: 39,523
Non-trainable params: 448
__________________________________________________________________________________________________
