Model: "model_58"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_28 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_348 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_28[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_348 (Batch  (None, 25, 16)      64          ['conv1d_348[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_348 (Activation)    (None, 25, 16)       0           ['batch_normalization_348[0][0]']
                                                                                                  
 spatial_dropout1d_174 (Spatial  (None, 25, 16)      0           ['activation_348[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_349 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_28[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_174 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_174[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_349 (Batch  (None, 13, 16)      64          ['conv1d_349[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_174 (Add)                  (None, 13, 16)       0           ['max_pooling1d_174[0][0]',      
                                                                  'batch_normalization_349[0][0]']
                                                                                                  
 activation_349 (Activation)    (None, 13, 16)       0           ['add_174[0][0]']                
                                                                                                  
 conv1d_350 (Conv1D)            (None, 13, 32)       1568        ['activation_349[0][0]']         
                                                                                                  
 batch_normalization_350 (Batch  (None, 13, 32)      128         ['conv1d_350[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_350 (Activation)    (None, 13, 32)       0           ['batch_normalization_350[0][0]']
                                                                                                  
 spatial_dropout1d_175 (Spatial  (None, 13, 32)      0           ['activation_350[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_351 (Conv1D)            (None, 7, 32)        544         ['activation_349[0][0]']         
                                                                                                  
 max_pooling1d_175 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_175[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_351 (Batch  (None, 7, 32)       128         ['conv1d_351[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_175 (Add)                  (None, 7, 32)        0           ['max_pooling1d_175[0][0]',      
                                                                  'batch_normalization_351[0][0]']
                                                                                                  
 activation_351 (Activation)    (None, 7, 32)        0           ['add_175[0][0]']                
                                                                                                  
 conv1d_352 (Conv1D)            (None, 7, 64)        6208        ['activation_351[0][0]']         
                                                                                                  
 batch_normalization_352 (Batch  (None, 7, 64)       256         ['conv1d_352[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_352 (Activation)    (None, 7, 64)        0           ['batch_normalization_352[0][0]']
                                                                                                  
 spatial_dropout1d_176 (Spatial  (None, 7, 64)       0           ['activation_352[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_353 (Conv1D)            (None, 4, 64)        2112        ['activation_351[0][0]']         
                                                                                                  
 max_pooling1d_176 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_176[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_353 (Batch  (None, 4, 64)       256         ['conv1d_353[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_176 (Add)                  (None, 4, 64)        0           ['max_pooling1d_176[0][0]',      
                                                                  'batch_normalization_353[0][0]']
                                                                                                  
 activation_353 (Activation)    (None, 4, 64)        0           ['add_176[0][0]']                
                                                                                                  
 global_average_pooling1d_58 (G  (None, 64)          0           ['activation_353[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_58 (Globa  (None, 64)          0           ['activation_353[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_58 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_58[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_58[0][0]']
                                                                                                  
 dropout_116 (Dropout)          (None, 128)          0           ['concatenate_58[0][0]']         
                                                                                                  
 dense_58 (Dense)               (None, 64)           8256        ['dropout_116[0][0]']            
                                                                                                  
 dropout_117 (Dropout)          (None, 64)           0           ['dense_58[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_117[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_117[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 31,523
Trainable params: 31,075
Non-trainable params: 448
__________________________________________________________________________________________________
