Model: "model_50"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_26 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_300 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_26[0][0]'] 
                                                                                                  
 batch_normalization_300 (Batch  (None, 25, 16)      64          ['conv1d_300[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_300 (Activation)    (None, 25, 16)       0           ['batch_normalization_300[0][0]']
                                                                                                  
 spatial_dropout1d_150 (Spatial  (None, 25, 16)      0           ['activation_300[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_301 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_26[0][0]'] 
                                                                                                  
 max_pooling1d_150 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_150[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_301 (Batch  (None, 13, 16)      64          ['conv1d_301[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_150 (Add)                  (None, 13, 16)       0           ['max_pooling1d_150[0][0]',      
                                                                  'batch_normalization_301[0][0]']
                                                                                                  
 activation_301 (Activation)    (None, 13, 16)       0           ['add_150[0][0]']                
                                                                                                  
 conv1d_302 (Conv1D)            (None, 13, 32)       1568        ['activation_301[0][0]']         
                                                                                                  
 batch_normalization_302 (Batch  (None, 13, 32)      128         ['conv1d_302[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_302 (Activation)    (None, 13, 32)       0           ['batch_normalization_302[0][0]']
                                                                                                  
 spatial_dropout1d_151 (Spatial  (None, 13, 32)      0           ['activation_302[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_303 (Conv1D)            (None, 7, 32)        544         ['activation_301[0][0]']         
                                                                                                  
 max_pooling1d_151 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_151[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_303 (Batch  (None, 7, 32)       128         ['conv1d_303[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_151 (Add)                  (None, 7, 32)        0           ['max_pooling1d_151[0][0]',      
                                                                  'batch_normalization_303[0][0]']
                                                                                                  
 activation_303 (Activation)    (None, 7, 32)        0           ['add_151[0][0]']                
                                                                                                  
 conv1d_304 (Conv1D)            (None, 7, 64)        6208        ['activation_303[0][0]']         
                                                                                                  
 batch_normalization_304 (Batch  (None, 7, 64)       256         ['conv1d_304[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_304 (Activation)    (None, 7, 64)        0           ['batch_normalization_304[0][0]']
                                                                                                  
 spatial_dropout1d_152 (Spatial  (None, 7, 64)       0           ['activation_304[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_305 (Conv1D)            (None, 4, 64)        2112        ['activation_303[0][0]']         
                                                                                                  
 max_pooling1d_152 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_152[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_305 (Batch  (None, 4, 64)       256         ['conv1d_305[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_152 (Add)                  (None, 4, 64)        0           ['max_pooling1d_152[0][0]',      
                                                                  'batch_normalization_305[0][0]']
                                                                                                  
 activation_305 (Activation)    (None, 4, 64)        0           ['add_152[0][0]']                
                                                                                                  
 global_average_pooling1d_50 (G  (None, 64)          0           ['activation_305[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_50 (Globa  (None, 64)          0           ['activation_305[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_50 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_50[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_50[0][0]']
                                                                                                  
 dropout_100 (Dropout)          (None, 128)          0           ['concatenate_50[0][0]']         
                                                                                                  
 dense_50 (Dense)               (None, 64)           8256        ['dropout_100[0][0]']            
                                                                                                  
 dropout_101 (Dropout)          (None, 64)           0           ['dense_50[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_101[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_101[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 23,715
Trainable params: 23,267
Non-trainable params: 448
__________________________________________________________________________________________________
