Model: "model_94"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_46 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_564 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_46[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_564 (Batch  (None, 25, 48)      192         ['conv1d_564[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_564 (Activation)    (None, 25, 48)       0           ['batch_normalization_564[0][0]']
                                                                                                  
 spatial_dropout1d_282 (Spatial  (None, 25, 48)      0           ['activation_564[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_565 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_46[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_282 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_282[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_565 (Batch  (None, 13, 48)      192         ['conv1d_565[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_282 (Add)                  (None, 13, 48)       0           ['max_pooling1d_282[0][0]',      
                                                                  'batch_normalization_565[0][0]']
                                                                                                  
 activation_565 (Activation)    (None, 13, 48)       0           ['add_282[0][0]']                
                                                                                                  
 conv1d_566 (Conv1D)            (None, 13, 96)       13920       ['activation_565[0][0]']         
                                                                                                  
 batch_normalization_566 (Batch  (None, 13, 96)      384         ['conv1d_566[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_566 (Activation)    (None, 13, 96)       0           ['batch_normalization_566[0][0]']
                                                                                                  
 spatial_dropout1d_283 (Spatial  (None, 13, 96)      0           ['activation_566[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_567 (Conv1D)            (None, 7, 96)        4704        ['activation_565[0][0]']         
                                                                                                  
 max_pooling1d_283 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_283[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_567 (Batch  (None, 7, 96)       384         ['conv1d_567[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_283 (Add)                  (None, 7, 96)        0           ['max_pooling1d_283[0][0]',      
                                                                  'batch_normalization_567[0][0]']
                                                                                                  
 activation_567 (Activation)    (None, 7, 96)        0           ['add_283[0][0]']                
                                                                                                  
 conv1d_568 (Conv1D)            (None, 7, 192)       55488       ['activation_567[0][0]']         
                                                                                                  
 batch_normalization_568 (Batch  (None, 7, 192)      768         ['conv1d_568[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_568 (Activation)    (None, 7, 192)       0           ['batch_normalization_568[0][0]']
                                                                                                  
 spatial_dropout1d_284 (Spatial  (None, 7, 192)      0           ['activation_568[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_569 (Conv1D)            (None, 4, 192)       18624       ['activation_567[0][0]']         
                                                                                                  
 max_pooling1d_284 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_284[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_569 (Batch  (None, 4, 192)      768         ['conv1d_569[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_284 (Add)                  (None, 4, 192)       0           ['max_pooling1d_284[0][0]',      
                                                                  'batch_normalization_569[0][0]']
                                                                                                  
 activation_569 (Activation)    (None, 4, 192)       0           ['add_284[0][0]']                
                                                                                                  
 global_average_pooling1d_94 (G  (None, 192)         0           ['activation_569[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_94 (Globa  (None, 192)         0           ['activation_569[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_94 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_94[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_94[0][0]']
                                                                                                  
 dropout_188 (Dropout)          (None, 384)          0           ['concatenate_94[0][0]']         
                                                                                                  
 dense_94 (Dense)               (None, 128)          49280       ['dropout_188[0][0]']            
                                                                                                  
 dropout_189 (Dropout)          (None, 128)          0           ['dense_94[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_189[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_189[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 180,323
Trainable params: 178,979
Non-trainable params: 1,344
__________________________________________________________________________________________________
