Model: "model_107"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_53 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_642 (Conv1D)            (None, 25, 16)       13264       ['enhanced_preprocessing_53[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_642 (Batch  (None, 25, 16)      64          ['conv1d_642[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_642 (Activation)    (None, 25, 16)       0           ['batch_normalization_642[0][0]']
                                                                                                  
 spatial_dropout1d_321 (Spatial  (None, 25, 16)      0           ['activation_642[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_643 (Conv1D)            (None, 13, 16)       4432        ['enhanced_preprocessing_53[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_321 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_321[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_643 (Batch  (None, 13, 16)      64          ['conv1d_643[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_321 (Add)                  (None, 13, 16)       0           ['max_pooling1d_321[0][0]',      
                                                                  'batch_normalization_643[0][0]']
                                                                                                  
 activation_643 (Activation)    (None, 13, 16)       0           ['add_321[0][0]']                
                                                                                                  
 conv1d_644 (Conv1D)            (None, 13, 32)       1568        ['activation_643[0][0]']         
                                                                                                  
 batch_normalization_644 (Batch  (None, 13, 32)      128         ['conv1d_644[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_644 (Activation)    (None, 13, 32)       0           ['batch_normalization_644[0][0]']
                                                                                                  
 spatial_dropout1d_322 (Spatial  (None, 13, 32)      0           ['activation_644[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_645 (Conv1D)            (None, 7, 32)        544         ['activation_643[0][0]']         
                                                                                                  
 max_pooling1d_322 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_322[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_645 (Batch  (None, 7, 32)       128         ['conv1d_645[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_322 (Add)                  (None, 7, 32)        0           ['max_pooling1d_322[0][0]',      
                                                                  'batch_normalization_645[0][0]']
                                                                                                  
 activation_645 (Activation)    (None, 7, 32)        0           ['add_322[0][0]']                
                                                                                                  
 conv1d_646 (Conv1D)            (None, 7, 64)        6208        ['activation_645[0][0]']         
                                                                                                  
 batch_normalization_646 (Batch  (None, 7, 64)       256         ['conv1d_646[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_646 (Activation)    (None, 7, 64)        0           ['batch_normalization_646[0][0]']
                                                                                                  
 spatial_dropout1d_323 (Spatial  (None, 7, 64)       0           ['activation_646[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_647 (Conv1D)            (None, 4, 64)        2112        ['activation_645[0][0]']         
                                                                                                  
 max_pooling1d_323 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_323[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_647 (Batch  (None, 4, 64)       256         ['conv1d_647[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_323 (Add)                  (None, 4, 64)        0           ['max_pooling1d_323[0][0]',      
                                                                  'batch_normalization_647[0][0]']
                                                                                                  
 activation_647 (Activation)    (None, 4, 64)        0           ['add_323[0][0]']                
                                                                                                  
 global_average_pooling1d_107 (  (None, 64)          0           ['activation_647[0][0]']         
 GlobalAveragePooling1D)                                                                          
                                                                                                  
 global_max_pooling1d_107 (Glob  (None, 64)          0           ['activation_647[0][0]']         
 alMaxPooling1D)                                                                                  
                                                                                                  
 concatenate_107 (Concatenate)  (None, 128)          0           ['global_average_pooling1d_107[0]
                                                                 [0]',                            
                                                                  'global_max_pooling1d_107[0][0]'
                                                                 ]                                
                                                                                                  
 dropout_214 (Dropout)          (None, 128)          0           ['concatenate_107[0][0]']        
                                                                                                  
 dense_107 (Dense)              (None, 64)           8256        ['dropout_214[0][0]']            
                                                                                                  
 dropout_215 (Dropout)          (None, 64)           0           ['dense_107[0][0]']              
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_215[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_215[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 37,475
Trainable params: 37,027
Non-trainable params: 448
__________________________________________________________________________________________________
