Model: "model_44"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_23 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_264 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_23[0][0]'] 
                                                                                                  
 batch_normalization_264 (Batch  (None, 25, 48)      192         ['conv1d_264[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_264 (Activation)    (None, 25, 48)       0           ['batch_normalization_264[0][0]']
                                                                                                  
 spatial_dropout1d_132 (Spatial  (None, 25, 48)      0           ['activation_264[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_265 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_23[0][0]'] 
                                                                                                  
 max_pooling1d_132 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_132[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_265 (Batch  (None, 13, 48)      192         ['conv1d_265[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_132 (Add)                  (None, 13, 48)       0           ['max_pooling1d_132[0][0]',      
                                                                  'batch_normalization_265[0][0]']
                                                                                                  
 activation_265 (Activation)    (None, 13, 48)       0           ['add_132[0][0]']                
                                                                                                  
 conv1d_266 (Conv1D)            (None, 13, 96)       13920       ['activation_265[0][0]']         
                                                                                                  
 batch_normalization_266 (Batch  (None, 13, 96)      384         ['conv1d_266[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_266 (Activation)    (None, 13, 96)       0           ['batch_normalization_266[0][0]']
                                                                                                  
 spatial_dropout1d_133 (Spatial  (None, 13, 96)      0           ['activation_266[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_267 (Conv1D)            (None, 7, 96)        4704        ['activation_265[0][0]']         
                                                                                                  
 max_pooling1d_133 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_133[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_267 (Batch  (None, 7, 96)       384         ['conv1d_267[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_133 (Add)                  (None, 7, 96)        0           ['max_pooling1d_133[0][0]',      
                                                                  'batch_normalization_267[0][0]']
                                                                                                  
 activation_267 (Activation)    (None, 7, 96)        0           ['add_133[0][0]']                
                                                                                                  
 conv1d_268 (Conv1D)            (None, 7, 192)       55488       ['activation_267[0][0]']         
                                                                                                  
 batch_normalization_268 (Batch  (None, 7, 192)      768         ['conv1d_268[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_268 (Activation)    (None, 7, 192)       0           ['batch_normalization_268[0][0]']
                                                                                                  
 spatial_dropout1d_134 (Spatial  (None, 7, 192)      0           ['activation_268[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_269 (Conv1D)            (None, 4, 192)       18624       ['activation_267[0][0]']         
                                                                                                  
 max_pooling1d_134 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_134[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_269 (Batch  (None, 4, 192)      768         ['conv1d_269[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_134 (Add)                  (None, 4, 192)       0           ['max_pooling1d_134[0][0]',      
                                                                  'batch_normalization_269[0][0]']
                                                                                                  
 activation_269 (Activation)    (None, 4, 192)       0           ['add_134[0][0]']                
                                                                                                  
 global_average_pooling1d_44 (G  (None, 192)         0           ['activation_269[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_44 (Globa  (None, 192)         0           ['activation_269[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_44 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_44[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_44[0][0]']
                                                                                                  
 dropout_88 (Dropout)           (None, 384)          0           ['concatenate_44[0][0]']         
                                                                                                  
 dense_44 (Dense)               (None, 128)          49280       ['dropout_88[0][0]']             
                                                                                                  
 dropout_89 (Dropout)           (None, 128)          0           ['dense_44[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_89[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_89[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 153,059
Trainable params: 151,715
Non-trainable params: 1,344
__________________________________________________________________________________________________
