Model: "model_17"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_8 (Enha  (None, 25, 123)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_102 (Conv1D)            (None, 25, 16)       5920        ['enhanced_preprocessing_8[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_102 (Batch  (None, 25, 16)      64          ['conv1d_102[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_102 (Activation)    (None, 25, 16)       0           ['batch_normalization_102[0][0]']
                                                                                                  
 spatial_dropout1d_51 (SpatialD  (None, 25, 16)      0           ['activation_102[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_103 (Conv1D)            (None, 13, 16)       1984        ['enhanced_preprocessing_8[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_51 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_51[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_103 (Batch  (None, 13, 16)      64          ['conv1d_103[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_51 (Add)                   (None, 13, 16)       0           ['max_pooling1d_51[0][0]',       
                                                                  'batch_normalization_103[0][0]']
                                                                                                  
 activation_103 (Activation)    (None, 13, 16)       0           ['add_51[0][0]']                 
                                                                                                  
 conv1d_104 (Conv1D)            (None, 13, 32)       1568        ['activation_103[0][0]']         
                                                                                                  
 batch_normalization_104 (Batch  (None, 13, 32)      128         ['conv1d_104[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_104 (Activation)    (None, 13, 32)       0           ['batch_normalization_104[0][0]']
                                                                                                  
 spatial_dropout1d_52 (SpatialD  (None, 13, 32)      0           ['activation_104[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_105 (Conv1D)            (None, 7, 32)        544         ['activation_103[0][0]']         
                                                                                                  
 max_pooling1d_52 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_52[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_105 (Batch  (None, 7, 32)       128         ['conv1d_105[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_52 (Add)                   (None, 7, 32)        0           ['max_pooling1d_52[0][0]',       
                                                                  'batch_normalization_105[0][0]']
                                                                                                  
 activation_105 (Activation)    (None, 7, 32)        0           ['add_52[0][0]']                 
                                                                                                  
 conv1d_106 (Conv1D)            (None, 7, 64)        6208        ['activation_105[0][0]']         
                                                                                                  
 batch_normalization_106 (Batch  (None, 7, 64)       256         ['conv1d_106[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_106 (Activation)    (None, 7, 64)        0           ['batch_normalization_106[0][0]']
                                                                                                  
 spatial_dropout1d_53 (SpatialD  (None, 7, 64)       0           ['activation_106[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_107 (Conv1D)            (None, 4, 64)        2112        ['activation_105[0][0]']         
                                                                                                  
 max_pooling1d_53 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_53[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_107 (Batch  (None, 4, 64)       256         ['conv1d_107[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_53 (Add)                   (None, 4, 64)        0           ['max_pooling1d_53[0][0]',       
                                                                  'batch_normalization_107[0][0]']
                                                                                                  
 activation_107 (Activation)    (None, 4, 64)        0           ['add_53[0][0]']                 
                                                                                                  
 global_average_pooling1d_17 (G  (None, 64)          0           ['activation_107[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_17 (Globa  (None, 64)          0           ['activation_107[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_17 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_17[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_17[0][0]']
                                                                                                  
 dropout_34 (Dropout)           (None, 128)          0           ['concatenate_17[0][0]']         
                                                                                                  
 dense_17 (Dense)               (None, 128)          16512       ['dropout_34[0][0]']             
                                                                                                  
 dropout_35 (Dropout)           (None, 128)          0           ['dense_17[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_35[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_35[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 36,131
Trainable params: 35,683
Non-trainable params: 448
__________________________________________________________________________________________________
