Model: "model_11"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_5 (Enha  (None, 25, 123)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_66 (Conv1D)             (None, 25, 16)       5920        ['enhanced_preprocessing_5[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_66 (BatchN  (None, 25, 16)      64          ['conv1d_66[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_66 (Activation)     (None, 25, 16)       0           ['batch_normalization_66[0][0]'] 
                                                                                                  
 spatial_dropout1d_33 (SpatialD  (None, 25, 16)      0           ['activation_66[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_67 (Conv1D)             (None, 13, 16)       1984        ['enhanced_preprocessing_5[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_33 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_33[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_67 (BatchN  (None, 13, 16)      64          ['conv1d_67[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_33 (Add)                   (None, 13, 16)       0           ['max_pooling1d_33[0][0]',       
                                                                  'batch_normalization_67[0][0]'] 
                                                                                                  
 activation_67 (Activation)     (None, 13, 16)       0           ['add_33[0][0]']                 
                                                                                                  
 conv1d_68 (Conv1D)             (None, 13, 32)       1568        ['activation_67[0][0]']          
                                                                                                  
 batch_normalization_68 (BatchN  (None, 13, 32)      128         ['conv1d_68[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_68 (Activation)     (None, 13, 32)       0           ['batch_normalization_68[0][0]'] 
                                                                                                  
 spatial_dropout1d_34 (SpatialD  (None, 13, 32)      0           ['activation_68[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_69 (Conv1D)             (None, 7, 32)        544         ['activation_67[0][0]']          
                                                                                                  
 max_pooling1d_34 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_34[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_69 (BatchN  (None, 7, 32)       128         ['conv1d_69[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_34 (Add)                   (None, 7, 32)        0           ['max_pooling1d_34[0][0]',       
                                                                  'batch_normalization_69[0][0]'] 
                                                                                                  
 activation_69 (Activation)     (None, 7, 32)        0           ['add_34[0][0]']                 
                                                                                                  
 conv1d_70 (Conv1D)             (None, 7, 64)        6208        ['activation_69[0][0]']          
                                                                                                  
 batch_normalization_70 (BatchN  (None, 7, 64)       256         ['conv1d_70[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_70 (Activation)     (None, 7, 64)        0           ['batch_normalization_70[0][0]'] 
                                                                                                  
 spatial_dropout1d_35 (SpatialD  (None, 7, 64)       0           ['activation_70[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_71 (Conv1D)             (None, 4, 64)        2112        ['activation_69[0][0]']          
                                                                                                  
 max_pooling1d_35 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_35[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_71 (BatchN  (None, 4, 64)       256         ['conv1d_71[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_35 (Add)                   (None, 4, 64)        0           ['max_pooling1d_35[0][0]',       
                                                                  'batch_normalization_71[0][0]'] 
                                                                                                  
 activation_71 (Activation)     (None, 4, 64)        0           ['add_35[0][0]']                 
                                                                                                  
 global_average_pooling1d_11 (G  (None, 64)          0           ['activation_71[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_11 (Globa  (None, 64)          0           ['activation_71[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_11 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_11[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_11[0][0]']
                                                                                                  
 dropout_22 (Dropout)           (None, 128)          0           ['concatenate_11[0][0]']         
                                                                                                  
 dense_11 (Dense)               (None, 64)           8256        ['dropout_22[0][0]']             
                                                                                                  
 dropout_23 (Dropout)           (None, 64)           0           ['dense_11[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_23[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_23[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 27,683
Trainable params: 27,235
Non-trainable params: 448
__________________________________________________________________________________________________
