Model: "model_59"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_29 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_354 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_29[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_354 (Batch  (None, 25, 16)      64          ['conv1d_354[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_354 (Activation)    (None, 25, 16)       0           ['batch_normalization_354[0][0]']
                                                                                                  
 spatial_dropout1d_177 (Spatial  (None, 25, 16)      0           ['activation_354[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_355 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_29[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_177 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_177[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_355 (Batch  (None, 13, 16)      64          ['conv1d_355[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_177 (Add)                  (None, 13, 16)       0           ['max_pooling1d_177[0][0]',      
                                                                  'batch_normalization_355[0][0]']
                                                                                                  
 activation_355 (Activation)    (None, 13, 16)       0           ['add_177[0][0]']                
                                                                                                  
 conv1d_356 (Conv1D)            (None, 13, 32)       1568        ['activation_355[0][0]']         
                                                                                                  
 batch_normalization_356 (Batch  (None, 13, 32)      128         ['conv1d_356[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_356 (Activation)    (None, 13, 32)       0           ['batch_normalization_356[0][0]']
                                                                                                  
 spatial_dropout1d_178 (Spatial  (None, 13, 32)      0           ['activation_356[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_357 (Conv1D)            (None, 7, 32)        544         ['activation_355[0][0]']         
                                                                                                  
 max_pooling1d_178 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_178[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_357 (Batch  (None, 7, 32)       128         ['conv1d_357[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_178 (Add)                  (None, 7, 32)        0           ['max_pooling1d_178[0][0]',      
                                                                  'batch_normalization_357[0][0]']
                                                                                                  
 activation_357 (Activation)    (None, 7, 32)        0           ['add_178[0][0]']                
                                                                                                  
 conv1d_358 (Conv1D)            (None, 7, 64)        6208        ['activation_357[0][0]']         
                                                                                                  
 batch_normalization_358 (Batch  (None, 7, 64)       256         ['conv1d_358[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_358 (Activation)    (None, 7, 64)        0           ['batch_normalization_358[0][0]']
                                                                                                  
 spatial_dropout1d_179 (Spatial  (None, 7, 64)       0           ['activation_358[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_359 (Conv1D)            (None, 4, 64)        2112        ['activation_357[0][0]']         
                                                                                                  
 max_pooling1d_179 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_179[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_359 (Batch  (None, 4, 64)       256         ['conv1d_359[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_179 (Add)                  (None, 4, 64)        0           ['max_pooling1d_179[0][0]',      
                                                                  'batch_normalization_359[0][0]']
                                                                                                  
 activation_359 (Activation)    (None, 4, 64)        0           ['add_179[0][0]']                
                                                                                                  
 global_average_pooling1d_59 (G  (None, 64)          0           ['activation_359[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_59 (Globa  (None, 64)          0           ['activation_359[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_59 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_59[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_59[0][0]']
                                                                                                  
 dropout_118 (Dropout)          (None, 128)          0           ['concatenate_59[0][0]']         
                                                                                                  
 dense_59 (Dense)               (None, 64)           8256        ['dropout_118[0][0]']            
                                                                                                  
 dropout_119 (Dropout)          (None, 64)           0           ['dense_59[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_119[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_119[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 31,523
Trainable params: 31,075
Non-trainable params: 448
__________________________________________________________________________________________________
