Model: "model_77"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_38 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_462 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_38[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_462 (Batch  (None, 25, 48)      192         ['conv1d_462[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_462 (Activation)    (None, 25, 48)       0           ['batch_normalization_462[0][0]']
                                                                                                  
 spatial_dropout1d_231 (Spatial  (None, 25, 48)      0           ['activation_462[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_463 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_38[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_231 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_231[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_463 (Batch  (None, 13, 48)      192         ['conv1d_463[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_231 (Add)                  (None, 13, 48)       0           ['max_pooling1d_231[0][0]',      
                                                                  'batch_normalization_463[0][0]']
                                                                                                  
 activation_463 (Activation)    (None, 13, 48)       0           ['add_231[0][0]']                
                                                                                                  
 conv1d_464 (Conv1D)            (None, 13, 96)       13920       ['activation_463[0][0]']         
                                                                                                  
 batch_normalization_464 (Batch  (None, 13, 96)      384         ['conv1d_464[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_464 (Activation)    (None, 13, 96)       0           ['batch_normalization_464[0][0]']
                                                                                                  
 spatial_dropout1d_232 (Spatial  (None, 13, 96)      0           ['activation_464[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_465 (Conv1D)            (None, 7, 96)        4704        ['activation_463[0][0]']         
                                                                                                  
 max_pooling1d_232 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_232[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_465 (Batch  (None, 7, 96)       384         ['conv1d_465[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_232 (Add)                  (None, 7, 96)        0           ['max_pooling1d_232[0][0]',      
                                                                  'batch_normalization_465[0][0]']
                                                                                                  
 activation_465 (Activation)    (None, 7, 96)        0           ['add_232[0][0]']                
                                                                                                  
 conv1d_466 (Conv1D)            (None, 7, 192)       55488       ['activation_465[0][0]']         
                                                                                                  
 batch_normalization_466 (Batch  (None, 7, 192)      768         ['conv1d_466[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_466 (Activation)    (None, 7, 192)       0           ['batch_normalization_466[0][0]']
                                                                                                  
 spatial_dropout1d_233 (Spatial  (None, 7, 192)      0           ['activation_466[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_467 (Conv1D)            (None, 4, 192)       18624       ['activation_465[0][0]']         
                                                                                                  
 max_pooling1d_233 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_233[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_467 (Batch  (None, 4, 192)      768         ['conv1d_467[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_233 (Add)                  (None, 4, 192)       0           ['max_pooling1d_233[0][0]',      
                                                                  'batch_normalization_467[0][0]']
                                                                                                  
 activation_467 (Activation)    (None, 4, 192)       0           ['add_233[0][0]']                
                                                                                                  
 global_average_pooling1d_77 (G  (None, 192)         0           ['activation_467[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_77 (Globa  (None, 192)         0           ['activation_467[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_77 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_77[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_77[0][0]']
                                                                                                  
 dropout_154 (Dropout)          (None, 384)          0           ['concatenate_77[0][0]']         
                                                                                                  
 dense_77 (Dense)               (None, 64)           24640       ['dropout_154[0][0]']            
                                                                                                  
 dropout_155 (Dropout)          (None, 64)           0           ['dense_77[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_155[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_155[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 155,491
Trainable params: 154,147
Non-trainable params: 1,344
__________________________________________________________________________________________________
