Model: "model_20"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_11 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_120 (Conv1D)            (None, 25, 48)       13296       ['basic_preprocessing_11[0][0]'] 
                                                                                                  
 batch_normalization_120 (Batch  (None, 25, 48)      192         ['conv1d_120[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_120 (Activation)    (None, 25, 48)       0           ['batch_normalization_120[0][0]']
                                                                                                  
 spatial_dropout1d_60 (SpatialD  (None, 25, 48)      0           ['activation_120[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_121 (Conv1D)            (None, 13, 48)       4464        ['basic_preprocessing_11[0][0]'] 
                                                                                                  
 max_pooling1d_60 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_60[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_121 (Batch  (None, 13, 48)      192         ['conv1d_121[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_60 (Add)                   (None, 13, 48)       0           ['max_pooling1d_60[0][0]',       
                                                                  'batch_normalization_121[0][0]']
                                                                                                  
 activation_121 (Activation)    (None, 13, 48)       0           ['add_60[0][0]']                 
                                                                                                  
 conv1d_122 (Conv1D)            (None, 13, 96)       13920       ['activation_121[0][0]']         
                                                                                                  
 batch_normalization_122 (Batch  (None, 13, 96)      384         ['conv1d_122[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_122 (Activation)    (None, 13, 96)       0           ['batch_normalization_122[0][0]']
                                                                                                  
 spatial_dropout1d_61 (SpatialD  (None, 13, 96)      0           ['activation_122[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_123 (Conv1D)            (None, 7, 96)        4704        ['activation_121[0][0]']         
                                                                                                  
 max_pooling1d_61 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_61[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_123 (Batch  (None, 7, 96)       384         ['conv1d_123[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_61 (Add)                   (None, 7, 96)        0           ['max_pooling1d_61[0][0]',       
                                                                  'batch_normalization_123[0][0]']
                                                                                                  
 activation_123 (Activation)    (None, 7, 96)        0           ['add_61[0][0]']                 
                                                                                                  
 conv1d_124 (Conv1D)            (None, 7, 192)       55488       ['activation_123[0][0]']         
                                                                                                  
 batch_normalization_124 (Batch  (None, 7, 192)      768         ['conv1d_124[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_124 (Activation)    (None, 7, 192)       0           ['batch_normalization_124[0][0]']
                                                                                                  
 spatial_dropout1d_62 (SpatialD  (None, 7, 192)      0           ['activation_124[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_125 (Conv1D)            (None, 4, 192)       18624       ['activation_123[0][0]']         
                                                                                                  
 max_pooling1d_62 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_62[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_125 (Batch  (None, 4, 192)      768         ['conv1d_125[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_62 (Add)                   (None, 4, 192)       0           ['max_pooling1d_62[0][0]',       
                                                                  'batch_normalization_125[0][0]']
                                                                                                  
 activation_125 (Activation)    (None, 4, 192)       0           ['add_62[0][0]']                 
                                                                                                  
 global_average_pooling1d_20 (G  (None, 192)         0           ['activation_125[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_20 (Globa  (None, 192)         0           ['activation_125[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_20 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_20[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_20[0][0]']
                                                                                                  
 dropout_40 (Dropout)           (None, 384)          0           ['concatenate_20[0][0]']         
                                                                                                  
 dense_20 (Dense)               (None, 64)           24640       ['dropout_40[0][0]']             
                                                                                                  
 dropout_41 (Dropout)           (None, 64)           0           ['dense_20[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_41[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_41[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 138,019
Trainable params: 136,675
Non-trainable params: 1,344
__________________________________________________________________________________________________
