Model: "model_47"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_23 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_282 (Conv1D)            (None, 25, 48)       17760       ['enhanced_preprocessing_23[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_282 (Batch  (None, 25, 48)      192         ['conv1d_282[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_282 (Activation)    (None, 25, 48)       0           ['batch_normalization_282[0][0]']
                                                                                                  
 spatial_dropout1d_141 (Spatial  (None, 25, 48)      0           ['activation_282[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_283 (Conv1D)            (None, 13, 48)       5952        ['enhanced_preprocessing_23[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_141 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_141[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_283 (Batch  (None, 13, 48)      192         ['conv1d_283[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_141 (Add)                  (None, 13, 48)       0           ['max_pooling1d_141[0][0]',      
                                                                  'batch_normalization_283[0][0]']
                                                                                                  
 activation_283 (Activation)    (None, 13, 48)       0           ['add_141[0][0]']                
                                                                                                  
 conv1d_284 (Conv1D)            (None, 13, 96)       13920       ['activation_283[0][0]']         
                                                                                                  
 batch_normalization_284 (Batch  (None, 13, 96)      384         ['conv1d_284[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_284 (Activation)    (None, 13, 96)       0           ['batch_normalization_284[0][0]']
                                                                                                  
 spatial_dropout1d_142 (Spatial  (None, 13, 96)      0           ['activation_284[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_285 (Conv1D)            (None, 7, 96)        4704        ['activation_283[0][0]']         
                                                                                                  
 max_pooling1d_142 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_142[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_285 (Batch  (None, 7, 96)       384         ['conv1d_285[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_142 (Add)                  (None, 7, 96)        0           ['max_pooling1d_142[0][0]',      
                                                                  'batch_normalization_285[0][0]']
                                                                                                  
 activation_285 (Activation)    (None, 7, 96)        0           ['add_142[0][0]']                
                                                                                                  
 conv1d_286 (Conv1D)            (None, 7, 192)       55488       ['activation_285[0][0]']         
                                                                                                  
 batch_normalization_286 (Batch  (None, 7, 192)      768         ['conv1d_286[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_286 (Activation)    (None, 7, 192)       0           ['batch_normalization_286[0][0]']
                                                                                                  
 spatial_dropout1d_143 (Spatial  (None, 7, 192)      0           ['activation_286[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_287 (Conv1D)            (None, 4, 192)       18624       ['activation_285[0][0]']         
                                                                                                  
 max_pooling1d_143 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_143[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_287 (Batch  (None, 4, 192)      768         ['conv1d_287[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_143 (Add)                  (None, 4, 192)       0           ['max_pooling1d_143[0][0]',      
                                                                  'batch_normalization_287[0][0]']
                                                                                                  
 activation_287 (Activation)    (None, 4, 192)       0           ['add_143[0][0]']                
                                                                                                  
 global_average_pooling1d_47 (G  (None, 192)         0           ['activation_287[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_47 (Globa  (None, 192)         0           ['activation_287[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_47 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_47[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_47[0][0]']
                                                                                                  
 dropout_94 (Dropout)           (None, 384)          0           ['concatenate_47[0][0]']         
                                                                                                  
 dense_47 (Dense)               (None, 128)          49280       ['dropout_94[0][0]']             
                                                                                                  
 dropout_95 (Dropout)           (None, 128)          0           ['dense_47[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_95[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_95[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 168,803
Trainable params: 167,459
Non-trainable params: 1,344
__________________________________________________________________________________________________
