Model: "model_97"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_49 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_582 (Conv1D)            (None, 25, 16)       4432        ['basic_preprocessing_49[0][0]'] 
                                                                                                  
 batch_normalization_582 (Batch  (None, 25, 16)      64          ['conv1d_582[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_582 (Activation)    (None, 25, 16)       0           ['batch_normalization_582[0][0]']
                                                                                                  
 spatial_dropout1d_291 (Spatial  (None, 25, 16)      0           ['activation_582[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_583 (Conv1D)            (None, 13, 16)       1488        ['basic_preprocessing_49[0][0]'] 
                                                                                                  
 max_pooling1d_291 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_291[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_583 (Batch  (None, 13, 16)      64          ['conv1d_583[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_291 (Add)                  (None, 13, 16)       0           ['max_pooling1d_291[0][0]',      
                                                                  'batch_normalization_583[0][0]']
                                                                                                  
 activation_583 (Activation)    (None, 13, 16)       0           ['add_291[0][0]']                
                                                                                                  
 conv1d_584 (Conv1D)            (None, 13, 32)       1568        ['activation_583[0][0]']         
                                                                                                  
 batch_normalization_584 (Batch  (None, 13, 32)      128         ['conv1d_584[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_584 (Activation)    (None, 13, 32)       0           ['batch_normalization_584[0][0]']
                                                                                                  
 spatial_dropout1d_292 (Spatial  (None, 13, 32)      0           ['activation_584[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_585 (Conv1D)            (None, 7, 32)        544         ['activation_583[0][0]']         
                                                                                                  
 max_pooling1d_292 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_292[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_585 (Batch  (None, 7, 32)       128         ['conv1d_585[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_292 (Add)                  (None, 7, 32)        0           ['max_pooling1d_292[0][0]',      
                                                                  'batch_normalization_585[0][0]']
                                                                                                  
 activation_585 (Activation)    (None, 7, 32)        0           ['add_292[0][0]']                
                                                                                                  
 conv1d_586 (Conv1D)            (None, 7, 64)        6208        ['activation_585[0][0]']         
                                                                                                  
 batch_normalization_586 (Batch  (None, 7, 64)       256         ['conv1d_586[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_586 (Activation)    (None, 7, 64)        0           ['batch_normalization_586[0][0]']
                                                                                                  
 spatial_dropout1d_293 (Spatial  (None, 7, 64)       0           ['activation_586[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_587 (Conv1D)            (None, 4, 64)        2112        ['activation_585[0][0]']         
                                                                                                  
 max_pooling1d_293 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_293[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_587 (Batch  (None, 4, 64)       256         ['conv1d_587[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_293 (Add)                  (None, 4, 64)        0           ['max_pooling1d_293[0][0]',      
                                                                  'batch_normalization_587[0][0]']
                                                                                                  
 activation_587 (Activation)    (None, 4, 64)        0           ['add_293[0][0]']                
                                                                                                  
 global_average_pooling1d_97 (G  (None, 64)          0           ['activation_587[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_97 (Globa  (None, 64)          0           ['activation_587[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_97 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_97[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_97[0][0]']
                                                                                                  
 dropout_194 (Dropout)          (None, 128)          0           ['concatenate_97[0][0]']         
                                                                                                  
 dense_97 (Dense)               (None, 64)           8256        ['dropout_194[0][0]']            
                                                                                                  
 dropout_195 (Dropout)          (None, 64)           0           ['dense_97[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_195[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_195[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 25,699
Trainable params: 25,251
Non-trainable params: 448
__________________________________________________________________________________________________
