Model: "model_80"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_41 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_480 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_41[0][0]'] 
                                                                                                  
 batch_normalization_480 (Batch  (None, 25, 48)      192         ['conv1d_480[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_480 (Activation)    (None, 25, 48)       0           ['batch_normalization_480[0][0]']
                                                                                                  
 spatial_dropout1d_240 (Spatial  (None, 25, 48)      0           ['activation_480[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_481 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_41[0][0]'] 
                                                                                                  
 max_pooling1d_240 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_240[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_481 (Batch  (None, 13, 48)      192         ['conv1d_481[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_240 (Add)                  (None, 13, 48)       0           ['max_pooling1d_240[0][0]',      
                                                                  'batch_normalization_481[0][0]']
                                                                                                  
 activation_481 (Activation)    (None, 13, 48)       0           ['add_240[0][0]']                
                                                                                                  
 conv1d_482 (Conv1D)            (None, 13, 96)       13920       ['activation_481[0][0]']         
                                                                                                  
 batch_normalization_482 (Batch  (None, 13, 96)      384         ['conv1d_482[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_482 (Activation)    (None, 13, 96)       0           ['batch_normalization_482[0][0]']
                                                                                                  
 spatial_dropout1d_241 (Spatial  (None, 13, 96)      0           ['activation_482[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_483 (Conv1D)            (None, 7, 96)        4704        ['activation_481[0][0]']         
                                                                                                  
 max_pooling1d_241 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_241[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_483 (Batch  (None, 7, 96)       384         ['conv1d_483[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_241 (Add)                  (None, 7, 96)        0           ['max_pooling1d_241[0][0]',      
                                                                  'batch_normalization_483[0][0]']
                                                                                                  
 activation_483 (Activation)    (None, 7, 96)        0           ['add_241[0][0]']                
                                                                                                  
 conv1d_484 (Conv1D)            (None, 7, 192)       55488       ['activation_483[0][0]']         
                                                                                                  
 batch_normalization_484 (Batch  (None, 7, 192)      768         ['conv1d_484[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_484 (Activation)    (None, 7, 192)       0           ['batch_normalization_484[0][0]']
                                                                                                  
 spatial_dropout1d_242 (Spatial  (None, 7, 192)      0           ['activation_484[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_485 (Conv1D)            (None, 4, 192)       18624       ['activation_483[0][0]']         
                                                                                                  
 max_pooling1d_242 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_242[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_485 (Batch  (None, 4, 192)      768         ['conv1d_485[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_242 (Add)                  (None, 4, 192)       0           ['max_pooling1d_242[0][0]',      
                                                                  'batch_normalization_485[0][0]']
                                                                                                  
 activation_485 (Activation)    (None, 4, 192)       0           ['add_242[0][0]']                
                                                                                                  
 global_average_pooling1d_80 (G  (None, 192)         0           ['activation_485[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_80 (Globa  (None, 192)         0           ['activation_485[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_80 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_80[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_80[0][0]']
                                                                                                  
 dropout_160 (Dropout)          (None, 384)          0           ['concatenate_80[0][0]']         
                                                                                                  
 dense_80 (Dense)               (None, 64)           24640       ['dropout_160[0][0]']            
                                                                                                  
 dropout_161 (Dropout)          (None, 64)           0           ['dense_80[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_161[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_161[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 132,067
Trainable params: 130,723
Non-trainable params: 1,344
__________________________________________________________________________________________________
