Model: "model_95"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_47 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_570 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_47[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_570 (Batch  (None, 25, 48)      192         ['conv1d_570[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_570 (Activation)    (None, 25, 48)       0           ['batch_normalization_570[0][0]']
                                                                                                  
 spatial_dropout1d_285 (Spatial  (None, 25, 48)      0           ['activation_570[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_571 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_47[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_285 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_285[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_571 (Batch  (None, 13, 48)      192         ['conv1d_571[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_285 (Add)                  (None, 13, 48)       0           ['max_pooling1d_285[0][0]',      
                                                                  'batch_normalization_571[0][0]']
                                                                                                  
 activation_571 (Activation)    (None, 13, 48)       0           ['add_285[0][0]']                
                                                                                                  
 conv1d_572 (Conv1D)            (None, 13, 96)       13920       ['activation_571[0][0]']         
                                                                                                  
 batch_normalization_572 (Batch  (None, 13, 96)      384         ['conv1d_572[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_572 (Activation)    (None, 13, 96)       0           ['batch_normalization_572[0][0]']
                                                                                                  
 spatial_dropout1d_286 (Spatial  (None, 13, 96)      0           ['activation_572[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_573 (Conv1D)            (None, 7, 96)        4704        ['activation_571[0][0]']         
                                                                                                  
 max_pooling1d_286 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_286[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_573 (Batch  (None, 7, 96)       384         ['conv1d_573[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_286 (Add)                  (None, 7, 96)        0           ['max_pooling1d_286[0][0]',      
                                                                  'batch_normalization_573[0][0]']
                                                                                                  
 activation_573 (Activation)    (None, 7, 96)        0           ['add_286[0][0]']                
                                                                                                  
 conv1d_574 (Conv1D)            (None, 7, 192)       55488       ['activation_573[0][0]']         
                                                                                                  
 batch_normalization_574 (Batch  (None, 7, 192)      768         ['conv1d_574[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_574 (Activation)    (None, 7, 192)       0           ['batch_normalization_574[0][0]']
                                                                                                  
 spatial_dropout1d_287 (Spatial  (None, 7, 192)      0           ['activation_574[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_575 (Conv1D)            (None, 4, 192)       18624       ['activation_573[0][0]']         
                                                                                                  
 max_pooling1d_287 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_287[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_575 (Batch  (None, 4, 192)      768         ['conv1d_575[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_287 (Add)                  (None, 4, 192)       0           ['max_pooling1d_287[0][0]',      
                                                                  'batch_normalization_575[0][0]']
                                                                                                  
 activation_575 (Activation)    (None, 4, 192)       0           ['add_287[0][0]']                
                                                                                                  
 global_average_pooling1d_95 (G  (None, 192)         0           ['activation_575[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_95 (Globa  (None, 192)         0           ['activation_575[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_95 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_95[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_95[0][0]']
                                                                                                  
 dropout_190 (Dropout)          (None, 384)          0           ['concatenate_95[0][0]']         
                                                                                                  
 dense_95 (Dense)               (None, 128)          49280       ['dropout_190[0][0]']            
                                                                                                  
 dropout_191 (Dropout)          (None, 128)          0           ['dense_95[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_191[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_191[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 180,323
Trainable params: 178,979
Non-trainable params: 1,344
__________________________________________________________________________________________________
