Model: "model_91"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_46 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_546 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_46[0][0]'] 
                                                                                                  
 batch_normalization_546 (Batch  (None, 25, 48)      192         ['conv1d_546[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_546 (Activation)    (None, 25, 48)       0           ['batch_normalization_546[0][0]']
                                                                                                  
 spatial_dropout1d_273 (Spatial  (None, 25, 48)      0           ['activation_546[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_547 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_46[0][0]'] 
                                                                                                  
 max_pooling1d_273 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_273[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_547 (Batch  (None, 13, 48)      192         ['conv1d_547[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_273 (Add)                  (None, 13, 48)       0           ['max_pooling1d_273[0][0]',      
                                                                  'batch_normalization_547[0][0]']
                                                                                                  
 activation_547 (Activation)    (None, 13, 48)       0           ['add_273[0][0]']                
                                                                                                  
 conv1d_548 (Conv1D)            (None, 13, 96)       13920       ['activation_547[0][0]']         
                                                                                                  
 batch_normalization_548 (Batch  (None, 13, 96)      384         ['conv1d_548[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_548 (Activation)    (None, 13, 96)       0           ['batch_normalization_548[0][0]']
                                                                                                  
 spatial_dropout1d_274 (Spatial  (None, 13, 96)      0           ['activation_548[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_549 (Conv1D)            (None, 7, 96)        4704        ['activation_547[0][0]']         
                                                                                                  
 max_pooling1d_274 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_274[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_549 (Batch  (None, 7, 96)       384         ['conv1d_549[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_274 (Add)                  (None, 7, 96)        0           ['max_pooling1d_274[0][0]',      
                                                                  'batch_normalization_549[0][0]']
                                                                                                  
 activation_549 (Activation)    (None, 7, 96)        0           ['add_274[0][0]']                
                                                                                                  
 conv1d_550 (Conv1D)            (None, 7, 192)       55488       ['activation_549[0][0]']         
                                                                                                  
 batch_normalization_550 (Batch  (None, 7, 192)      768         ['conv1d_550[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_550 (Activation)    (None, 7, 192)       0           ['batch_normalization_550[0][0]']
                                                                                                  
 spatial_dropout1d_275 (Spatial  (None, 7, 192)      0           ['activation_550[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_551 (Conv1D)            (None, 4, 192)       18624       ['activation_549[0][0]']         
                                                                                                  
 max_pooling1d_275 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_275[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_551 (Batch  (None, 4, 192)      768         ['conv1d_551[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_275 (Add)                  (None, 4, 192)       0           ['max_pooling1d_275[0][0]',      
                                                                  'batch_normalization_551[0][0]']
                                                                                                  
 activation_551 (Activation)    (None, 4, 192)       0           ['add_275[0][0]']                
                                                                                                  
 global_average_pooling1d_91 (G  (None, 192)         0           ['activation_551[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_91 (Globa  (None, 192)         0           ['activation_551[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_91 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_91[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_91[0][0]']
                                                                                                  
 dropout_182 (Dropout)          (None, 384)          0           ['concatenate_91[0][0]']         
                                                                                                  
 dense_91 (Dense)               (None, 128)          49280       ['dropout_182[0][0]']            
                                                                                                  
 dropout_183 (Dropout)          (None, 128)          0           ['dense_91[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_183[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_183[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 156,899
Trainable params: 155,555
Non-trainable params: 1,344
__________________________________________________________________________________________________
