Model: "model_38"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_20 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_228 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_20[0][0]'] 
                                                                                                  
 batch_normalization_228 (Batch  (None, 25, 48)      192         ['conv1d_228[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_228 (Activation)    (None, 25, 48)       0           ['batch_normalization_228[0][0]']
                                                                                                  
 spatial_dropout1d_114 (Spatial  (None, 25, 48)      0           ['activation_228[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_229 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_20[0][0]'] 
                                                                                                  
 max_pooling1d_114 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_114[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_229 (Batch  (None, 13, 48)      192         ['conv1d_229[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_114 (Add)                  (None, 13, 48)       0           ['max_pooling1d_114[0][0]',      
                                                                  'batch_normalization_229[0][0]']
                                                                                                  
 activation_229 (Activation)    (None, 13, 48)       0           ['add_114[0][0]']                
                                                                                                  
 conv1d_230 (Conv1D)            (None, 13, 96)       13920       ['activation_229[0][0]']         
                                                                                                  
 batch_normalization_230 (Batch  (None, 13, 96)      384         ['conv1d_230[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_230 (Activation)    (None, 13, 96)       0           ['batch_normalization_230[0][0]']
                                                                                                  
 spatial_dropout1d_115 (Spatial  (None, 13, 96)      0           ['activation_230[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_231 (Conv1D)            (None, 7, 96)        4704        ['activation_229[0][0]']         
                                                                                                  
 max_pooling1d_115 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_115[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_231 (Batch  (None, 7, 96)       384         ['conv1d_231[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_115 (Add)                  (None, 7, 96)        0           ['max_pooling1d_115[0][0]',      
                                                                  'batch_normalization_231[0][0]']
                                                                                                  
 activation_231 (Activation)    (None, 7, 96)        0           ['add_115[0][0]']                
                                                                                                  
 conv1d_232 (Conv1D)            (None, 7, 192)       55488       ['activation_231[0][0]']         
                                                                                                  
 batch_normalization_232 (Batch  (None, 7, 192)      768         ['conv1d_232[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_232 (Activation)    (None, 7, 192)       0           ['batch_normalization_232[0][0]']
                                                                                                  
 spatial_dropout1d_116 (Spatial  (None, 7, 192)      0           ['activation_232[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_233 (Conv1D)            (None, 4, 192)       18624       ['activation_231[0][0]']         
                                                                                                  
 max_pooling1d_116 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_116[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_233 (Batch  (None, 4, 192)      768         ['conv1d_233[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_116 (Add)                  (None, 4, 192)       0           ['max_pooling1d_116[0][0]',      
                                                                  'batch_normalization_233[0][0]']
                                                                                                  
 activation_233 (Activation)    (None, 4, 192)       0           ['add_116[0][0]']                
                                                                                                  
 global_average_pooling1d_38 (G  (None, 192)         0           ['activation_233[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_38 (Globa  (None, 192)         0           ['activation_233[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_38 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_38[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_38[0][0]']
                                                                                                  
 dropout_76 (Dropout)           (None, 384)          0           ['concatenate_38[0][0]']         
                                                                                                  
 dense_38 (Dense)               (None, 128)          49280       ['dropout_76[0][0]']             
                                                                                                  
 dropout_77 (Dropout)           (None, 128)          0           ['dense_38[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_77[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_77[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 153,059
Trainable params: 151,715
Non-trainable params: 1,344
__________________________________________________________________________________________________
