Model: "model_18"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_9 (BasicPr  (None, 25, 41)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_108 (Conv1D)            (None, 25, 16)       1984        ['basic_preprocessing_9[0][0]']  
                                                                                                  
 batch_normalization_108 (Batch  (None, 25, 16)      64          ['conv1d_108[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_108 (Activation)    (None, 25, 16)       0           ['batch_normalization_108[0][0]']
                                                                                                  
 spatial_dropout1d_54 (SpatialD  (None, 25, 16)      0           ['activation_108[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_109 (Conv1D)            (None, 13, 16)       672         ['basic_preprocessing_9[0][0]']  
                                                                                                  
 max_pooling1d_54 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_54[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_109 (Batch  (None, 13, 16)      64          ['conv1d_109[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_54 (Add)                   (None, 13, 16)       0           ['max_pooling1d_54[0][0]',       
                                                                  'batch_normalization_109[0][0]']
                                                                                                  
 activation_109 (Activation)    (None, 13, 16)       0           ['add_54[0][0]']                 
                                                                                                  
 conv1d_110 (Conv1D)            (None, 13, 32)       1568        ['activation_109[0][0]']         
                                                                                                  
 batch_normalization_110 (Batch  (None, 13, 32)      128         ['conv1d_110[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_110 (Activation)    (None, 13, 32)       0           ['batch_normalization_110[0][0]']
                                                                                                  
 spatial_dropout1d_55 (SpatialD  (None, 13, 32)      0           ['activation_110[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_111 (Conv1D)            (None, 7, 32)        544         ['activation_109[0][0]']         
                                                                                                  
 max_pooling1d_55 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_55[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_111 (Batch  (None, 7, 32)       128         ['conv1d_111[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_55 (Add)                   (None, 7, 32)        0           ['max_pooling1d_55[0][0]',       
                                                                  'batch_normalization_111[0][0]']
                                                                                                  
 activation_111 (Activation)    (None, 7, 32)        0           ['add_55[0][0]']                 
                                                                                                  
 conv1d_112 (Conv1D)            (None, 7, 64)        6208        ['activation_111[0][0]']         
                                                                                                  
 batch_normalization_112 (Batch  (None, 7, 64)       256         ['conv1d_112[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_112 (Activation)    (None, 7, 64)        0           ['batch_normalization_112[0][0]']
                                                                                                  
 spatial_dropout1d_56 (SpatialD  (None, 7, 64)       0           ['activation_112[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_113 (Conv1D)            (None, 4, 64)        2112        ['activation_111[0][0]']         
                                                                                                  
 max_pooling1d_56 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_56[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_113 (Batch  (None, 4, 64)       256         ['conv1d_113[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_56 (Add)                   (None, 4, 64)        0           ['max_pooling1d_56[0][0]',       
                                                                  'batch_normalization_113[0][0]']
                                                                                                  
 activation_113 (Activation)    (None, 4, 64)        0           ['add_56[0][0]']                 
                                                                                                  
 global_average_pooling1d_18 (G  (None, 64)          0           ['activation_113[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_18 (Globa  (None, 64)          0           ['activation_113[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_18 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_18[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_18[0][0]']
                                                                                                  
 dropout_36 (Dropout)           (None, 128)          0           ['concatenate_18[0][0]']         
                                                                                                  
 dense_18 (Dense)               (None, 128)          16512       ['dropout_36[0][0]']             
                                                                                                  
 dropout_37 (Dropout)           (None, 128)          0           ['dense_18[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_37[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_37[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 30,883
Trainable params: 30,435
Non-trainable params: 448
__________________________________________________________________________________________________
