Model: "model_62"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_32 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_372 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_32[0][0]'] 
                                                                                                  
 batch_normalization_372 (Batch  (None, 25, 16)      64          ['conv1d_372[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_372 (Activation)    (None, 25, 16)       0           ['batch_normalization_372[0][0]']
                                                                                                  
 spatial_dropout1d_186 (Spatial  (None, 25, 16)      0           ['activation_372[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_373 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_32[0][0]'] 
                                                                                                  
 max_pooling1d_186 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_186[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_373 (Batch  (None, 13, 16)      64          ['conv1d_373[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_186 (Add)                  (None, 13, 16)       0           ['max_pooling1d_186[0][0]',      
                                                                  'batch_normalization_373[0][0]']
                                                                                                  
 activation_373 (Activation)    (None, 13, 16)       0           ['add_186[0][0]']                
                                                                                                  
 conv1d_374 (Conv1D)            (None, 13, 32)       1568        ['activation_373[0][0]']         
                                                                                                  
 batch_normalization_374 (Batch  (None, 13, 32)      128         ['conv1d_374[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_374 (Activation)    (None, 13, 32)       0           ['batch_normalization_374[0][0]']
                                                                                                  
 spatial_dropout1d_187 (Spatial  (None, 13, 32)      0           ['activation_374[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_375 (Conv1D)            (None, 7, 32)        544         ['activation_373[0][0]']         
                                                                                                  
 max_pooling1d_187 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_187[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_375 (Batch  (None, 7, 32)       128         ['conv1d_375[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_187 (Add)                  (None, 7, 32)        0           ['max_pooling1d_187[0][0]',      
                                                                  'batch_normalization_375[0][0]']
                                                                                                  
 activation_375 (Activation)    (None, 7, 32)        0           ['add_187[0][0]']                
                                                                                                  
 conv1d_376 (Conv1D)            (None, 7, 64)        6208        ['activation_375[0][0]']         
                                                                                                  
 batch_normalization_376 (Batch  (None, 7, 64)       256         ['conv1d_376[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_376 (Activation)    (None, 7, 64)        0           ['batch_normalization_376[0][0]']
                                                                                                  
 spatial_dropout1d_188 (Spatial  (None, 7, 64)       0           ['activation_376[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_377 (Conv1D)            (None, 4, 64)        2112        ['activation_375[0][0]']         
                                                                                                  
 max_pooling1d_188 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_188[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_377 (Batch  (None, 4, 64)       256         ['conv1d_377[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_188 (Add)                  (None, 4, 64)        0           ['max_pooling1d_188[0][0]',      
                                                                  'batch_normalization_377[0][0]']
                                                                                                  
 activation_377 (Activation)    (None, 4, 64)        0           ['add_188[0][0]']                
                                                                                                  
 global_average_pooling1d_62 (G  (None, 64)          0           ['activation_377[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_62 (Globa  (None, 64)          0           ['activation_377[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_62 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_62[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_62[0][0]']
                                                                                                  
 dropout_124 (Dropout)          (None, 128)          0           ['concatenate_62[0][0]']         
                                                                                                  
 dense_62 (Dense)               (None, 128)          16512       ['dropout_124[0][0]']            
                                                                                                  
 dropout_125 (Dropout)          (None, 128)          0           ['dense_62[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_125[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_125[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 32,163
Trainable params: 31,715
Non-trainable params: 448
__________________________________________________________________________________________________
