Model: "model_52"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_25 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_312 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_25[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_312 (Batch  (None, 25, 16)      64          ['conv1d_312[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_312 (Activation)    (None, 25, 16)       0           ['batch_normalization_312[0][0]']
                                                                                                  
 spatial_dropout1d_156 (Spatial  (None, 25, 16)      0           ['activation_312[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_313 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_25[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_156 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_156[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_313 (Batch  (None, 13, 16)      64          ['conv1d_313[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_156 (Add)                  (None, 13, 16)       0           ['max_pooling1d_156[0][0]',      
                                                                  'batch_normalization_313[0][0]']
                                                                                                  
 activation_313 (Activation)    (None, 13, 16)       0           ['add_156[0][0]']                
                                                                                                  
 conv1d_314 (Conv1D)            (None, 13, 32)       1568        ['activation_313[0][0]']         
                                                                                                  
 batch_normalization_314 (Batch  (None, 13, 32)      128         ['conv1d_314[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_314 (Activation)    (None, 13, 32)       0           ['batch_normalization_314[0][0]']
                                                                                                  
 spatial_dropout1d_157 (Spatial  (None, 13, 32)      0           ['activation_314[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_315 (Conv1D)            (None, 7, 32)        544         ['activation_313[0][0]']         
                                                                                                  
 max_pooling1d_157 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_157[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_315 (Batch  (None, 7, 32)       128         ['conv1d_315[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_157 (Add)                  (None, 7, 32)        0           ['max_pooling1d_157[0][0]',      
                                                                  'batch_normalization_315[0][0]']
                                                                                                  
 activation_315 (Activation)    (None, 7, 32)        0           ['add_157[0][0]']                
                                                                                                  
 conv1d_316 (Conv1D)            (None, 7, 64)        6208        ['activation_315[0][0]']         
                                                                                                  
 batch_normalization_316 (Batch  (None, 7, 64)       256         ['conv1d_316[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_316 (Activation)    (None, 7, 64)        0           ['batch_normalization_316[0][0]']
                                                                                                  
 spatial_dropout1d_158 (Spatial  (None, 7, 64)       0           ['activation_316[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_317 (Conv1D)            (None, 4, 64)        2112        ['activation_315[0][0]']         
                                                                                                  
 max_pooling1d_158 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_158[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_317 (Batch  (None, 4, 64)       256         ['conv1d_317[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_158 (Add)                  (None, 4, 64)        0           ['max_pooling1d_158[0][0]',      
                                                                  'batch_normalization_317[0][0]']
                                                                                                  
 activation_317 (Activation)    (None, 4, 64)        0           ['add_158[0][0]']                
                                                                                                  
 global_average_pooling1d_52 (G  (None, 64)          0           ['activation_317[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_52 (Globa  (None, 64)          0           ['activation_317[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_52 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_52[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_52[0][0]']
                                                                                                  
 dropout_104 (Dropout)          (None, 128)          0           ['concatenate_52[0][0]']         
                                                                                                  
 dense_52 (Dense)               (None, 64)           8256        ['dropout_104[0][0]']            
                                                                                                  
 dropout_105 (Dropout)          (None, 64)           0           ['dense_52[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_105[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_105[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 31,523
Trainable params: 31,075
Non-trainable params: 448
__________________________________________________________________________________________________
