Model: "model_4"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_1 (Enha  (None, 25, 276)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_24 (Conv1D)             (None, 25, 16)       13264       ['enhanced_preprocessing_1[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_24 (BatchN  (None, 25, 16)      64          ['conv1d_24[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_24 (Activation)     (None, 25, 16)       0           ['batch_normalization_24[0][0]'] 
                                                                                                  
 spatial_dropout1d_12 (SpatialD  (None, 25, 16)      0           ['activation_24[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_25 (Conv1D)             (None, 13, 16)       4432        ['enhanced_preprocessing_1[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_12 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_12[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_25 (BatchN  (None, 13, 16)      64          ['conv1d_25[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_12 (Add)                   (None, 13, 16)       0           ['max_pooling1d_12[0][0]',       
                                                                  'batch_normalization_25[0][0]'] 
                                                                                                  
 activation_25 (Activation)     (None, 13, 16)       0           ['add_12[0][0]']                 
                                                                                                  
 conv1d_26 (Conv1D)             (None, 13, 32)       1568        ['activation_25[0][0]']          
                                                                                                  
 batch_normalization_26 (BatchN  (None, 13, 32)      128         ['conv1d_26[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_26 (Activation)     (None, 13, 32)       0           ['batch_normalization_26[0][0]'] 
                                                                                                  
 spatial_dropout1d_13 (SpatialD  (None, 13, 32)      0           ['activation_26[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_27 (Conv1D)             (None, 7, 32)        544         ['activation_25[0][0]']          
                                                                                                  
 max_pooling1d_13 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_13[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_27 (BatchN  (None, 7, 32)       128         ['conv1d_27[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_13 (Add)                   (None, 7, 32)        0           ['max_pooling1d_13[0][0]',       
                                                                  'batch_normalization_27[0][0]'] 
                                                                                                  
 activation_27 (Activation)     (None, 7, 32)        0           ['add_13[0][0]']                 
                                                                                                  
 conv1d_28 (Conv1D)             (None, 7, 64)        6208        ['activation_27[0][0]']          
                                                                                                  
 batch_normalization_28 (BatchN  (None, 7, 64)       256         ['conv1d_28[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_28 (Activation)     (None, 7, 64)        0           ['batch_normalization_28[0][0]'] 
                                                                                                  
 spatial_dropout1d_14 (SpatialD  (None, 7, 64)       0           ['activation_28[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_29 (Conv1D)             (None, 4, 64)        2112        ['activation_27[0][0]']          
                                                                                                  
 max_pooling1d_14 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_14[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_29 (BatchN  (None, 4, 64)       256         ['conv1d_29[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_14 (Add)                   (None, 4, 64)        0           ['max_pooling1d_14[0][0]',       
                                                                  'batch_normalization_29[0][0]'] 
                                                                                                  
 activation_29 (Activation)     (None, 4, 64)        0           ['add_14[0][0]']                 
                                                                                                  
 global_average_pooling1d_4 (Gl  (None, 64)          0           ['activation_29[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_4 (Global  (None, 64)          0           ['activation_29[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_4 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_4[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_4[0][0]'] 
                                                                                                  
 dropout_8 (Dropout)            (None, 128)          0           ['concatenate_4[0][0]']          
                                                                                                  
 dense_4 (Dense)                (None, 128)          16512       ['dropout_8[0][0]']              
                                                                                                  
 dropout_9 (Dropout)            (None, 128)          0           ['dense_4[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_9[0][0]']              
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_9[0][0]']              
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 45,923
Trainable params: 45,475
Non-trainable params: 448
__________________________________________________________________________________________________
