Model: "model_66"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_33 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_396 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_33[0][0]'] 
                                                                                                  
 batch_normalization_396 (Batch  (None, 25, 16)      64          ['conv1d_396[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_396 (Activation)    (None, 25, 16)       0           ['batch_normalization_396[0][0]']
                                                                                                  
 spatial_dropout1d_198 (Spatial  (None, 25, 16)      0           ['activation_396[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_397 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_33[0][0]'] 
                                                                                                  
 max_pooling1d_198 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_198[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_397 (Batch  (None, 13, 16)      64          ['conv1d_397[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_198 (Add)                  (None, 13, 16)       0           ['max_pooling1d_198[0][0]',      
                                                                  'batch_normalization_397[0][0]']
                                                                                                  
 activation_397 (Activation)    (None, 13, 16)       0           ['add_198[0][0]']                
                                                                                                  
 conv1d_398 (Conv1D)            (None, 13, 32)       1568        ['activation_397[0][0]']         
                                                                                                  
 batch_normalization_398 (Batch  (None, 13, 32)      128         ['conv1d_398[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_398 (Activation)    (None, 13, 32)       0           ['batch_normalization_398[0][0]']
                                                                                                  
 spatial_dropout1d_199 (Spatial  (None, 13, 32)      0           ['activation_398[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_399 (Conv1D)            (None, 7, 32)        544         ['activation_397[0][0]']         
                                                                                                  
 max_pooling1d_199 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_199[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_399 (Batch  (None, 7, 32)       128         ['conv1d_399[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_199 (Add)                  (None, 7, 32)        0           ['max_pooling1d_199[0][0]',      
                                                                  'batch_normalization_399[0][0]']
                                                                                                  
 activation_399 (Activation)    (None, 7, 32)        0           ['add_199[0][0]']                
                                                                                                  
 conv1d_400 (Conv1D)            (None, 7, 64)        6208        ['activation_399[0][0]']         
                                                                                                  
 batch_normalization_400 (Batch  (None, 7, 64)       256         ['conv1d_400[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_400 (Activation)    (None, 7, 64)        0           ['batch_normalization_400[0][0]']
                                                                                                  
 spatial_dropout1d_200 (Spatial  (None, 7, 64)       0           ['activation_400[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_401 (Conv1D)            (None, 4, 64)        2112        ['activation_399[0][0]']         
                                                                                                  
 max_pooling1d_200 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_200[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_401 (Batch  (None, 4, 64)       256         ['conv1d_401[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_200 (Add)                  (None, 4, 64)        0           ['max_pooling1d_200[0][0]',      
                                                                  'batch_normalization_401[0][0]']
                                                                                                  
 activation_401 (Activation)    (None, 4, 64)        0           ['add_200[0][0]']                
                                                                                                  
 global_average_pooling1d_66 (G  (None, 64)          0           ['activation_401[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_66 (Globa  (None, 64)          0           ['activation_401[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_66 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_66[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_66[0][0]']
                                                                                                  
 dropout_132 (Dropout)          (None, 128)          0           ['concatenate_66[0][0]']         
                                                                                                  
 dense_66 (Dense)               (None, 128)          16512       ['dropout_132[0][0]']            
                                                                                                  
 dropout_133 (Dropout)          (None, 128)          0           ['dense_66[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_133[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_133[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 32,163
Trainable params: 31,715
Non-trainable params: 448
__________________________________________________________________________________________________
