Model: "model_53"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_26 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_318 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_26[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_318 (Batch  (None, 25, 16)      64          ['conv1d_318[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_318 (Activation)    (None, 25, 16)       0           ['batch_normalization_318[0][0]']
                                                                                                  
 spatial_dropout1d_159 (Spatial  (None, 25, 16)      0           ['activation_318[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_319 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_26[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_159 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_159[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_319 (Batch  (None, 13, 16)      64          ['conv1d_319[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_159 (Add)                  (None, 13, 16)       0           ['max_pooling1d_159[0][0]',      
                                                                  'batch_normalization_319[0][0]']
                                                                                                  
 activation_319 (Activation)    (None, 13, 16)       0           ['add_159[0][0]']                
                                                                                                  
 conv1d_320 (Conv1D)            (None, 13, 32)       1568        ['activation_319[0][0]']         
                                                                                                  
 batch_normalization_320 (Batch  (None, 13, 32)      128         ['conv1d_320[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_320 (Activation)    (None, 13, 32)       0           ['batch_normalization_320[0][0]']
                                                                                                  
 spatial_dropout1d_160 (Spatial  (None, 13, 32)      0           ['activation_320[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_321 (Conv1D)            (None, 7, 32)        544         ['activation_319[0][0]']         
                                                                                                  
 max_pooling1d_160 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_160[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_321 (Batch  (None, 7, 32)       128         ['conv1d_321[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_160 (Add)                  (None, 7, 32)        0           ['max_pooling1d_160[0][0]',      
                                                                  'batch_normalization_321[0][0]']
                                                                                                  
 activation_321 (Activation)    (None, 7, 32)        0           ['add_160[0][0]']                
                                                                                                  
 conv1d_322 (Conv1D)            (None, 7, 64)        6208        ['activation_321[0][0]']         
                                                                                                  
 batch_normalization_322 (Batch  (None, 7, 64)       256         ['conv1d_322[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_322 (Activation)    (None, 7, 64)        0           ['batch_normalization_322[0][0]']
                                                                                                  
 spatial_dropout1d_161 (Spatial  (None, 7, 64)       0           ['activation_322[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_323 (Conv1D)            (None, 4, 64)        2112        ['activation_321[0][0]']         
                                                                                                  
 max_pooling1d_161 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_161[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_323 (Batch  (None, 4, 64)       256         ['conv1d_323[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_161 (Add)                  (None, 4, 64)        0           ['max_pooling1d_161[0][0]',      
                                                                  'batch_normalization_323[0][0]']
                                                                                                  
 activation_323 (Activation)    (None, 4, 64)        0           ['add_161[0][0]']                
                                                                                                  
 global_average_pooling1d_53 (G  (None, 64)          0           ['activation_323[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_53 (Globa  (None, 64)          0           ['activation_323[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_53 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_53[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_53[0][0]']
                                                                                                  
 dropout_106 (Dropout)          (None, 128)          0           ['concatenate_53[0][0]']         
                                                                                                  
 dense_53 (Dense)               (None, 64)           8256        ['dropout_106[0][0]']            
                                                                                                  
 dropout_107 (Dropout)          (None, 64)           0           ['dense_53[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_107[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_107[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 31,523
Trainable params: 31,075
Non-trainable params: 448
__________________________________________________________________________________________________
