Model: "model_76"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_37 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_456 (Conv1D)            (None, 25, 48)       26400       ['enhanced_preprocessing_37[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_456 (Batch  (None, 25, 48)      192         ['conv1d_456[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_456 (Activation)    (None, 25, 48)       0           ['batch_normalization_456[0][0]']
                                                                                                  
 spatial_dropout1d_228 (Spatial  (None, 25, 48)      0           ['activation_456[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_457 (Conv1D)            (None, 13, 48)       8832        ['enhanced_preprocessing_37[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_228 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_228[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_457 (Batch  (None, 13, 48)      192         ['conv1d_457[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_228 (Add)                  (None, 13, 48)       0           ['max_pooling1d_228[0][0]',      
                                                                  'batch_normalization_457[0][0]']
                                                                                                  
 activation_457 (Activation)    (None, 13, 48)       0           ['add_228[0][0]']                
                                                                                                  
 conv1d_458 (Conv1D)            (None, 13, 96)       13920       ['activation_457[0][0]']         
                                                                                                  
 batch_normalization_458 (Batch  (None, 13, 96)      384         ['conv1d_458[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_458 (Activation)    (None, 13, 96)       0           ['batch_normalization_458[0][0]']
                                                                                                  
 spatial_dropout1d_229 (Spatial  (None, 13, 96)      0           ['activation_458[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_459 (Conv1D)            (None, 7, 96)        4704        ['activation_457[0][0]']         
                                                                                                  
 max_pooling1d_229 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_229[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_459 (Batch  (None, 7, 96)       384         ['conv1d_459[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_229 (Add)                  (None, 7, 96)        0           ['max_pooling1d_229[0][0]',      
                                                                  'batch_normalization_459[0][0]']
                                                                                                  
 activation_459 (Activation)    (None, 7, 96)        0           ['add_229[0][0]']                
                                                                                                  
 conv1d_460 (Conv1D)            (None, 7, 192)       55488       ['activation_459[0][0]']         
                                                                                                  
 batch_normalization_460 (Batch  (None, 7, 192)      768         ['conv1d_460[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_460 (Activation)    (None, 7, 192)       0           ['batch_normalization_460[0][0]']
                                                                                                  
 spatial_dropout1d_230 (Spatial  (None, 7, 192)      0           ['activation_460[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_461 (Conv1D)            (None, 4, 192)       18624       ['activation_459[0][0]']         
                                                                                                  
 max_pooling1d_230 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_230[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_461 (Batch  (None, 4, 192)      768         ['conv1d_461[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_230 (Add)                  (None, 4, 192)       0           ['max_pooling1d_230[0][0]',      
                                                                  'batch_normalization_461[0][0]']
                                                                                                  
 activation_461 (Activation)    (None, 4, 192)       0           ['add_230[0][0]']                
                                                                                                  
 global_average_pooling1d_76 (G  (None, 192)         0           ['activation_461[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_76 (Globa  (None, 192)         0           ['activation_461[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_76 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_76[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_76[0][0]']
                                                                                                  
 dropout_152 (Dropout)          (None, 384)          0           ['concatenate_76[0][0]']         
                                                                                                  
 dense_76 (Dense)               (None, 64)           24640       ['dropout_152[0][0]']            
                                                                                                  
 dropout_153 (Dropout)          (None, 64)           0           ['dense_76[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_153[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_153[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 155,491
Trainable params: 154,147
Non-trainable params: 1,344
__________________________________________________________________________________________________
