Model: "model_96"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_48 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_576 (Conv1D)            (None, 25, 16)       4432        ['basic_preprocessing_48[0][0]'] 
                                                                                                  
 batch_normalization_576 (Batch  (None, 25, 16)      64          ['conv1d_576[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_576 (Activation)    (None, 25, 16)       0           ['batch_normalization_576[0][0]']
                                                                                                  
 spatial_dropout1d_288 (Spatial  (None, 25, 16)      0           ['activation_576[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_577 (Conv1D)            (None, 13, 16)       1488        ['basic_preprocessing_48[0][0]'] 
                                                                                                  
 max_pooling1d_288 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_288[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_577 (Batch  (None, 13, 16)      64          ['conv1d_577[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_288 (Add)                  (None, 13, 16)       0           ['max_pooling1d_288[0][0]',      
                                                                  'batch_normalization_577[0][0]']
                                                                                                  
 activation_577 (Activation)    (None, 13, 16)       0           ['add_288[0][0]']                
                                                                                                  
 conv1d_578 (Conv1D)            (None, 13, 32)       1568        ['activation_577[0][0]']         
                                                                                                  
 batch_normalization_578 (Batch  (None, 13, 32)      128         ['conv1d_578[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_578 (Activation)    (None, 13, 32)       0           ['batch_normalization_578[0][0]']
                                                                                                  
 spatial_dropout1d_289 (Spatial  (None, 13, 32)      0           ['activation_578[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_579 (Conv1D)            (None, 7, 32)        544         ['activation_577[0][0]']         
                                                                                                  
 max_pooling1d_289 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_289[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_579 (Batch  (None, 7, 32)       128         ['conv1d_579[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_289 (Add)                  (None, 7, 32)        0           ['max_pooling1d_289[0][0]',      
                                                                  'batch_normalization_579[0][0]']
                                                                                                  
 activation_579 (Activation)    (None, 7, 32)        0           ['add_289[0][0]']                
                                                                                                  
 conv1d_580 (Conv1D)            (None, 7, 64)        6208        ['activation_579[0][0]']         
                                                                                                  
 batch_normalization_580 (Batch  (None, 7, 64)       256         ['conv1d_580[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_580 (Activation)    (None, 7, 64)        0           ['batch_normalization_580[0][0]']
                                                                                                  
 spatial_dropout1d_290 (Spatial  (None, 7, 64)       0           ['activation_580[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_581 (Conv1D)            (None, 4, 64)        2112        ['activation_579[0][0]']         
                                                                                                  
 max_pooling1d_290 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_290[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_581 (Batch  (None, 4, 64)       256         ['conv1d_581[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_290 (Add)                  (None, 4, 64)        0           ['max_pooling1d_290[0][0]',      
                                                                  'batch_normalization_581[0][0]']
                                                                                                  
 activation_581 (Activation)    (None, 4, 64)        0           ['add_290[0][0]']                
                                                                                                  
 global_average_pooling1d_96 (G  (None, 64)          0           ['activation_581[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_96 (Globa  (None, 64)          0           ['activation_581[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_96 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_96[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_96[0][0]']
                                                                                                  
 dropout_192 (Dropout)          (None, 128)          0           ['concatenate_96[0][0]']         
                                                                                                  
 dense_96 (Dense)               (None, 64)           8256        ['dropout_192[0][0]']            
                                                                                                  
 dropout_193 (Dropout)          (None, 64)           0           ['dense_96[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_193[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_193[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 25,699
Trainable params: 25,251
Non-trainable params: 448
__________________________________________________________________________________________________
