Model: "model_99"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_48 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_594 (Conv1D)            (None, 25, 16)       13264       ['enhanced_preprocessing_48[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_594 (Batch  (None, 25, 16)      64          ['conv1d_594[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_594 (Activation)    (None, 25, 16)       0           ['batch_normalization_594[0][0]']
                                                                                                  
 spatial_dropout1d_297 (Spatial  (None, 25, 16)      0           ['activation_594[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_595 (Conv1D)            (None, 13, 16)       4432        ['enhanced_preprocessing_48[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_297 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_297[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_595 (Batch  (None, 13, 16)      64          ['conv1d_595[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_297 (Add)                  (None, 13, 16)       0           ['max_pooling1d_297[0][0]',      
                                                                  'batch_normalization_595[0][0]']
                                                                                                  
 activation_595 (Activation)    (None, 13, 16)       0           ['add_297[0][0]']                
                                                                                                  
 conv1d_596 (Conv1D)            (None, 13, 32)       1568        ['activation_595[0][0]']         
                                                                                                  
 batch_normalization_596 (Batch  (None, 13, 32)      128         ['conv1d_596[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_596 (Activation)    (None, 13, 32)       0           ['batch_normalization_596[0][0]']
                                                                                                  
 spatial_dropout1d_298 (Spatial  (None, 13, 32)      0           ['activation_596[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_597 (Conv1D)            (None, 7, 32)        544         ['activation_595[0][0]']         
                                                                                                  
 max_pooling1d_298 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_298[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_597 (Batch  (None, 7, 32)       128         ['conv1d_597[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_298 (Add)                  (None, 7, 32)        0           ['max_pooling1d_298[0][0]',      
                                                                  'batch_normalization_597[0][0]']
                                                                                                  
 activation_597 (Activation)    (None, 7, 32)        0           ['add_298[0][0]']                
                                                                                                  
 conv1d_598 (Conv1D)            (None, 7, 64)        6208        ['activation_597[0][0]']         
                                                                                                  
 batch_normalization_598 (Batch  (None, 7, 64)       256         ['conv1d_598[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_598 (Activation)    (None, 7, 64)        0           ['batch_normalization_598[0][0]']
                                                                                                  
 spatial_dropout1d_299 (Spatial  (None, 7, 64)       0           ['activation_598[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_599 (Conv1D)            (None, 4, 64)        2112        ['activation_597[0][0]']         
                                                                                                  
 max_pooling1d_299 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_299[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_599 (Batch  (None, 4, 64)       256         ['conv1d_599[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_299 (Add)                  (None, 4, 64)        0           ['max_pooling1d_299[0][0]',      
                                                                  'batch_normalization_599[0][0]']
                                                                                                  
 activation_599 (Activation)    (None, 4, 64)        0           ['add_299[0][0]']                
                                                                                                  
 global_average_pooling1d_99 (G  (None, 64)          0           ['activation_599[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_99 (Globa  (None, 64)          0           ['activation_599[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_99 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_99[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_99[0][0]']
                                                                                                  
 dropout_198 (Dropout)          (None, 128)          0           ['concatenate_99[0][0]']         
                                                                                                  
 dense_99 (Dense)               (None, 64)           8256        ['dropout_198[0][0]']            
                                                                                                  
 dropout_199 (Dropout)          (None, 64)           0           ['dense_99[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_199[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_199[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 37,475
Trainable params: 37,027
Non-trainable params: 448
__________________________________________________________________________________________________
