Model: "model_74"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_38 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_444 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_38[0][0]'] 
                                                                                                  
 batch_normalization_444 (Batch  (None, 25, 48)      192         ['conv1d_444[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_444 (Activation)    (None, 25, 48)       0           ['batch_normalization_444[0][0]']
                                                                                                  
 spatial_dropout1d_222 (Spatial  (None, 25, 48)      0           ['activation_444[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_445 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_38[0][0]'] 
                                                                                                  
 max_pooling1d_222 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_222[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_445 (Batch  (None, 13, 48)      192         ['conv1d_445[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_222 (Add)                  (None, 13, 48)       0           ['max_pooling1d_222[0][0]',      
                                                                  'batch_normalization_445[0][0]']
                                                                                                  
 activation_445 (Activation)    (None, 13, 48)       0           ['add_222[0][0]']                
                                                                                                  
 conv1d_446 (Conv1D)            (None, 13, 96)       13920       ['activation_445[0][0]']         
                                                                                                  
 batch_normalization_446 (Batch  (None, 13, 96)      384         ['conv1d_446[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_446 (Activation)    (None, 13, 96)       0           ['batch_normalization_446[0][0]']
                                                                                                  
 spatial_dropout1d_223 (Spatial  (None, 13, 96)      0           ['activation_446[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_447 (Conv1D)            (None, 7, 96)        4704        ['activation_445[0][0]']         
                                                                                                  
 max_pooling1d_223 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_223[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_447 (Batch  (None, 7, 96)       384         ['conv1d_447[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_223 (Add)                  (None, 7, 96)        0           ['max_pooling1d_223[0][0]',      
                                                                  'batch_normalization_447[0][0]']
                                                                                                  
 activation_447 (Activation)    (None, 7, 96)        0           ['add_223[0][0]']                
                                                                                                  
 conv1d_448 (Conv1D)            (None, 7, 192)       55488       ['activation_447[0][0]']         
                                                                                                  
 batch_normalization_448 (Batch  (None, 7, 192)      768         ['conv1d_448[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_448 (Activation)    (None, 7, 192)       0           ['batch_normalization_448[0][0]']
                                                                                                  
 spatial_dropout1d_224 (Spatial  (None, 7, 192)      0           ['activation_448[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_449 (Conv1D)            (None, 4, 192)       18624       ['activation_447[0][0]']         
                                                                                                  
 max_pooling1d_224 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_224[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_449 (Batch  (None, 4, 192)      768         ['conv1d_449[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_224 (Add)                  (None, 4, 192)       0           ['max_pooling1d_224[0][0]',      
                                                                  'batch_normalization_449[0][0]']
                                                                                                  
 activation_449 (Activation)    (None, 4, 192)       0           ['add_224[0][0]']                
                                                                                                  
 global_average_pooling1d_74 (G  (None, 192)         0           ['activation_449[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_74 (Globa  (None, 192)         0           ['activation_449[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_74 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_74[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_74[0][0]']
                                                                                                  
 dropout_148 (Dropout)          (None, 384)          0           ['concatenate_74[0][0]']         
                                                                                                  
 dense_74 (Dense)               (None, 64)           24640       ['dropout_148[0][0]']            
                                                                                                  
 dropout_149 (Dropout)          (None, 64)           0           ['dense_74[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_149[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_149[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 132,067
Trainable params: 130,723
Non-trainable params: 1,344
__________________________________________________________________________________________________
