Model: "model_42"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_21 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_252 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_21[0][0]'] 
                                                                                                  
 batch_normalization_252 (Batch  (None, 25, 48)      192         ['conv1d_252[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_252 (Activation)    (None, 25, 48)       0           ['batch_normalization_252[0][0]']
                                                                                                  
 spatial_dropout1d_126 (Spatial  (None, 25, 48)      0           ['activation_252[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_253 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_21[0][0]'] 
                                                                                                  
 max_pooling1d_126 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_126[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_253 (Batch  (None, 13, 48)      192         ['conv1d_253[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_126 (Add)                  (None, 13, 48)       0           ['max_pooling1d_126[0][0]',      
                                                                  'batch_normalization_253[0][0]']
                                                                                                  
 activation_253 (Activation)    (None, 13, 48)       0           ['add_126[0][0]']                
                                                                                                  
 conv1d_254 (Conv1D)            (None, 13, 96)       13920       ['activation_253[0][0]']         
                                                                                                  
 batch_normalization_254 (Batch  (None, 13, 96)      384         ['conv1d_254[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_254 (Activation)    (None, 13, 96)       0           ['batch_normalization_254[0][0]']
                                                                                                  
 spatial_dropout1d_127 (Spatial  (None, 13, 96)      0           ['activation_254[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_255 (Conv1D)            (None, 7, 96)        4704        ['activation_253[0][0]']         
                                                                                                  
 max_pooling1d_127 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_127[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_255 (Batch  (None, 7, 96)       384         ['conv1d_255[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_127 (Add)                  (None, 7, 96)        0           ['max_pooling1d_127[0][0]',      
                                                                  'batch_normalization_255[0][0]']
                                                                                                  
 activation_255 (Activation)    (None, 7, 96)        0           ['add_127[0][0]']                
                                                                                                  
 conv1d_256 (Conv1D)            (None, 7, 192)       55488       ['activation_255[0][0]']         
                                                                                                  
 batch_normalization_256 (Batch  (None, 7, 192)      768         ['conv1d_256[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_256 (Activation)    (None, 7, 192)       0           ['batch_normalization_256[0][0]']
                                                                                                  
 spatial_dropout1d_128 (Spatial  (None, 7, 192)      0           ['activation_256[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_257 (Conv1D)            (None, 4, 192)       18624       ['activation_255[0][0]']         
                                                                                                  
 max_pooling1d_128 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_128[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_257 (Batch  (None, 4, 192)      768         ['conv1d_257[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_128 (Add)                  (None, 4, 192)       0           ['max_pooling1d_128[0][0]',      
                                                                  'batch_normalization_257[0][0]']
                                                                                                  
 activation_257 (Activation)    (None, 4, 192)       0           ['add_128[0][0]']                
                                                                                                  
 global_average_pooling1d_42 (G  (None, 192)         0           ['activation_257[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_42 (Globa  (None, 192)         0           ['activation_257[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_42 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_42[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_42[0][0]']
                                                                                                  
 dropout_84 (Dropout)           (None, 384)          0           ['concatenate_42[0][0]']         
                                                                                                  
 dense_42 (Dense)               (None, 128)          49280       ['dropout_84[0][0]']             
                                                                                                  
 dropout_85 (Dropout)           (None, 128)          0           ['dense_42[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_85[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_85[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 153,059
Trainable params: 151,715
Non-trainable params: 1,344
__________________________________________________________________________________________________
