Model: "model_26"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_14 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_156 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_14[0][0]'] 
                                                                                                  
 batch_normalization_156 (Batch  (None, 25, 48)      192         ['conv1d_156[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_156 (Activation)    (None, 25, 48)       0           ['batch_normalization_156[0][0]']
                                                                                                  
 spatial_dropout1d_78 (SpatialD  (None, 25, 48)      0           ['activation_156[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_157 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_14[0][0]'] 
                                                                                                  
 max_pooling1d_78 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_78[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_157 (Batch  (None, 13, 48)      192         ['conv1d_157[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_78 (Add)                   (None, 13, 48)       0           ['max_pooling1d_78[0][0]',       
                                                                  'batch_normalization_157[0][0]']
                                                                                                  
 activation_157 (Activation)    (None, 13, 48)       0           ['add_78[0][0]']                 
                                                                                                  
 conv1d_158 (Conv1D)            (None, 13, 96)       13920       ['activation_157[0][0]']         
                                                                                                  
 batch_normalization_158 (Batch  (None, 13, 96)      384         ['conv1d_158[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_158 (Activation)    (None, 13, 96)       0           ['batch_normalization_158[0][0]']
                                                                                                  
 spatial_dropout1d_79 (SpatialD  (None, 13, 96)      0           ['activation_158[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_159 (Conv1D)            (None, 7, 96)        4704        ['activation_157[0][0]']         
                                                                                                  
 max_pooling1d_79 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_79[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_159 (Batch  (None, 7, 96)       384         ['conv1d_159[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_79 (Add)                   (None, 7, 96)        0           ['max_pooling1d_79[0][0]',       
                                                                  'batch_normalization_159[0][0]']
                                                                                                  
 activation_159 (Activation)    (None, 7, 96)        0           ['add_79[0][0]']                 
                                                                                                  
 conv1d_160 (Conv1D)            (None, 7, 192)       55488       ['activation_159[0][0]']         
                                                                                                  
 batch_normalization_160 (Batch  (None, 7, 192)      768         ['conv1d_160[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_160 (Activation)    (None, 7, 192)       0           ['batch_normalization_160[0][0]']
                                                                                                  
 spatial_dropout1d_80 (SpatialD  (None, 7, 192)      0           ['activation_160[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_161 (Conv1D)            (None, 4, 192)       18624       ['activation_159[0][0]']         
                                                                                                  
 max_pooling1d_80 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_80[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_161 (Batch  (None, 4, 192)      768         ['conv1d_161[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_80 (Add)                   (None, 4, 192)       0           ['max_pooling1d_80[0][0]',       
                                                                  'batch_normalization_161[0][0]']
                                                                                                  
 activation_161 (Activation)    (None, 4, 192)       0           ['add_80[0][0]']                 
                                                                                                  
 global_average_pooling1d_26 (G  (None, 192)         0           ['activation_161[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_26 (Globa  (None, 192)         0           ['activation_161[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_26 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_26[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_26[0][0]']
                                                                                                  
 dropout_52 (Dropout)           (None, 384)          0           ['concatenate_26[0][0]']         
                                                                                                  
 dense_26 (Dense)               (None, 64)           24640       ['dropout_52[0][0]']             
                                                                                                  
 dropout_53 (Dropout)           (None, 64)           0           ['dense_26[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_53[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_53[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 128,227
Trainable params: 126,883
Non-trainable params: 1,344
__________________________________________________________________________________________________
