Model: "model_60"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_30 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_360 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_30[0][0]'] 
                                                                                                  
 batch_normalization_360 (Batch  (None, 25, 16)      64          ['conv1d_360[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_360 (Activation)    (None, 25, 16)       0           ['batch_normalization_360[0][0]']
                                                                                                  
 spatial_dropout1d_180 (Spatial  (None, 25, 16)      0           ['activation_360[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_361 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_30[0][0]'] 
                                                                                                  
 max_pooling1d_180 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_180[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_361 (Batch  (None, 13, 16)      64          ['conv1d_361[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_180 (Add)                  (None, 13, 16)       0           ['max_pooling1d_180[0][0]',      
                                                                  'batch_normalization_361[0][0]']
                                                                                                  
 activation_361 (Activation)    (None, 13, 16)       0           ['add_180[0][0]']                
                                                                                                  
 conv1d_362 (Conv1D)            (None, 13, 32)       1568        ['activation_361[0][0]']         
                                                                                                  
 batch_normalization_362 (Batch  (None, 13, 32)      128         ['conv1d_362[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_362 (Activation)    (None, 13, 32)       0           ['batch_normalization_362[0][0]']
                                                                                                  
 spatial_dropout1d_181 (Spatial  (None, 13, 32)      0           ['activation_362[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_363 (Conv1D)            (None, 7, 32)        544         ['activation_361[0][0]']         
                                                                                                  
 max_pooling1d_181 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_181[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_363 (Batch  (None, 7, 32)       128         ['conv1d_363[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_181 (Add)                  (None, 7, 32)        0           ['max_pooling1d_181[0][0]',      
                                                                  'batch_normalization_363[0][0]']
                                                                                                  
 activation_363 (Activation)    (None, 7, 32)        0           ['add_181[0][0]']                
                                                                                                  
 conv1d_364 (Conv1D)            (None, 7, 64)        6208        ['activation_363[0][0]']         
                                                                                                  
 batch_normalization_364 (Batch  (None, 7, 64)       256         ['conv1d_364[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_364 (Activation)    (None, 7, 64)        0           ['batch_normalization_364[0][0]']
                                                                                                  
 spatial_dropout1d_182 (Spatial  (None, 7, 64)       0           ['activation_364[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_365 (Conv1D)            (None, 4, 64)        2112        ['activation_363[0][0]']         
                                                                                                  
 max_pooling1d_182 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_182[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_365 (Batch  (None, 4, 64)       256         ['conv1d_365[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_182 (Add)                  (None, 4, 64)        0           ['max_pooling1d_182[0][0]',      
                                                                  'batch_normalization_365[0][0]']
                                                                                                  
 activation_365 (Activation)    (None, 4, 64)        0           ['add_182[0][0]']                
                                                                                                  
 global_average_pooling1d_60 (G  (None, 64)          0           ['activation_365[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_60 (Globa  (None, 64)          0           ['activation_365[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_60 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_60[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_60[0][0]']
                                                                                                  
 dropout_120 (Dropout)          (None, 128)          0           ['concatenate_60[0][0]']         
                                                                                                  
 dense_60 (Dense)               (None, 128)          16512       ['dropout_120[0][0]']            
                                                                                                  
 dropout_121 (Dropout)          (None, 128)          0           ['dense_60[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_121[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_121[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 32,163
Trainable params: 31,715
Non-trainable params: 448
__________________________________________________________________________________________________
