Model: "model_65"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_32 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_390 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_32[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_390 (Batch  (None, 25, 16)      64          ['conv1d_390[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_390 (Activation)    (None, 25, 16)       0           ['batch_normalization_390[0][0]']
                                                                                                  
 spatial_dropout1d_195 (Spatial  (None, 25, 16)      0           ['activation_390[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_391 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_32[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_195 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_195[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_391 (Batch  (None, 13, 16)      64          ['conv1d_391[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_195 (Add)                  (None, 13, 16)       0           ['max_pooling1d_195[0][0]',      
                                                                  'batch_normalization_391[0][0]']
                                                                                                  
 activation_391 (Activation)    (None, 13, 16)       0           ['add_195[0][0]']                
                                                                                                  
 conv1d_392 (Conv1D)            (None, 13, 32)       1568        ['activation_391[0][0]']         
                                                                                                  
 batch_normalization_392 (Batch  (None, 13, 32)      128         ['conv1d_392[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_392 (Activation)    (None, 13, 32)       0           ['batch_normalization_392[0][0]']
                                                                                                  
 spatial_dropout1d_196 (Spatial  (None, 13, 32)      0           ['activation_392[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_393 (Conv1D)            (None, 7, 32)        544         ['activation_391[0][0]']         
                                                                                                  
 max_pooling1d_196 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_196[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_393 (Batch  (None, 7, 32)       128         ['conv1d_393[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_196 (Add)                  (None, 7, 32)        0           ['max_pooling1d_196[0][0]',      
                                                                  'batch_normalization_393[0][0]']
                                                                                                  
 activation_393 (Activation)    (None, 7, 32)        0           ['add_196[0][0]']                
                                                                                                  
 conv1d_394 (Conv1D)            (None, 7, 64)        6208        ['activation_393[0][0]']         
                                                                                                  
 batch_normalization_394 (Batch  (None, 7, 64)       256         ['conv1d_394[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_394 (Activation)    (None, 7, 64)        0           ['batch_normalization_394[0][0]']
                                                                                                  
 spatial_dropout1d_197 (Spatial  (None, 7, 64)       0           ['activation_394[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_395 (Conv1D)            (None, 4, 64)        2112        ['activation_393[0][0]']         
                                                                                                  
 max_pooling1d_197 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_197[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_395 (Batch  (None, 4, 64)       256         ['conv1d_395[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_197 (Add)                  (None, 4, 64)        0           ['max_pooling1d_197[0][0]',      
                                                                  'batch_normalization_395[0][0]']
                                                                                                  
 activation_395 (Activation)    (None, 4, 64)        0           ['add_197[0][0]']                
                                                                                                  
 global_average_pooling1d_65 (G  (None, 64)          0           ['activation_395[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_65 (Globa  (None, 64)          0           ['activation_395[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_65 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_65[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_65[0][0]']
                                                                                                  
 dropout_130 (Dropout)          (None, 128)          0           ['concatenate_65[0][0]']         
                                                                                                  
 dense_65 (Dense)               (None, 128)          16512       ['dropout_130[0][0]']            
                                                                                                  
 dropout_131 (Dropout)          (None, 128)          0           ['dense_65[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_131[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_131[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 39,971
Trainable params: 39,523
Non-trainable params: 448
__________________________________________________________________________________________________
