Model: "model_90"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_45 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_540 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_45[0][0]'] 
                                                                                                  
 batch_normalization_540 (Batch  (None, 25, 48)      192         ['conv1d_540[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_540 (Activation)    (None, 25, 48)       0           ['batch_normalization_540[0][0]']
                                                                                                  
 spatial_dropout1d_270 (Spatial  (None, 25, 48)      0           ['activation_540[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_541 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_45[0][0]'] 
                                                                                                  
 max_pooling1d_270 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_270[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_541 (Batch  (None, 13, 48)      192         ['conv1d_541[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_270 (Add)                  (None, 13, 48)       0           ['max_pooling1d_270[0][0]',      
                                                                  'batch_normalization_541[0][0]']
                                                                                                  
 activation_541 (Activation)    (None, 13, 48)       0           ['add_270[0][0]']                
                                                                                                  
 conv1d_542 (Conv1D)            (None, 13, 96)       13920       ['activation_541[0][0]']         
                                                                                                  
 batch_normalization_542 (Batch  (None, 13, 96)      384         ['conv1d_542[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_542 (Activation)    (None, 13, 96)       0           ['batch_normalization_542[0][0]']
                                                                                                  
 spatial_dropout1d_271 (Spatial  (None, 13, 96)      0           ['activation_542[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_543 (Conv1D)            (None, 7, 96)        4704        ['activation_541[0][0]']         
                                                                                                  
 max_pooling1d_271 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_271[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_543 (Batch  (None, 7, 96)       384         ['conv1d_543[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_271 (Add)                  (None, 7, 96)        0           ['max_pooling1d_271[0][0]',      
                                                                  'batch_normalization_543[0][0]']
                                                                                                  
 activation_543 (Activation)    (None, 7, 96)        0           ['add_271[0][0]']                
                                                                                                  
 conv1d_544 (Conv1D)            (None, 7, 192)       55488       ['activation_543[0][0]']         
                                                                                                  
 batch_normalization_544 (Batch  (None, 7, 192)      768         ['conv1d_544[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_544 (Activation)    (None, 7, 192)       0           ['batch_normalization_544[0][0]']
                                                                                                  
 spatial_dropout1d_272 (Spatial  (None, 7, 192)      0           ['activation_544[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_545 (Conv1D)            (None, 4, 192)       18624       ['activation_543[0][0]']         
                                                                                                  
 max_pooling1d_272 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_272[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_545 (Batch  (None, 4, 192)      768         ['conv1d_545[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_272 (Add)                  (None, 4, 192)       0           ['max_pooling1d_272[0][0]',      
                                                                  'batch_normalization_545[0][0]']
                                                                                                  
 activation_545 (Activation)    (None, 4, 192)       0           ['add_272[0][0]']                
                                                                                                  
 global_average_pooling1d_90 (G  (None, 192)         0           ['activation_545[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_90 (Globa  (None, 192)         0           ['activation_545[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_90 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_90[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_90[0][0]']
                                                                                                  
 dropout_180 (Dropout)          (None, 384)          0           ['concatenate_90[0][0]']         
                                                                                                  
 dense_90 (Dense)               (None, 128)          49280       ['dropout_180[0][0]']            
                                                                                                  
 dropout_181 (Dropout)          (None, 128)          0           ['dense_90[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_181[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_181[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 156,899
Trainable params: 155,555
Non-trainable params: 1,344
__________________________________________________________________________________________________
