Model: "model_28"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_13 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_168 (Conv1D)            (None, 25, 48)       39792       ['enhanced_preprocessing_13[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_168 (Batch  (None, 25, 48)      192         ['conv1d_168[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_168 (Activation)    (None, 25, 48)       0           ['batch_normalization_168[0][0]']
                                                                                                  
 spatial_dropout1d_84 (SpatialD  (None, 25, 48)      0           ['activation_168[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_169 (Conv1D)            (None, 13, 48)       13296       ['enhanced_preprocessing_13[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_84 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_84[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_169 (Batch  (None, 13, 48)      192         ['conv1d_169[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_84 (Add)                   (None, 13, 48)       0           ['max_pooling1d_84[0][0]',       
                                                                  'batch_normalization_169[0][0]']
                                                                                                  
 activation_169 (Activation)    (None, 13, 48)       0           ['add_84[0][0]']                 
                                                                                                  
 conv1d_170 (Conv1D)            (None, 13, 96)       13920       ['activation_169[0][0]']         
                                                                                                  
 batch_normalization_170 (Batch  (None, 13, 96)      384         ['conv1d_170[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_170 (Activation)    (None, 13, 96)       0           ['batch_normalization_170[0][0]']
                                                                                                  
 spatial_dropout1d_85 (SpatialD  (None, 13, 96)      0           ['activation_170[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_171 (Conv1D)            (None, 7, 96)        4704        ['activation_169[0][0]']         
                                                                                                  
 max_pooling1d_85 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_85[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_171 (Batch  (None, 7, 96)       384         ['conv1d_171[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_85 (Add)                   (None, 7, 96)        0           ['max_pooling1d_85[0][0]',       
                                                                  'batch_normalization_171[0][0]']
                                                                                                  
 activation_171 (Activation)    (None, 7, 96)        0           ['add_85[0][0]']                 
                                                                                                  
 conv1d_172 (Conv1D)            (None, 7, 192)       55488       ['activation_171[0][0]']         
                                                                                                  
 batch_normalization_172 (Batch  (None, 7, 192)      768         ['conv1d_172[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_172 (Activation)    (None, 7, 192)       0           ['batch_normalization_172[0][0]']
                                                                                                  
 spatial_dropout1d_86 (SpatialD  (None, 7, 192)      0           ['activation_172[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_173 (Conv1D)            (None, 4, 192)       18624       ['activation_171[0][0]']         
                                                                                                  
 max_pooling1d_86 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_86[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_173 (Batch  (None, 4, 192)      768         ['conv1d_173[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_86 (Add)                   (None, 4, 192)       0           ['max_pooling1d_86[0][0]',       
                                                                  'batch_normalization_173[0][0]']
                                                                                                  
 activation_173 (Activation)    (None, 4, 192)       0           ['add_86[0][0]']                 
                                                                                                  
 global_average_pooling1d_28 (G  (None, 192)         0           ['activation_173[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_28 (Globa  (None, 192)         0           ['activation_173[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_28 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_28[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_28[0][0]']
                                                                                                  
 dropout_56 (Dropout)           (None, 384)          0           ['concatenate_28[0][0]']         
                                                                                                  
 dense_28 (Dense)               (None, 128)          49280       ['dropout_56[0][0]']             
                                                                                                  
 dropout_57 (Dropout)           (None, 128)          0           ['dense_28[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_57[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_57[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 198,179
Trainable params: 196,835
Non-trainable params: 1,344
__________________________________________________________________________________________________
