Model: "model_22"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_10 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_132 (Conv1D)            (None, 25, 48)       39792       ['enhanced_preprocessing_10[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_132 (Batch  (None, 25, 48)      192         ['conv1d_132[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_132 (Activation)    (None, 25, 48)       0           ['batch_normalization_132[0][0]']
                                                                                                  
 spatial_dropout1d_66 (SpatialD  (None, 25, 48)      0           ['activation_132[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_133 (Conv1D)            (None, 13, 48)       13296       ['enhanced_preprocessing_10[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_66 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_66[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_133 (Batch  (None, 13, 48)      192         ['conv1d_133[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_66 (Add)                   (None, 13, 48)       0           ['max_pooling1d_66[0][0]',       
                                                                  'batch_normalization_133[0][0]']
                                                                                                  
 activation_133 (Activation)    (None, 13, 48)       0           ['add_66[0][0]']                 
                                                                                                  
 conv1d_134 (Conv1D)            (None, 13, 96)       13920       ['activation_133[0][0]']         
                                                                                                  
 batch_normalization_134 (Batch  (None, 13, 96)      384         ['conv1d_134[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_134 (Activation)    (None, 13, 96)       0           ['batch_normalization_134[0][0]']
                                                                                                  
 spatial_dropout1d_67 (SpatialD  (None, 13, 96)      0           ['activation_134[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_135 (Conv1D)            (None, 7, 96)        4704        ['activation_133[0][0]']         
                                                                                                  
 max_pooling1d_67 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_67[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_135 (Batch  (None, 7, 96)       384         ['conv1d_135[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_67 (Add)                   (None, 7, 96)        0           ['max_pooling1d_67[0][0]',       
                                                                  'batch_normalization_135[0][0]']
                                                                                                  
 activation_135 (Activation)    (None, 7, 96)        0           ['add_67[0][0]']                 
                                                                                                  
 conv1d_136 (Conv1D)            (None, 7, 192)       55488       ['activation_135[0][0]']         
                                                                                                  
 batch_normalization_136 (Batch  (None, 7, 192)      768         ['conv1d_136[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_136 (Activation)    (None, 7, 192)       0           ['batch_normalization_136[0][0]']
                                                                                                  
 spatial_dropout1d_68 (SpatialD  (None, 7, 192)      0           ['activation_136[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_137 (Conv1D)            (None, 4, 192)       18624       ['activation_135[0][0]']         
                                                                                                  
 max_pooling1d_68 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_68[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_137 (Batch  (None, 4, 192)      768         ['conv1d_137[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_68 (Add)                   (None, 4, 192)       0           ['max_pooling1d_68[0][0]',       
                                                                  'batch_normalization_137[0][0]']
                                                                                                  
 activation_137 (Activation)    (None, 4, 192)       0           ['add_68[0][0]']                 
                                                                                                  
 global_average_pooling1d_22 (G  (None, 192)         0           ['activation_137[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_22 (Globa  (None, 192)         0           ['activation_137[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_22 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_22[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_22[0][0]']
                                                                                                  
 dropout_44 (Dropout)           (None, 384)          0           ['concatenate_22[0][0]']         
                                                                                                  
 dense_22 (Dense)               (None, 64)           24640       ['dropout_44[0][0]']             
                                                                                                  
 dropout_45 (Dropout)           (None, 64)           0           ['dense_22[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_45[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_45[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 173,347
Trainable params: 172,003
Non-trainable params: 1,344
__________________________________________________________________________________________________
