Model: "model_73"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_37 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_438 (Conv1D)            (None, 25, 48)       8832        ['basic_preprocessing_37[0][0]'] 
                                                                                                  
 batch_normalization_438 (Batch  (None, 25, 48)      192         ['conv1d_438[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_438 (Activation)    (None, 25, 48)       0           ['batch_normalization_438[0][0]']
                                                                                                  
 spatial_dropout1d_219 (Spatial  (None, 25, 48)      0           ['activation_438[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_439 (Conv1D)            (None, 13, 48)       2976        ['basic_preprocessing_37[0][0]'] 
                                                                                                  
 max_pooling1d_219 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_219[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_439 (Batch  (None, 13, 48)      192         ['conv1d_439[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_219 (Add)                  (None, 13, 48)       0           ['max_pooling1d_219[0][0]',      
                                                                  'batch_normalization_439[0][0]']
                                                                                                  
 activation_439 (Activation)    (None, 13, 48)       0           ['add_219[0][0]']                
                                                                                                  
 conv1d_440 (Conv1D)            (None, 13, 96)       13920       ['activation_439[0][0]']         
                                                                                                  
 batch_normalization_440 (Batch  (None, 13, 96)      384         ['conv1d_440[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_440 (Activation)    (None, 13, 96)       0           ['batch_normalization_440[0][0]']
                                                                                                  
 spatial_dropout1d_220 (Spatial  (None, 13, 96)      0           ['activation_440[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_441 (Conv1D)            (None, 7, 96)        4704        ['activation_439[0][0]']         
                                                                                                  
 max_pooling1d_220 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_220[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_441 (Batch  (None, 7, 96)       384         ['conv1d_441[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_220 (Add)                  (None, 7, 96)        0           ['max_pooling1d_220[0][0]',      
                                                                  'batch_normalization_441[0][0]']
                                                                                                  
 activation_441 (Activation)    (None, 7, 96)        0           ['add_220[0][0]']                
                                                                                                  
 conv1d_442 (Conv1D)            (None, 7, 192)       55488       ['activation_441[0][0]']         
                                                                                                  
 batch_normalization_442 (Batch  (None, 7, 192)      768         ['conv1d_442[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_442 (Activation)    (None, 7, 192)       0           ['batch_normalization_442[0][0]']
                                                                                                  
 spatial_dropout1d_221 (Spatial  (None, 7, 192)      0           ['activation_442[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_443 (Conv1D)            (None, 4, 192)       18624       ['activation_441[0][0]']         
                                                                                                  
 max_pooling1d_221 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_221[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_443 (Batch  (None, 4, 192)      768         ['conv1d_443[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_221 (Add)                  (None, 4, 192)       0           ['max_pooling1d_221[0][0]',      
                                                                  'batch_normalization_443[0][0]']
                                                                                                  
 activation_443 (Activation)    (None, 4, 192)       0           ['add_221[0][0]']                
                                                                                                  
 global_average_pooling1d_73 (G  (None, 192)         0           ['activation_443[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_73 (Globa  (None, 192)         0           ['activation_443[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_73 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_73[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_73[0][0]']
                                                                                                  
 dropout_146 (Dropout)          (None, 384)          0           ['concatenate_73[0][0]']         
                                                                                                  
 dense_73 (Dense)               (None, 64)           24640       ['dropout_146[0][0]']            
                                                                                                  
 dropout_147 (Dropout)          (None, 64)           0           ['dense_73[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_147[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_147[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 132,067
Trainable params: 130,723
Non-trainable params: 1,344
__________________________________________________________________________________________________
