Model: "model_31"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_16 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_186 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_16[0][0]'] 
                                                                                                  
 batch_normalization_186 (Batch  (None, 25, 48)      192         ['conv1d_186[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_186 (Activation)    (None, 25, 48)       0           ['batch_normalization_186[0][0]']
                                                                                                  
 spatial_dropout1d_93 (SpatialD  (None, 25, 48)      0           ['activation_186[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_187 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_16[0][0]'] 
                                                                                                  
 max_pooling1d_93 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_93[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_187 (Batch  (None, 13, 48)      192         ['conv1d_187[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_93 (Add)                   (None, 13, 48)       0           ['max_pooling1d_93[0][0]',       
                                                                  'batch_normalization_187[0][0]']
                                                                                                  
 activation_187 (Activation)    (None, 13, 48)       0           ['add_93[0][0]']                 
                                                                                                  
 conv1d_188 (Conv1D)            (None, 13, 96)       13920       ['activation_187[0][0]']         
                                                                                                  
 batch_normalization_188 (Batch  (None, 13, 96)      384         ['conv1d_188[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_188 (Activation)    (None, 13, 96)       0           ['batch_normalization_188[0][0]']
                                                                                                  
 spatial_dropout1d_94 (SpatialD  (None, 13, 96)      0           ['activation_188[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_189 (Conv1D)            (None, 7, 96)        4704        ['activation_187[0][0]']         
                                                                                                  
 max_pooling1d_94 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_94[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_189 (Batch  (None, 7, 96)       384         ['conv1d_189[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_94 (Add)                   (None, 7, 96)        0           ['max_pooling1d_94[0][0]',       
                                                                  'batch_normalization_189[0][0]']
                                                                                                  
 activation_189 (Activation)    (None, 7, 96)        0           ['add_94[0][0]']                 
                                                                                                  
 conv1d_190 (Conv1D)            (None, 7, 192)       55488       ['activation_189[0][0]']         
                                                                                                  
 batch_normalization_190 (Batch  (None, 7, 192)      768         ['conv1d_190[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_190 (Activation)    (None, 7, 192)       0           ['batch_normalization_190[0][0]']
                                                                                                  
 spatial_dropout1d_95 (SpatialD  (None, 7, 192)      0           ['activation_190[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_191 (Conv1D)            (None, 4, 192)       18624       ['activation_189[0][0]']         
                                                                                                  
 max_pooling1d_95 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_95[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_191 (Batch  (None, 4, 192)      768         ['conv1d_191[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_95 (Add)                   (None, 4, 192)       0           ['max_pooling1d_95[0][0]',       
                                                                  'batch_normalization_191[0][0]']
                                                                                                  
 activation_191 (Activation)    (None, 4, 192)       0           ['add_95[0][0]']                 
                                                                                                  
 global_average_pooling1d_31 (G  (None, 192)         0           ['activation_191[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_31 (Globa  (None, 192)         0           ['activation_191[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_31 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_31[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_31[0][0]']
                                                                                                  
 dropout_62 (Dropout)           (None, 384)          0           ['concatenate_31[0][0]']         
                                                                                                  
 dense_31 (Dense)               (None, 64)           24640       ['dropout_62[0][0]']             
                                                                                                  
 dropout_63 (Dropout)           (None, 64)           0           ['dense_31[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_63[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_63[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 128,227
Trainable params: 126,883
Non-trainable params: 1,344
__________________________________________________________________________________________________
