Model: "model_67"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_34 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_402 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_34[0][0]'] 
                                                                                                  
 batch_normalization_402 (Batch  (None, 25, 16)      64          ['conv1d_402[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_402 (Activation)    (None, 25, 16)       0           ['batch_normalization_402[0][0]']
                                                                                                  
 spatial_dropout1d_201 (Spatial  (None, 25, 16)      0           ['activation_402[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_403 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_34[0][0]'] 
                                                                                                  
 max_pooling1d_201 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_201[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_403 (Batch  (None, 13, 16)      64          ['conv1d_403[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_201 (Add)                  (None, 13, 16)       0           ['max_pooling1d_201[0][0]',      
                                                                  'batch_normalization_403[0][0]']
                                                                                                  
 activation_403 (Activation)    (None, 13, 16)       0           ['add_201[0][0]']                
                                                                                                  
 conv1d_404 (Conv1D)            (None, 13, 32)       1568        ['activation_403[0][0]']         
                                                                                                  
 batch_normalization_404 (Batch  (None, 13, 32)      128         ['conv1d_404[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_404 (Activation)    (None, 13, 32)       0           ['batch_normalization_404[0][0]']
                                                                                                  
 spatial_dropout1d_202 (Spatial  (None, 13, 32)      0           ['activation_404[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_405 (Conv1D)            (None, 7, 32)        544         ['activation_403[0][0]']         
                                                                                                  
 max_pooling1d_202 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_202[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_405 (Batch  (None, 7, 32)       128         ['conv1d_405[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_202 (Add)                  (None, 7, 32)        0           ['max_pooling1d_202[0][0]',      
                                                                  'batch_normalization_405[0][0]']
                                                                                                  
 activation_405 (Activation)    (None, 7, 32)        0           ['add_202[0][0]']                
                                                                                                  
 conv1d_406 (Conv1D)            (None, 7, 64)        6208        ['activation_405[0][0]']         
                                                                                                  
 batch_normalization_406 (Batch  (None, 7, 64)       256         ['conv1d_406[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_406 (Activation)    (None, 7, 64)        0           ['batch_normalization_406[0][0]']
                                                                                                  
 spatial_dropout1d_203 (Spatial  (None, 7, 64)       0           ['activation_406[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_407 (Conv1D)            (None, 4, 64)        2112        ['activation_405[0][0]']         
                                                                                                  
 max_pooling1d_203 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_203[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_407 (Batch  (None, 4, 64)       256         ['conv1d_407[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_203 (Add)                  (None, 4, 64)        0           ['max_pooling1d_203[0][0]',      
                                                                  'batch_normalization_407[0][0]']
                                                                                                  
 activation_407 (Activation)    (None, 4, 64)        0           ['add_203[0][0]']                
                                                                                                  
 global_average_pooling1d_67 (G  (None, 64)          0           ['activation_407[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_67 (Globa  (None, 64)          0           ['activation_407[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_67 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_67[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_67[0][0]']
                                                                                                  
 dropout_134 (Dropout)          (None, 128)          0           ['concatenate_67[0][0]']         
                                                                                                  
 dense_67 (Dense)               (None, 128)          16512       ['dropout_134[0][0]']            
                                                                                                  
 dropout_135 (Dropout)          (None, 128)          0           ['dense_67[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_135[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_135[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 32,163
Trainable params: 31,715
Non-trainable params: 448
__________________________________________________________________________________________________
