Model: "model_14"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_8 (BasicPr  (None, 25, 92)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_84 (Conv1D)             (None, 25, 48)       13296       ['basic_preprocessing_8[0][0]']  
                                                                                                  
 batch_normalization_84 (BatchN  (None, 25, 48)      192         ['conv1d_84[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_84 (Activation)     (None, 25, 48)       0           ['batch_normalization_84[0][0]'] 
                                                                                                  
 spatial_dropout1d_42 (SpatialD  (None, 25, 48)      0           ['activation_84[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_85 (Conv1D)             (None, 13, 48)       4464        ['basic_preprocessing_8[0][0]']  
                                                                                                  
 max_pooling1d_42 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_42[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_85 (BatchN  (None, 13, 48)      192         ['conv1d_85[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_42 (Add)                   (None, 13, 48)       0           ['max_pooling1d_42[0][0]',       
                                                                  'batch_normalization_85[0][0]'] 
                                                                                                  
 activation_85 (Activation)     (None, 13, 48)       0           ['add_42[0][0]']                 
                                                                                                  
 conv1d_86 (Conv1D)             (None, 13, 96)       13920       ['activation_85[0][0]']          
                                                                                                  
 batch_normalization_86 (BatchN  (None, 13, 96)      384         ['conv1d_86[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_86 (Activation)     (None, 13, 96)       0           ['batch_normalization_86[0][0]'] 
                                                                                                  
 spatial_dropout1d_43 (SpatialD  (None, 13, 96)      0           ['activation_86[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_87 (Conv1D)             (None, 7, 96)        4704        ['activation_85[0][0]']          
                                                                                                  
 max_pooling1d_43 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_43[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_87 (BatchN  (None, 7, 96)       384         ['conv1d_87[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_43 (Add)                   (None, 7, 96)        0           ['max_pooling1d_43[0][0]',       
                                                                  'batch_normalization_87[0][0]'] 
                                                                                                  
 activation_87 (Activation)     (None, 7, 96)        0           ['add_43[0][0]']                 
                                                                                                  
 conv1d_88 (Conv1D)             (None, 7, 192)       55488       ['activation_87[0][0]']          
                                                                                                  
 batch_normalization_88 (BatchN  (None, 7, 192)      768         ['conv1d_88[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_88 (Activation)     (None, 7, 192)       0           ['batch_normalization_88[0][0]'] 
                                                                                                  
 spatial_dropout1d_44 (SpatialD  (None, 7, 192)      0           ['activation_88[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_89 (Conv1D)             (None, 4, 192)       18624       ['activation_87[0][0]']          
                                                                                                  
 max_pooling1d_44 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_44[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_89 (BatchN  (None, 4, 192)      768         ['conv1d_89[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_44 (Add)                   (None, 4, 192)       0           ['max_pooling1d_44[0][0]',       
                                                                  'batch_normalization_89[0][0]'] 
                                                                                                  
 activation_89 (Activation)     (None, 4, 192)       0           ['add_44[0][0]']                 
                                                                                                  
 global_average_pooling1d_14 (G  (None, 192)         0           ['activation_89[0][0]']          
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_14 (Globa  (None, 192)         0           ['activation_89[0][0]']          
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_14 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_14[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_14[0][0]']
                                                                                                  
 dropout_28 (Dropout)           (None, 384)          0           ['concatenate_14[0][0]']         
                                                                                                  
 dense_14 (Dense)               (None, 64)           24640       ['dropout_28[0][0]']             
                                                                                                  
 dropout_29 (Dropout)           (None, 64)           0           ['dense_14[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_29[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_29[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 138,019
Trainable params: 136,675
Non-trainable params: 1,344
__________________________________________________________________________________________________
