Model: "model_29"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_14 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_174 (Conv1D)            (None, 25, 48)       17760       ['enhanced_preprocessing_14[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_174 (Batch  (None, 25, 48)      192         ['conv1d_174[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_174 (Activation)    (None, 25, 48)       0           ['batch_normalization_174[0][0]']
                                                                                                  
 spatial_dropout1d_87 (SpatialD  (None, 25, 48)      0           ['activation_174[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_175 (Conv1D)            (None, 13, 48)       5952        ['enhanced_preprocessing_14[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_87 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_87[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_175 (Batch  (None, 13, 48)      192         ['conv1d_175[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_87 (Add)                   (None, 13, 48)       0           ['max_pooling1d_87[0][0]',       
                                                                  'batch_normalization_175[0][0]']
                                                                                                  
 activation_175 (Activation)    (None, 13, 48)       0           ['add_87[0][0]']                 
                                                                                                  
 conv1d_176 (Conv1D)            (None, 13, 96)       13920       ['activation_175[0][0]']         
                                                                                                  
 batch_normalization_176 (Batch  (None, 13, 96)      384         ['conv1d_176[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_176 (Activation)    (None, 13, 96)       0           ['batch_normalization_176[0][0]']
                                                                                                  
 spatial_dropout1d_88 (SpatialD  (None, 13, 96)      0           ['activation_176[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_177 (Conv1D)            (None, 7, 96)        4704        ['activation_175[0][0]']         
                                                                                                  
 max_pooling1d_88 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_88[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_177 (Batch  (None, 7, 96)       384         ['conv1d_177[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_88 (Add)                   (None, 7, 96)        0           ['max_pooling1d_88[0][0]',       
                                                                  'batch_normalization_177[0][0]']
                                                                                                  
 activation_177 (Activation)    (None, 7, 96)        0           ['add_88[0][0]']                 
                                                                                                  
 conv1d_178 (Conv1D)            (None, 7, 192)       55488       ['activation_177[0][0]']         
                                                                                                  
 batch_normalization_178 (Batch  (None, 7, 192)      768         ['conv1d_178[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_178 (Activation)    (None, 7, 192)       0           ['batch_normalization_178[0][0]']
                                                                                                  
 spatial_dropout1d_89 (SpatialD  (None, 7, 192)      0           ['activation_178[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_179 (Conv1D)            (None, 4, 192)       18624       ['activation_177[0][0]']         
                                                                                                  
 max_pooling1d_89 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_89[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_179 (Batch  (None, 4, 192)      768         ['conv1d_179[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_89 (Add)                   (None, 4, 192)       0           ['max_pooling1d_89[0][0]',       
                                                                  'batch_normalization_179[0][0]']
                                                                                                  
 activation_179 (Activation)    (None, 4, 192)       0           ['add_89[0][0]']                 
                                                                                                  
 global_average_pooling1d_29 (G  (None, 192)         0           ['activation_179[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_29 (Globa  (None, 192)         0           ['activation_179[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_29 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_29[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_29[0][0]']
                                                                                                  
 dropout_58 (Dropout)           (None, 384)          0           ['concatenate_29[0][0]']         
                                                                                                  
 dense_29 (Dense)               (None, 64)           24640       ['dropout_58[0][0]']             
                                                                                                  
 dropout_59 (Dropout)           (None, 64)           0           ['dense_29[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_59[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_59[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 143,971
Trainable params: 142,627
Non-trainable params: 1,344
__________________________________________________________________________________________________
