Model: "model_43"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_22 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_258 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_22[0][0]'] 
                                                                                                  
 batch_normalization_258 (Batch  (None, 25, 48)      192         ['conv1d_258[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_258 (Activation)    (None, 25, 48)       0           ['batch_normalization_258[0][0]']
                                                                                                  
 spatial_dropout1d_129 (Spatial  (None, 25, 48)      0           ['activation_258[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_259 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_22[0][0]'] 
                                                                                                  
 max_pooling1d_129 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_129[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_259 (Batch  (None, 13, 48)      192         ['conv1d_259[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_129 (Add)                  (None, 13, 48)       0           ['max_pooling1d_129[0][0]',      
                                                                  'batch_normalization_259[0][0]']
                                                                                                  
 activation_259 (Activation)    (None, 13, 48)       0           ['add_129[0][0]']                
                                                                                                  
 conv1d_260 (Conv1D)            (None, 13, 96)       13920       ['activation_259[0][0]']         
                                                                                                  
 batch_normalization_260 (Batch  (None, 13, 96)      384         ['conv1d_260[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_260 (Activation)    (None, 13, 96)       0           ['batch_normalization_260[0][0]']
                                                                                                  
 spatial_dropout1d_130 (Spatial  (None, 13, 96)      0           ['activation_260[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_261 (Conv1D)            (None, 7, 96)        4704        ['activation_259[0][0]']         
                                                                                                  
 max_pooling1d_130 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_130[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_261 (Batch  (None, 7, 96)       384         ['conv1d_261[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_130 (Add)                  (None, 7, 96)        0           ['max_pooling1d_130[0][0]',      
                                                                  'batch_normalization_261[0][0]']
                                                                                                  
 activation_261 (Activation)    (None, 7, 96)        0           ['add_130[0][0]']                
                                                                                                  
 conv1d_262 (Conv1D)            (None, 7, 192)       55488       ['activation_261[0][0]']         
                                                                                                  
 batch_normalization_262 (Batch  (None, 7, 192)      768         ['conv1d_262[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_262 (Activation)    (None, 7, 192)       0           ['batch_normalization_262[0][0]']
                                                                                                  
 spatial_dropout1d_131 (Spatial  (None, 7, 192)      0           ['activation_262[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_263 (Conv1D)            (None, 4, 192)       18624       ['activation_261[0][0]']         
                                                                                                  
 max_pooling1d_131 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_131[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_263 (Batch  (None, 4, 192)      768         ['conv1d_263[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_131 (Add)                  (None, 4, 192)       0           ['max_pooling1d_131[0][0]',      
                                                                  'batch_normalization_263[0][0]']
                                                                                                  
 activation_263 (Activation)    (None, 4, 192)       0           ['add_131[0][0]']                
                                                                                                  
 global_average_pooling1d_43 (G  (None, 192)         0           ['activation_263[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_43 (Globa  (None, 192)         0           ['activation_263[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_43 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_43[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_43[0][0]']
                                                                                                  
 dropout_86 (Dropout)           (None, 384)          0           ['concatenate_43[0][0]']         
                                                                                                  
 dense_43 (Dense)               (None, 128)          49280       ['dropout_86[0][0]']             
                                                                                                  
 dropout_87 (Dropout)           (None, 128)          0           ['dense_43[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_87[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_87[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 153,059
Trainable params: 151,715
Non-trainable params: 1,344
__________________________________________________________________________________________________
