Model: "model_25"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_13 (BasicP  (None, 25, 41)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_150 (Conv1D)            (None, 25, 48)       5952        ['basic_preprocessing_13[0][0]'] 
                                                                                                  
 batch_normalization_150 (Batch  (None, 25, 48)      192         ['conv1d_150[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_150 (Activation)    (None, 25, 48)       0           ['batch_normalization_150[0][0]']
                                                                                                  
 spatial_dropout1d_75 (SpatialD  (None, 25, 48)      0           ['activation_150[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_151 (Conv1D)            (None, 13, 48)       2016        ['basic_preprocessing_13[0][0]'] 
                                                                                                  
 max_pooling1d_75 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_75[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_151 (Batch  (None, 13, 48)      192         ['conv1d_151[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_75 (Add)                   (None, 13, 48)       0           ['max_pooling1d_75[0][0]',       
                                                                  'batch_normalization_151[0][0]']
                                                                                                  
 activation_151 (Activation)    (None, 13, 48)       0           ['add_75[0][0]']                 
                                                                                                  
 conv1d_152 (Conv1D)            (None, 13, 96)       13920       ['activation_151[0][0]']         
                                                                                                  
 batch_normalization_152 (Batch  (None, 13, 96)      384         ['conv1d_152[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_152 (Activation)    (None, 13, 96)       0           ['batch_normalization_152[0][0]']
                                                                                                  
 spatial_dropout1d_76 (SpatialD  (None, 13, 96)      0           ['activation_152[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_153 (Conv1D)            (None, 7, 96)        4704        ['activation_151[0][0]']         
                                                                                                  
 max_pooling1d_76 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_76[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_153 (Batch  (None, 7, 96)       384         ['conv1d_153[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_76 (Add)                   (None, 7, 96)        0           ['max_pooling1d_76[0][0]',       
                                                                  'batch_normalization_153[0][0]']
                                                                                                  
 activation_153 (Activation)    (None, 7, 96)        0           ['add_76[0][0]']                 
                                                                                                  
 conv1d_154 (Conv1D)            (None, 7, 192)       55488       ['activation_153[0][0]']         
                                                                                                  
 batch_normalization_154 (Batch  (None, 7, 192)      768         ['conv1d_154[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_154 (Activation)    (None, 7, 192)       0           ['batch_normalization_154[0][0]']
                                                                                                  
 spatial_dropout1d_77 (SpatialD  (None, 7, 192)      0           ['activation_154[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_155 (Conv1D)            (None, 4, 192)       18624       ['activation_153[0][0]']         
                                                                                                  
 max_pooling1d_77 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_77[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_155 (Batch  (None, 4, 192)      768         ['conv1d_155[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_77 (Add)                   (None, 4, 192)       0           ['max_pooling1d_77[0][0]',       
                                                                  'batch_normalization_155[0][0]']
                                                                                                  
 activation_155 (Activation)    (None, 4, 192)       0           ['add_77[0][0]']                 
                                                                                                  
 global_average_pooling1d_25 (G  (None, 192)         0           ['activation_155[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_25 (Globa  (None, 192)         0           ['activation_155[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_25 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_25[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_25[0][0]']
                                                                                                  
 dropout_50 (Dropout)           (None, 384)          0           ['concatenate_25[0][0]']         
                                                                                                  
 dense_25 (Dense)               (None, 64)           24640       ['dropout_50[0][0]']             
                                                                                                  
 dropout_51 (Dropout)           (None, 64)           0           ['dense_25[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_51[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_51[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 128,227
Trainable params: 126,883
Non-trainable params: 1,344
__________________________________________________________________________________________________
