Model: "model_40"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_19 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_240 (Conv1D)            (None, 25, 48)       17760       ['enhanced_preprocessing_19[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_240 (Batch  (None, 25, 48)      192         ['conv1d_240[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_240 (Activation)    (None, 25, 48)       0           ['batch_normalization_240[0][0]']
                                                                                                  
 spatial_dropout1d_120 (Spatial  (None, 25, 48)      0           ['activation_240[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_241 (Conv1D)            (None, 13, 48)       5952        ['enhanced_preprocessing_19[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_120 (MaxPooling1  (None, 13, 48)      0           ['spatial_dropout1d_120[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_241 (Batch  (None, 13, 48)      192         ['conv1d_241[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_120 (Add)                  (None, 13, 48)       0           ['max_pooling1d_120[0][0]',      
                                                                  'batch_normalization_241[0][0]']
                                                                                                  
 activation_241 (Activation)    (None, 13, 48)       0           ['add_120[0][0]']                
                                                                                                  
 conv1d_242 (Conv1D)            (None, 13, 96)       13920       ['activation_241[0][0]']         
                                                                                                  
 batch_normalization_242 (Batch  (None, 13, 96)      384         ['conv1d_242[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_242 (Activation)    (None, 13, 96)       0           ['batch_normalization_242[0][0]']
                                                                                                  
 spatial_dropout1d_121 (Spatial  (None, 13, 96)      0           ['activation_242[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_243 (Conv1D)            (None, 7, 96)        4704        ['activation_241[0][0]']         
                                                                                                  
 max_pooling1d_121 (MaxPooling1  (None, 7, 96)       0           ['spatial_dropout1d_121[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_243 (Batch  (None, 7, 96)       384         ['conv1d_243[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_121 (Add)                  (None, 7, 96)        0           ['max_pooling1d_121[0][0]',      
                                                                  'batch_normalization_243[0][0]']
                                                                                                  
 activation_243 (Activation)    (None, 7, 96)        0           ['add_121[0][0]']                
                                                                                                  
 conv1d_244 (Conv1D)            (None, 7, 192)       55488       ['activation_243[0][0]']         
                                                                                                  
 batch_normalization_244 (Batch  (None, 7, 192)      768         ['conv1d_244[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_244 (Activation)    (None, 7, 192)       0           ['batch_normalization_244[0][0]']
                                                                                                  
 spatial_dropout1d_122 (Spatial  (None, 7, 192)      0           ['activation_244[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_245 (Conv1D)            (None, 4, 192)       18624       ['activation_243[0][0]']         
                                                                                                  
 max_pooling1d_122 (MaxPooling1  (None, 4, 192)      0           ['spatial_dropout1d_122[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_245 (Batch  (None, 4, 192)      768         ['conv1d_245[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_122 (Add)                  (None, 4, 192)       0           ['max_pooling1d_122[0][0]',      
                                                                  'batch_normalization_245[0][0]']
                                                                                                  
 activation_245 (Activation)    (None, 4, 192)       0           ['add_122[0][0]']                
                                                                                                  
 global_average_pooling1d_40 (G  (None, 192)         0           ['activation_245[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_40 (Globa  (None, 192)         0           ['activation_245[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_40 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_40[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_40[0][0]']
                                                                                                  
 dropout_80 (Dropout)           (None, 384)          0           ['concatenate_40[0][0]']         
                                                                                                  
 dense_40 (Dense)               (None, 128)          49280       ['dropout_80[0][0]']             
                                                                                                  
 dropout_81 (Dropout)           (None, 128)          0           ['dense_40[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_81[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_81[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 168,803
Trainable params: 167,459
Non-trainable params: 1,344
__________________________________________________________________________________________________
