Model: "model_7"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_4 (BasicPr  (None, 25, 92)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_42 (Conv1D)             (None, 25, 16)       4432        ['basic_preprocessing_4[0][0]']  
                                                                                                  
 batch_normalization_42 (BatchN  (None, 25, 16)      64          ['conv1d_42[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_42 (Activation)     (None, 25, 16)       0           ['batch_normalization_42[0][0]'] 
                                                                                                  
 spatial_dropout1d_21 (SpatialD  (None, 25, 16)      0           ['activation_42[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_43 (Conv1D)             (None, 13, 16)       1488        ['basic_preprocessing_4[0][0]']  
                                                                                                  
 max_pooling1d_21 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_21[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_43 (BatchN  (None, 13, 16)      64          ['conv1d_43[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_21 (Add)                   (None, 13, 16)       0           ['max_pooling1d_21[0][0]',       
                                                                  'batch_normalization_43[0][0]'] 
                                                                                                  
 activation_43 (Activation)     (None, 13, 16)       0           ['add_21[0][0]']                 
                                                                                                  
 conv1d_44 (Conv1D)             (None, 13, 32)       1568        ['activation_43[0][0]']          
                                                                                                  
 batch_normalization_44 (BatchN  (None, 13, 32)      128         ['conv1d_44[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_44 (Activation)     (None, 13, 32)       0           ['batch_normalization_44[0][0]'] 
                                                                                                  
 spatial_dropout1d_22 (SpatialD  (None, 13, 32)      0           ['activation_44[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_45 (Conv1D)             (None, 7, 32)        544         ['activation_43[0][0]']          
                                                                                                  
 max_pooling1d_22 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_22[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_45 (BatchN  (None, 7, 32)       128         ['conv1d_45[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_22 (Add)                   (None, 7, 32)        0           ['max_pooling1d_22[0][0]',       
                                                                  'batch_normalization_45[0][0]'] 
                                                                                                  
 activation_45 (Activation)     (None, 7, 32)        0           ['add_22[0][0]']                 
                                                                                                  
 conv1d_46 (Conv1D)             (None, 7, 64)        6208        ['activation_45[0][0]']          
                                                                                                  
 batch_normalization_46 (BatchN  (None, 7, 64)       256         ['conv1d_46[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_46 (Activation)     (None, 7, 64)        0           ['batch_normalization_46[0][0]'] 
                                                                                                  
 spatial_dropout1d_23 (SpatialD  (None, 7, 64)       0           ['activation_46[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_47 (Conv1D)             (None, 4, 64)        2112        ['activation_45[0][0]']          
                                                                                                  
 max_pooling1d_23 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_23[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_47 (BatchN  (None, 4, 64)       256         ['conv1d_47[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_23 (Add)                   (None, 4, 64)        0           ['max_pooling1d_23[0][0]',       
                                                                  'batch_normalization_47[0][0]'] 
                                                                                                  
 activation_47 (Activation)     (None, 4, 64)        0           ['add_23[0][0]']                 
                                                                                                  
 global_average_pooling1d_7 (Gl  (None, 64)          0           ['activation_47[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_7 (Global  (None, 64)          0           ['activation_47[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_7 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_7[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_7[0][0]'] 
                                                                                                  
 dropout_14 (Dropout)           (None, 128)          0           ['concatenate_7[0][0]']          
                                                                                                  
 dense_7 (Dense)                (None, 128)          16512       ['dropout_14[0][0]']             
                                                                                                  
 dropout_15 (Dropout)           (None, 128)          0           ['dense_7[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_15[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_15[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 34,147
Trainable params: 33,699
Non-trainable params: 448
__________________________________________________________________________________________________
