Model: "model_5"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_2 (Enha  (None, 25, 123)     0           ['input[0][0]']                  
 ncedPreprocessing)                                                                               
                                                                                                  
 conv1d_30 (Conv1D)             (None, 25, 16)       5920        ['enhanced_preprocessing_2[0][0]'
                                                                 ]                                
                                                                                                  
 batch_normalization_30 (BatchN  (None, 25, 16)      64          ['conv1d_30[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_30 (Activation)     (None, 25, 16)       0           ['batch_normalization_30[0][0]'] 
                                                                                                  
 spatial_dropout1d_15 (SpatialD  (None, 25, 16)      0           ['activation_30[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_31 (Conv1D)             (None, 13, 16)       1984        ['enhanced_preprocessing_2[0][0]'
                                                                 ]                                
                                                                                                  
 max_pooling1d_15 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_15[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_31 (BatchN  (None, 13, 16)      64          ['conv1d_31[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_15 (Add)                   (None, 13, 16)       0           ['max_pooling1d_15[0][0]',       
                                                                  'batch_normalization_31[0][0]'] 
                                                                                                  
 activation_31 (Activation)     (None, 13, 16)       0           ['add_15[0][0]']                 
                                                                                                  
 conv1d_32 (Conv1D)             (None, 13, 32)       1568        ['activation_31[0][0]']          
                                                                                                  
 batch_normalization_32 (BatchN  (None, 13, 32)      128         ['conv1d_32[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_32 (Activation)     (None, 13, 32)       0           ['batch_normalization_32[0][0]'] 
                                                                                                  
 spatial_dropout1d_16 (SpatialD  (None, 13, 32)      0           ['activation_32[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_33 (Conv1D)             (None, 7, 32)        544         ['activation_31[0][0]']          
                                                                                                  
 max_pooling1d_16 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_16[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_33 (BatchN  (None, 7, 32)       128         ['conv1d_33[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_16 (Add)                   (None, 7, 32)        0           ['max_pooling1d_16[0][0]',       
                                                                  'batch_normalization_33[0][0]'] 
                                                                                                  
 activation_33 (Activation)     (None, 7, 32)        0           ['add_16[0][0]']                 
                                                                                                  
 conv1d_34 (Conv1D)             (None, 7, 64)        6208        ['activation_33[0][0]']          
                                                                                                  
 batch_normalization_34 (BatchN  (None, 7, 64)       256         ['conv1d_34[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_34 (Activation)     (None, 7, 64)        0           ['batch_normalization_34[0][0]'] 
                                                                                                  
 spatial_dropout1d_17 (SpatialD  (None, 7, 64)       0           ['activation_34[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_35 (Conv1D)             (None, 4, 64)        2112        ['activation_33[0][0]']          
                                                                                                  
 max_pooling1d_17 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_17[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_35 (BatchN  (None, 4, 64)       256         ['conv1d_35[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_17 (Add)                   (None, 4, 64)        0           ['max_pooling1d_17[0][0]',       
                                                                  'batch_normalization_35[0][0]'] 
                                                                                                  
 activation_35 (Activation)     (None, 4, 64)        0           ['add_17[0][0]']                 
                                                                                                  
 global_average_pooling1d_5 (Gl  (None, 64)          0           ['activation_35[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_5 (Global  (None, 64)          0           ['activation_35[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_5 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_5[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_5[0][0]'] 
                                                                                                  
 dropout_10 (Dropout)           (None, 128)          0           ['concatenate_5[0][0]']          
                                                                                                  
 dense_5 (Dense)                (None, 64)           8256        ['dropout_10[0][0]']             
                                                                                                  
 dropout_11 (Dropout)           (None, 64)           0           ['dense_5[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_11[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_11[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 27,683
Trainable params: 27,235
Non-trainable params: 448
__________________________________________________________________________________________________
