Model: "model_8"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 basic_preprocessing_5 (BasicPr  (None, 25, 41)      0           ['input[0][0]']                  
 eprocessing)                                                                                     
                                                                                                  
 conv1d_48 (Conv1D)             (None, 25, 16)       1984        ['basic_preprocessing_5[0][0]']  
                                                                                                  
 batch_normalization_48 (BatchN  (None, 25, 16)      64          ['conv1d_48[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_48 (Activation)     (None, 25, 16)       0           ['batch_normalization_48[0][0]'] 
                                                                                                  
 spatial_dropout1d_24 (SpatialD  (None, 25, 16)      0           ['activation_48[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_49 (Conv1D)             (None, 13, 16)       672         ['basic_preprocessing_5[0][0]']  
                                                                                                  
 max_pooling1d_24 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_24[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_49 (BatchN  (None, 13, 16)      64          ['conv1d_49[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_24 (Add)                   (None, 13, 16)       0           ['max_pooling1d_24[0][0]',       
                                                                  'batch_normalization_49[0][0]'] 
                                                                                                  
 activation_49 (Activation)     (None, 13, 16)       0           ['add_24[0][0]']                 
                                                                                                  
 conv1d_50 (Conv1D)             (None, 13, 32)       1568        ['activation_49[0][0]']          
                                                                                                  
 batch_normalization_50 (BatchN  (None, 13, 32)      128         ['conv1d_50[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_50 (Activation)     (None, 13, 32)       0           ['batch_normalization_50[0][0]'] 
                                                                                                  
 spatial_dropout1d_25 (SpatialD  (None, 13, 32)      0           ['activation_50[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_51 (Conv1D)             (None, 7, 32)        544         ['activation_49[0][0]']          
                                                                                                  
 max_pooling1d_25 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_25[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_51 (BatchN  (None, 7, 32)       128         ['conv1d_51[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_25 (Add)                   (None, 7, 32)        0           ['max_pooling1d_25[0][0]',       
                                                                  'batch_normalization_51[0][0]'] 
                                                                                                  
 activation_51 (Activation)     (None, 7, 32)        0           ['add_25[0][0]']                 
                                                                                                  
 conv1d_52 (Conv1D)             (None, 7, 64)        6208        ['activation_51[0][0]']          
                                                                                                  
 batch_normalization_52 (BatchN  (None, 7, 64)       256         ['conv1d_52[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 activation_52 (Activation)     (None, 7, 64)        0           ['batch_normalization_52[0][0]'] 
                                                                                                  
 spatial_dropout1d_26 (SpatialD  (None, 7, 64)       0           ['activation_52[0][0]']          
 ropout1D)                                                                                        
                                                                                                  
 conv1d_53 (Conv1D)             (None, 4, 64)        2112        ['activation_51[0][0]']          
                                                                                                  
 max_pooling1d_26 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_26[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_53 (BatchN  (None, 4, 64)       256         ['conv1d_53[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 add_26 (Add)                   (None, 4, 64)        0           ['max_pooling1d_26[0][0]',       
                                                                  'batch_normalization_53[0][0]'] 
                                                                                                  
 activation_53 (Activation)     (None, 4, 64)        0           ['add_26[0][0]']                 
                                                                                                  
 global_average_pooling1d_8 (Gl  (None, 64)          0           ['activation_53[0][0]']          
 obalAveragePooling1D)                                                                            
                                                                                                  
 global_max_pooling1d_8 (Global  (None, 64)          0           ['activation_53[0][0]']          
 MaxPooling1D)                                                                                    
                                                                                                  
 concatenate_8 (Concatenate)    (None, 128)          0           ['global_average_pooling1d_8[0][0
                                                                 ]',                              
                                                                  'global_max_pooling1d_8[0][0]'] 
                                                                                                  
 dropout_16 (Dropout)           (None, 128)          0           ['concatenate_8[0][0]']          
                                                                                                  
 dense_8 (Dense)                (None, 64)           8256        ['dropout_16[0][0]']             
                                                                                                  
 dropout_17 (Dropout)           (None, 64)           0           ['dense_8[0][0]']                
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_17[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_17[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 22,435
Trainable params: 21,987
Non-trainable params: 448
__________________________________________________________________________________________________
