Model: "model_30"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 basic_preprocessing_15 (BasicP  (None, 25, 92)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_180 (Conv1D)            (None, 25, 48)       13296       ['basic_preprocessing_15[0][0]'] 
                                                                                                  
 batch_normalization_180 (Batch  (None, 25, 48)      192         ['conv1d_180[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_180 (Activation)    (None, 25, 48)       0           ['batch_normalization_180[0][0]']
                                                                                                  
 spatial_dropout1d_90 (SpatialD  (None, 25, 48)      0           ['activation_180[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_181 (Conv1D)            (None, 13, 48)       4464        ['basic_preprocessing_15[0][0]'] 
                                                                                                  
 max_pooling1d_90 (MaxPooling1D  (None, 13, 48)      0           ['spatial_dropout1d_90[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_181 (Batch  (None, 13, 48)      192         ['conv1d_181[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_90 (Add)                   (None, 13, 48)       0           ['max_pooling1d_90[0][0]',       
                                                                  'batch_normalization_181[0][0]']
                                                                                                  
 activation_181 (Activation)    (None, 13, 48)       0           ['add_90[0][0]']                 
                                                                                                  
 conv1d_182 (Conv1D)            (None, 13, 96)       13920       ['activation_181[0][0]']         
                                                                                                  
 batch_normalization_182 (Batch  (None, 13, 96)      384         ['conv1d_182[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_182 (Activation)    (None, 13, 96)       0           ['batch_normalization_182[0][0]']
                                                                                                  
 spatial_dropout1d_91 (SpatialD  (None, 13, 96)      0           ['activation_182[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_183 (Conv1D)            (None, 7, 96)        4704        ['activation_181[0][0]']         
                                                                                                  
 max_pooling1d_91 (MaxPooling1D  (None, 7, 96)       0           ['spatial_dropout1d_91[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_183 (Batch  (None, 7, 96)       384         ['conv1d_183[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_91 (Add)                   (None, 7, 96)        0           ['max_pooling1d_91[0][0]',       
                                                                  'batch_normalization_183[0][0]']
                                                                                                  
 activation_183 (Activation)    (None, 7, 96)        0           ['add_91[0][0]']                 
                                                                                                  
 conv1d_184 (Conv1D)            (None, 7, 192)       55488       ['activation_183[0][0]']         
                                                                                                  
 batch_normalization_184 (Batch  (None, 7, 192)      768         ['conv1d_184[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_184 (Activation)    (None, 7, 192)       0           ['batch_normalization_184[0][0]']
                                                                                                  
 spatial_dropout1d_92 (SpatialD  (None, 7, 192)      0           ['activation_184[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_185 (Conv1D)            (None, 4, 192)       18624       ['activation_183[0][0]']         
                                                                                                  
 max_pooling1d_92 (MaxPooling1D  (None, 4, 192)      0           ['spatial_dropout1d_92[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_185 (Batch  (None, 4, 192)      768         ['conv1d_185[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_92 (Add)                   (None, 4, 192)       0           ['max_pooling1d_92[0][0]',       
                                                                  'batch_normalization_185[0][0]']
                                                                                                  
 activation_185 (Activation)    (None, 4, 192)       0           ['add_92[0][0]']                 
                                                                                                  
 global_average_pooling1d_30 (G  (None, 192)         0           ['activation_185[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_30 (Globa  (None, 192)         0           ['activation_185[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_30 (Concatenate)   (None, 384)          0           ['global_average_pooling1d_30[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_30[0][0]']
                                                                                                  
 dropout_60 (Dropout)           (None, 384)          0           ['concatenate_30[0][0]']         
                                                                                                  
 dense_30 (Dense)               (None, 128)          49280       ['dropout_60[0][0]']             
                                                                                                  
 dropout_61 (Dropout)           (None, 128)          0           ['dense_30[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_61[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_61[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 162,851
Trainable params: 161,507
Non-trainable params: 1,344
__________________________________________________________________________________________________
