Model: "model_23"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 41)]     0           []                               
                                                                                                  
 enhanced_preprocessing_11 (Enh  (None, 25, 123)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_138 (Conv1D)            (None, 25, 16)       5920        ['enhanced_preprocessing_11[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_138 (Batch  (None, 25, 16)      64          ['conv1d_138[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_138 (Activation)    (None, 25, 16)       0           ['batch_normalization_138[0][0]']
                                                                                                  
 spatial_dropout1d_69 (SpatialD  (None, 25, 16)      0           ['activation_138[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_139 (Conv1D)            (None, 13, 16)       1984        ['enhanced_preprocessing_11[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_69 (MaxPooling1D  (None, 13, 16)      0           ['spatial_dropout1d_69[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_139 (Batch  (None, 13, 16)      64          ['conv1d_139[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_69 (Add)                   (None, 13, 16)       0           ['max_pooling1d_69[0][0]',       
                                                                  'batch_normalization_139[0][0]']
                                                                                                  
 activation_139 (Activation)    (None, 13, 16)       0           ['add_69[0][0]']                 
                                                                                                  
 conv1d_140 (Conv1D)            (None, 13, 32)       1568        ['activation_139[0][0]']         
                                                                                                  
 batch_normalization_140 (Batch  (None, 13, 32)      128         ['conv1d_140[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_140 (Activation)    (None, 13, 32)       0           ['batch_normalization_140[0][0]']
                                                                                                  
 spatial_dropout1d_70 (SpatialD  (None, 13, 32)      0           ['activation_140[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_141 (Conv1D)            (None, 7, 32)        544         ['activation_139[0][0]']         
                                                                                                  
 max_pooling1d_70 (MaxPooling1D  (None, 7, 32)       0           ['spatial_dropout1d_70[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_141 (Batch  (None, 7, 32)       128         ['conv1d_141[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_70 (Add)                   (None, 7, 32)        0           ['max_pooling1d_70[0][0]',       
                                                                  'batch_normalization_141[0][0]']
                                                                                                  
 activation_141 (Activation)    (None, 7, 32)        0           ['add_70[0][0]']                 
                                                                                                  
 conv1d_142 (Conv1D)            (None, 7, 64)        6208        ['activation_141[0][0]']         
                                                                                                  
 batch_normalization_142 (Batch  (None, 7, 64)       256         ['conv1d_142[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_142 (Activation)    (None, 7, 64)        0           ['batch_normalization_142[0][0]']
                                                                                                  
 spatial_dropout1d_71 (SpatialD  (None, 7, 64)       0           ['activation_142[0][0]']         
 ropout1D)                                                                                        
                                                                                                  
 conv1d_143 (Conv1D)            (None, 4, 64)        2112        ['activation_141[0][0]']         
                                                                                                  
 max_pooling1d_71 (MaxPooling1D  (None, 4, 64)       0           ['spatial_dropout1d_71[0][0]']   
 )                                                                                                
                                                                                                  
 batch_normalization_143 (Batch  (None, 4, 64)       256         ['conv1d_143[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_71 (Add)                   (None, 4, 64)        0           ['max_pooling1d_71[0][0]',       
                                                                  'batch_normalization_143[0][0]']
                                                                                                  
 activation_143 (Activation)    (None, 4, 64)        0           ['add_71[0][0]']                 
                                                                                                  
 global_average_pooling1d_23 (G  (None, 64)          0           ['activation_143[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_23 (Globa  (None, 64)          0           ['activation_143[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_23 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_23[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_23[0][0]']
                                                                                                  
 dropout_46 (Dropout)           (None, 128)          0           ['concatenate_23[0][0]']         
                                                                                                  
 dense_23 (Dense)               (None, 128)          16512       ['dropout_46[0][0]']             
                                                                                                  
 dropout_47 (Dropout)           (None, 128)          0           ['dense_23[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_47[0][0]']             
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_47[0][0]']             
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 36,131
Trainable params: 35,683
Non-trainable params: 448
__________________________________________________________________________________________________
