Model: "model_61"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 basic_preprocessing_31 (BasicP  (None, 25, 61)      0           ['input[0][0]']                  
 reprocessing)                                                                                    
                                                                                                  
 conv1d_366 (Conv1D)            (None, 25, 16)       2944        ['basic_preprocessing_31[0][0]'] 
                                                                                                  
 batch_normalization_366 (Batch  (None, 25, 16)      64          ['conv1d_366[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_366 (Activation)    (None, 25, 16)       0           ['batch_normalization_366[0][0]']
                                                                                                  
 spatial_dropout1d_183 (Spatial  (None, 25, 16)      0           ['activation_366[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_367 (Conv1D)            (None, 13, 16)       992         ['basic_preprocessing_31[0][0]'] 
                                                                                                  
 max_pooling1d_183 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_183[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_367 (Batch  (None, 13, 16)      64          ['conv1d_367[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_183 (Add)                  (None, 13, 16)       0           ['max_pooling1d_183[0][0]',      
                                                                  'batch_normalization_367[0][0]']
                                                                                                  
 activation_367 (Activation)    (None, 13, 16)       0           ['add_183[0][0]']                
                                                                                                  
 conv1d_368 (Conv1D)            (None, 13, 32)       1568        ['activation_367[0][0]']         
                                                                                                  
 batch_normalization_368 (Batch  (None, 13, 32)      128         ['conv1d_368[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_368 (Activation)    (None, 13, 32)       0           ['batch_normalization_368[0][0]']
                                                                                                  
 spatial_dropout1d_184 (Spatial  (None, 13, 32)      0           ['activation_368[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_369 (Conv1D)            (None, 7, 32)        544         ['activation_367[0][0]']         
                                                                                                  
 max_pooling1d_184 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_184[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_369 (Batch  (None, 7, 32)       128         ['conv1d_369[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_184 (Add)                  (None, 7, 32)        0           ['max_pooling1d_184[0][0]',      
                                                                  'batch_normalization_369[0][0]']
                                                                                                  
 activation_369 (Activation)    (None, 7, 32)        0           ['add_184[0][0]']                
                                                                                                  
 conv1d_370 (Conv1D)            (None, 7, 64)        6208        ['activation_369[0][0]']         
                                                                                                  
 batch_normalization_370 (Batch  (None, 7, 64)       256         ['conv1d_370[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_370 (Activation)    (None, 7, 64)        0           ['batch_normalization_370[0][0]']
                                                                                                  
 spatial_dropout1d_185 (Spatial  (None, 7, 64)       0           ['activation_370[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_371 (Conv1D)            (None, 4, 64)        2112        ['activation_369[0][0]']         
                                                                                                  
 max_pooling1d_185 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_185[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_371 (Batch  (None, 4, 64)       256         ['conv1d_371[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_185 (Add)                  (None, 4, 64)        0           ['max_pooling1d_185[0][0]',      
                                                                  'batch_normalization_371[0][0]']
                                                                                                  
 activation_371 (Activation)    (None, 4, 64)        0           ['add_185[0][0]']                
                                                                                                  
 global_average_pooling1d_61 (G  (None, 64)          0           ['activation_371[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_61 (Globa  (None, 64)          0           ['activation_371[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_61 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_61[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_61[0][0]']
                                                                                                  
 dropout_122 (Dropout)          (None, 128)          0           ['concatenate_61[0][0]']         
                                                                                                  
 dense_61 (Dense)               (None, 128)          16512       ['dropout_122[0][0]']            
                                                                                                  
 dropout_123 (Dropout)          (None, 128)          0           ['dense_61[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_123[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_123[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 32,163
Trainable params: 31,715
Non-trainable params: 448
__________________________________________________________________________________________________
