Model: "model_64"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 61)]     0           []                               
                                                                                                  
 enhanced_preprocessing_31 (Enh  (None, 25, 183)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_384 (Conv1D)            (None, 25, 16)       8800        ['enhanced_preprocessing_31[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_384 (Batch  (None, 25, 16)      64          ['conv1d_384[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_384 (Activation)    (None, 25, 16)       0           ['batch_normalization_384[0][0]']
                                                                                                  
 spatial_dropout1d_192 (Spatial  (None, 25, 16)      0           ['activation_384[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_385 (Conv1D)            (None, 13, 16)       2944        ['enhanced_preprocessing_31[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_192 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_192[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_385 (Batch  (None, 13, 16)      64          ['conv1d_385[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_192 (Add)                  (None, 13, 16)       0           ['max_pooling1d_192[0][0]',      
                                                                  'batch_normalization_385[0][0]']
                                                                                                  
 activation_385 (Activation)    (None, 13, 16)       0           ['add_192[0][0]']                
                                                                                                  
 conv1d_386 (Conv1D)            (None, 13, 32)       1568        ['activation_385[0][0]']         
                                                                                                  
 batch_normalization_386 (Batch  (None, 13, 32)      128         ['conv1d_386[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_386 (Activation)    (None, 13, 32)       0           ['batch_normalization_386[0][0]']
                                                                                                  
 spatial_dropout1d_193 (Spatial  (None, 13, 32)      0           ['activation_386[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_387 (Conv1D)            (None, 7, 32)        544         ['activation_385[0][0]']         
                                                                                                  
 max_pooling1d_193 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_193[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_387 (Batch  (None, 7, 32)       128         ['conv1d_387[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_193 (Add)                  (None, 7, 32)        0           ['max_pooling1d_193[0][0]',      
                                                                  'batch_normalization_387[0][0]']
                                                                                                  
 activation_387 (Activation)    (None, 7, 32)        0           ['add_193[0][0]']                
                                                                                                  
 conv1d_388 (Conv1D)            (None, 7, 64)        6208        ['activation_387[0][0]']         
                                                                                                  
 batch_normalization_388 (Batch  (None, 7, 64)       256         ['conv1d_388[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_388 (Activation)    (None, 7, 64)        0           ['batch_normalization_388[0][0]']
                                                                                                  
 spatial_dropout1d_194 (Spatial  (None, 7, 64)       0           ['activation_388[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_389 (Conv1D)            (None, 4, 64)        2112        ['activation_387[0][0]']         
                                                                                                  
 max_pooling1d_194 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_194[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_389 (Batch  (None, 4, 64)       256         ['conv1d_389[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_194 (Add)                  (None, 4, 64)        0           ['max_pooling1d_194[0][0]',      
                                                                  'batch_normalization_389[0][0]']
                                                                                                  
 activation_389 (Activation)    (None, 4, 64)        0           ['add_194[0][0]']                
                                                                                                  
 global_average_pooling1d_64 (G  (None, 64)          0           ['activation_389[0][0]']         
 lobalAveragePooling1D)                                                                           
                                                                                                  
 global_max_pooling1d_64 (Globa  (None, 64)          0           ['activation_389[0][0]']         
 lMaxPooling1D)                                                                                   
                                                                                                  
 concatenate_64 (Concatenate)   (None, 128)          0           ['global_average_pooling1d_64[0][
                                                                 0]',                             
                                                                  'global_max_pooling1d_64[0][0]']
                                                                                                  
 dropout_128 (Dropout)          (None, 128)          0           ['concatenate_64[0][0]']         
                                                                                                  
 dense_64 (Dense)               (None, 128)          16512       ['dropout_128[0][0]']            
                                                                                                  
 dropout_129 (Dropout)          (None, 128)          0           ['dense_64[0][0]']               
                                                                                                  
 has_motion (Dense)             (None, 1)            129         ['dropout_129[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            258         ['dropout_129[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 39,971
Trainable params: 39,523
Non-trainable params: 448
__________________________________________________________________________________________________
