Model: "model_101"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input (InputLayer)             [(None, 25, 92)]     0           []                               
                                                                                                  
 enhanced_preprocessing_50 (Enh  (None, 25, 276)     0           ['input[0][0]']                  
 ancedPreprocessing)                                                                              
                                                                                                  
 conv1d_606 (Conv1D)            (None, 25, 16)       13264       ['enhanced_preprocessing_50[0][0]
                                                                 ']                               
                                                                                                  
 batch_normalization_606 (Batch  (None, 25, 16)      64          ['conv1d_606[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_606 (Activation)    (None, 25, 16)       0           ['batch_normalization_606[0][0]']
                                                                                                  
 spatial_dropout1d_303 (Spatial  (None, 25, 16)      0           ['activation_606[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_607 (Conv1D)            (None, 13, 16)       4432        ['enhanced_preprocessing_50[0][0]
                                                                 ']                               
                                                                                                  
 max_pooling1d_303 (MaxPooling1  (None, 13, 16)      0           ['spatial_dropout1d_303[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_607 (Batch  (None, 13, 16)      64          ['conv1d_607[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_303 (Add)                  (None, 13, 16)       0           ['max_pooling1d_303[0][0]',      
                                                                  'batch_normalization_607[0][0]']
                                                                                                  
 activation_607 (Activation)    (None, 13, 16)       0           ['add_303[0][0]']                
                                                                                                  
 conv1d_608 (Conv1D)            (None, 13, 32)       1568        ['activation_607[0][0]']         
                                                                                                  
 batch_normalization_608 (Batch  (None, 13, 32)      128         ['conv1d_608[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_608 (Activation)    (None, 13, 32)       0           ['batch_normalization_608[0][0]']
                                                                                                  
 spatial_dropout1d_304 (Spatial  (None, 13, 32)      0           ['activation_608[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_609 (Conv1D)            (None, 7, 32)        544         ['activation_607[0][0]']         
                                                                                                  
 max_pooling1d_304 (MaxPooling1  (None, 7, 32)       0           ['spatial_dropout1d_304[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_609 (Batch  (None, 7, 32)       128         ['conv1d_609[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_304 (Add)                  (None, 7, 32)        0           ['max_pooling1d_304[0][0]',      
                                                                  'batch_normalization_609[0][0]']
                                                                                                  
 activation_609 (Activation)    (None, 7, 32)        0           ['add_304[0][0]']                
                                                                                                  
 conv1d_610 (Conv1D)            (None, 7, 64)        6208        ['activation_609[0][0]']         
                                                                                                  
 batch_normalization_610 (Batch  (None, 7, 64)       256         ['conv1d_610[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 activation_610 (Activation)    (None, 7, 64)        0           ['batch_normalization_610[0][0]']
                                                                                                  
 spatial_dropout1d_305 (Spatial  (None, 7, 64)       0           ['activation_610[0][0]']         
 Dropout1D)                                                                                       
                                                                                                  
 conv1d_611 (Conv1D)            (None, 4, 64)        2112        ['activation_609[0][0]']         
                                                                                                  
 max_pooling1d_305 (MaxPooling1  (None, 4, 64)       0           ['spatial_dropout1d_305[0][0]']  
 D)                                                                                               
                                                                                                  
 batch_normalization_611 (Batch  (None, 4, 64)       256         ['conv1d_611[0][0]']             
 Normalization)                                                                                   
                                                                                                  
 add_305 (Add)                  (None, 4, 64)        0           ['max_pooling1d_305[0][0]',      
                                                                  'batch_normalization_611[0][0]']
                                                                                                  
 activation_611 (Activation)    (None, 4, 64)        0           ['add_305[0][0]']                
                                                                                                  
 global_average_pooling1d_101 (  (None, 64)          0           ['activation_611[0][0]']         
 GlobalAveragePooling1D)                                                                          
                                                                                                  
 global_max_pooling1d_101 (Glob  (None, 64)          0           ['activation_611[0][0]']         
 alMaxPooling1D)                                                                                  
                                                                                                  
 concatenate_101 (Concatenate)  (None, 128)          0           ['global_average_pooling1d_101[0]
                                                                 [0]',                            
                                                                  'global_max_pooling1d_101[0][0]'
                                                                 ]                                
                                                                                                  
 dropout_202 (Dropout)          (None, 128)          0           ['concatenate_101[0][0]']        
                                                                                                  
 dense_101 (Dense)              (None, 64)           8256        ['dropout_202[0][0]']            
                                                                                                  
 dropout_203 (Dropout)          (None, 64)           0           ['dense_101[0][0]']              
                                                                                                  
 has_motion (Dense)             (None, 1)            65          ['dropout_203[0][0]']            
                                                                                                  
 gesture_probs (Dense)          (None, 2)            130         ['dropout_203[0][0]']            
                                                                                                  
 output (Concatenate)           (None, 3)            0           ['has_motion[0][0]',             
                                                                  'gesture_probs[0][0]']          
                                                                                                  
==================================================================================================
Total params: 37,475
Trainable params: 37,027
Non-trainable params: 448
__________________________________________________________________________________________________
